[
    {
        "department_id": 6,
        "학과": "건축공학과",
        "학과설명": "건축공학과는 구조적 안정성과 지속가능성을 고려한 건축물을 설계하고 시공하는 데 필요한 전문지식을 교육하는 학문 분야입니다. 본 학과는 기초과학 및 수학적 원리를 바탕으로 건축공학의 기본 개념을 이해하고, 이를 응용하여 다양한 건축 및 인프라 프로젝트에서 공학적 문제를 해결할 수 있도록 교육합니다. 또한, 구술 및 공학적 작문 능력을 배양하여 효과적인 의사소통 능력을 갖춘 전문가를 양성하는 데 중점을 두고 있습니다.  건축공학과에서는 최신 기술과 설계 도구를 활용하여 실무 중심의 교육을 제공하며, 창의적인 사고와 문제 해결 능력을 함양하도록 돕습니다. 또한, 지속가능한 건축과 친환경 기술을 강조하며, 미래 건설 산업에서 요구하는 혁신적인 기술 개발을 위한 연구와 실습을 수행합니다. 이를 통해 본 학과는 건축 및 건설 산업에서 활약할 수 있는 창의적이고 실무 역량을 갖춘 전문 인재를 양성하는 것을 목표로 하고 있습니다.  학과 비전 건축공학과는 미래 건설 산업을 선도하는 글로벌 인재 양성을 목표로 하며, 지속가능하고 스마트한 건축 기술을 연구·개발하여 사회적 가치를 창출하는 데 중점을 둡니다. 이를 실현하기 위해, 본 학과는 다음과 같은 비전을 설정하고 있습니다.  1. 지속가능한 미래 건축 실현 친환경 건축 및 탄소중립 기술 개발을 통해 지속 가능한 건축 환경 조성 재생에너지와 순환경제 기반의 건축 솔루션 연구 2. 스마트 건설 및 디지털 혁신 주도 건설 자동화, 로보틱스, 인공지능(AI) 및 IoT 기술을 접목한 스마트 건설 기술 개발 BIM 및 디지털 트윈(Digital Twin)을 활용한 데이터 기반 건설 프로세스 혁신 3. 실무 중심의 융합 교육 제공 이론과 실무가 균형을 이루는 교육과정 운영 기업 및 연구기관과 협력하여 산업과 연계된 실무 경험 제공 4. 글로벌 경쟁력을 갖춘 인재 양성 국제 기준을 반영한 건축 및 건설 교육 제공 해외 연구 및 교류 프로그램 운영을 통한 글로벌 네트워크 구축 5. 건설 산업의 사회적 책임 강화 인간 중심의 건축 설계와 안전한 건설 환경 조성을 위한 연구 도시 인프라 개선 및 지역사회 발전을 위한 공공 프로젝트 참여 본 학과는 이러한 비전을 바탕으로 혁신적이고 지속 가능한 건설 기술을 연구하고, 4차 산업혁명 시대에 적합한 스마트 건축 전문 인재를 양성하여 미래 건설 산업을 선도하는 것을 목표로 하고 있습니다.  교육과정 건축공학과의 교육과정은 이론과 실무를 균형 있게 접목하여, 학생들이 건축공학의 전반적인 분야를 체계적으로 학습할 수 있도록 구성되어 있습니다.  기초과목 공학수학, 물리학, 화학 역학(정역학, 재료역학, 구조역학) 건축제도 및 CAD, 컴퓨터 활용 기초 건축공학개론 전공필수 및 선택과목 건축구조설계, 건축재료 및 시공 철근콘크리트 및 강구조 설계 건축환경 및 설비, 건축음향 건축시공 및 공정관리 친환경 건축 및 지속가능 설계 BIM(건축정보모델링) 및 디지털 설계 실습 및 프로젝트 건축 설계 및 구조 실험 시공 및 안전 실습 종합설계 프로젝트 (Capstone Design) 본 학과의 교육과정은 이론적 학습과 실무 중심의 실습을 조화롭게 구성하여, 졸업 후 건축구조설계, 건설관리, 친환경 건축, 스마트 건축 등 다양한 분야에서 활약할 수 있도록 돕고 있습니다.  연구 분야 건축공학과에서는 현대 건축 및 건설 산업의 변화에 대응하기 위해 다양한 연구 분야를 운영하고 있으며, 이를 통해 학문적 발전과 실용적 응용을 함께 도모하고 있습니다.  1. 건축 구조 및 내진공학 지진 및 풍하중에 대한 건축물의 내진 설계 연구 고강도 및 신소재를 활용한 구조 시스템 개발 건축물 구조 최적화 및 안전성 평가 2. 건축재료 및 시공기술 친환경 및 지속가능한 건축재료 개발 스마트 건축 기술 및 신공법 연구 첨단 시공 및 건설 자동화 기술 3. 건축환경 및 설비공학 에너지 효율적인 건축물 설계 및 제로에너지 빌딩(ZEB) 연구 실내 공기질 및 환경 쾌적성 개선 연구 건축물의 스마트 HVAC(냉난방 공조) 시스템 연구 4. 건설관리 및 BIM(Building Information Modeling) 건설 프로젝트의 효율적인 공정 및 비용 관리 연구 AI 및 데이터 기반의 스마트 건설 기술 연구 BIM 및 디지털 트윈(Digital Twin) 기술 응용 연구 5. 스마트 건축 및 도시 인프라 스마트 시티 및 지능형 건축 시스템 연구 IoT(사물인터넷) 및 AI를 활용한 건축 기술 개발 모듈러 건축 및 3D 프린팅 건축 기술 연구 졸업 후 진로 건축공학과 졸업생들은 다양한 분야에서 전문성을 발휘하며, 공공 및 민간 부문에서 건축과 건설 산업의 중심 역할을 수행할 수 있습니다.  1. 건축 및 구조 설계 분야 건축구조 엔지니어 구조해석 및 최적화 전문가 친환경 및 지속가능 건축 설계 전문가 건축 정보 모델링(BIM) 엔지니어 2. 건설 및 시공 관리 분야 건설기술자 및 공사 관리자 시공 및 품질관리 전문가 프로젝트 매니저(PM) 건설 자동화 및 로보틱스 전문가 3. 스마트 건설 및 IT 융합 분야 BIM 및 디지털 트윈(Digital Twin) 전문가 건설 데이터 분석 및 AI 활용 전문가 건설 자동화 및 로보틱스 연구원 4. 연구 및 학술 분야 건축공학 연구원(국립 연구소 및 기업 연구소) 대학 및 교육기관 교수 및 강사 공공기관 및 연구소의 정책 개발자 5. 창업 및 컨설팅 친환경 건축 및 스마트 건설 기술 기반 스타트업 창업 건설 및 건축 컨설팅 전문가 건설 투자 및 부동산 개발 전문가 본 학과는 이러한 비전을 바탕으로 혁신적이고 지속 가능한 건설 기술을 연구하고, 4차 산업혁명 시대에 적합한 스마트 건축 전문 인재를 양성하여 미래 건설 산업을 선도하는 것을 목표로 하고 있습니다."
    },
    {
        "department_id": 2,
        "학과": "경영학과",
        "학과설명": "경영학과는 기업 운영의 핵심 원리와 전략을 연구하며, 조직의 성장과 지속 가능성을 위한 경영 역량을 배양하는 학문입니다. 기업의 경영 전략, 마케팅, 재무·회계, 조직 관리, 생산 및 운영 관리, 데이터 기반 경영 등 경영의 다양한 영역을 통합적으로 학습하며, 이론과 실무를 결합한 교육 과정을 제공합니다.  오늘날의 글로벌 경제 환경에서는 디지털 전환, AI 기반 경영, ESG(환경·사회·지배구조) 경영, 지속 가능한 혁신, 데이터 기반 의사결정 등의 요소가 기업 경쟁력의 핵심이 되고 있습니다. 경영학과는 이러한 변화에 맞춰 최신 트렌드와 실무 중심의 교육을 통해 글로벌 시장에서 경쟁력을 갖춘 경영 전문가를 양성하는 것을 목표로 합니다.  학생들은 기업 경영의 원리를 탐구하고, 실제 비즈니스 사례를 분석하며, 실무 프로젝트와 인턴십을 통해 경영 전략을 실전에 적용하는 능력을 키우게 됩니다.  학과 목표 및 비전 경영학과는 이론적 지식을 바탕으로 실무 역량을 갖춘 창의적 경영 전문가를 양성하는 것을 목표로 하며, 다음과 같은 교육 방향을 설정하고 있습니다.  1. 전략적 의사결정 및 경영 분석 역량 강화 기업 경영 전략, 경쟁 분석, 시장 동향 예측 능력 배양 데이터 기반의 경영 의사결정 및 문제 해결 역량 강화 2. 실무 중심의 교육 및 혁신적 비즈니스 모델 개발 경영 시뮬레이션, 사례 연구 및 기업 프로젝트를 통한 실전 경험 제공 디지털 경영, AI 및 데이터 분석을 활용한 비즈니스 혁신 연구 3. 글로벌 경영 및 ESG(환경·사회·지배구조) 경영 연구 국제 비즈니스 환경 분석 및 다국적 기업 경영 전략 연구 지속 가능한 경영 모델 개발 및 윤리적 기업 운영 연구 4. 리더십 및 조직 관리 역량 강화 조직 행동, 인사 관리, 팀워크 및 리더십 개발 창의적 문제 해결과 혁신적인 기업 문화 구축 연구 배우는 내용 경영학과에서는 기업 운영의 이론적 기초부터 실무 응용까지 포괄적으로 학습하며, 실질적인 경영 문제 해결 능력을 배양할 수 있도록 구성된 교육 과정을 제공합니다.  1. 경영 전략 및 의사결정 경영전략 (Business Strategy): 기업 경쟁력 분석 및 성장 전략 연구 경영분석 (Business Analytics): 빅데이터를 활용한 경영 의사결정 방법론 학습 기업가정신 (Entrepreneurship): 창업 및 스타트업 성공 전략 연구 2. 마케팅 및 소비자 분석 마케팅 관리 (Marketing Management): 소비자 행동 분석 및 시장 조사 기법 학습 브랜드 전략 (Brand Management): 브랜드 가치 극대화 및 마케팅 전략 연구 디지털 마케팅 (Digital Marketing): 온라인 마케팅 및 소셜미디어 활용 전략 연구 3. 재무 및 회계 관리 재무관리 (Financial Management): 기업의 자금 조달 및 투자 전략 연구 기업 재무 전략 (Corporate Finance Strategy): 기업 가치 평가 및 리스크 관리 연구 관리회계 (Managerial Accounting): 기업 비용 분석 및 원가 절감 전략 연구 4. 조직관리 및 인적자원 개발 인사관리 (Human Resource Management): 인재 채용 및 조직 성과 평가 연구 리더십 (Leadership & Organizational Behavior): 조직 내 갈등 해결 및 리더십 개발 기업 문화 및 혁신 관리 (Corporate Culture & Innovation Management): 조직 혁신 및 변화 관리 연구 5. 생산 및 운영 관리 운영관리 (Operations Management): 생산 공정 최적화 및 프로세스 혁신 연구 공급망 관리 (Supply Chain Management, SCM): 글로벌 물류 및 효율적인 공급망 구축 연구 품질경영 (Quality Management): 제품 및 서비스 품질 향상 기법 연구 6. 데이터 기반 경영 및 경영 혁신 비즈니스 애널리틱스 (Business Analytics): AI 및 빅데이터 기반의 의사결정 모델 연구 데이터 경영 (Data-Driven Management): 데이터 기반 경영 전략 및 데이터 활용 능력 학습 블록체인 및 핀테크 경영 (Blockchain & Fintech Management): 최신 금융 기술 및 블록체인 응용 연구 연구 분야 경영학과에서는 현대 비즈니스 환경에서 기업 경쟁력을 확보하기 위한 다양한 연구를 진행하고 있습니다.  1. 경영 전략 및 기업 혁신 연구 기업의 지속 가능한 성장 및 글로벌 경쟁력 강화 전략 연구 디지털 트랜스포메이션 및 AI 기반 경영 혁신 연구 2. 마케팅 및 소비자 행동 연구 AI 및 빅데이터 기반 마케팅 전략 연구 소비자 경험(CX) 최적화 및 브랜드 관리 연구 3. 재무 및 투자 전략 연구 기업의 재무 건전성 평가 및 리스크 관리 연구 ESG 경영 및 지속 가능한 투자 전략 연구 4. 조직 관리 및 리더십 연구 인재 개발 및 조직 성과 최적화 연구 혁신 조직 문화 및 창의적 리더십 개발 연구 5. 데이터 기반 경영 및 기술 경영 연구 AI 및 빅데이터 활용한 경영 분석 연구 스마트 팩토리 및 자동화 경영 전략 연구 졸업 후 진로 경영학과 졸업생들은 다양한 산업과 분야에서 경영 전문가로 활동할 수 있으며, 대표적인 진로는 다음과 같습니다.  1. 기업 경영 및 전략 기획 대기업 및 중견기업의 전략 기획 및 경영 컨설팅 스타트업 및 벤처기업 창업 및 신사업 개발 2. 마케팅 및 브랜드 관리 소비자 분석 및 시장 조사 전문가 디지털 마케팅 및 브랜드 매니저 3. 재무 및 회계 전문가 기업 재무 및 투자 분석가 공인회계사(CPA), 세무사, 금융기관 애널리스트 4. 인사 및 조직 관리 인사관리 및 조직개발 전문가 HR 컨설턴트 및 리더십 코치 5. 생산 및 운영 관리 공급망 관리(SCM) 및 품질 경영 전문가 생산성 향상 및 운영 최적화 컨설팅 6. 데이터 기반 경영 및 IT 경영 비즈니스 애널리스트 및 데이터 분석 전문가 AI 기반 경영 컨설팅 및 디지털 혁신 부서 학과 목표 경영학과는 기업 운영의 원리를 탐구하고 효과적인 경영 전략을 개발하는 데 중점을 둡니다.  전략적 의사결정 역량 강화 – 데이터를 기반으로 한 합리적 경영 의사결정 능력 배양 실무 중심 교육 – 최신 트렌드를 반영한 실무 프로젝트 및 인턴십 기회 제공 혁신적인 비즈니스 모델 개발 – 창업 및 기업 혁신 연구를 통해 창의적 경영 전문가 양성 글로벌 경영 역량 강화 – 국제 비즈니스 환경에서 경쟁력 있는 경영 인재 육성 경영학과는 학생들이 급변하는 글로벌 경영 환경에서 효과적으로 대응할 수 있도록 실무 역량을 키우고, 글로벌 리더로 성장할 수 있도록 지원합니다."
    },
    {
        "department_id": 3,
        "학과": "경제학부",
        "학과설명": "경제학부는 경제 이론과 실무 지식을 바탕으로 경제 현상을 분석하고 예측하는 능력을 배양하여, 금융 및 경제 정책 전문가를 양성하는 학과입니다. 경제학은 시장과 금융 시스템을 이해하고, 자원 배분과 정책 수립을 통해 경제적 문제를 해결하는 핵심 학문으로, 경제 활동의 근본 원리를 탐구하고 이를 현실 경제에 적용하는 데 중점을 둡니다.  본 학과에서는 미시·거시경제학, 국제경제, 금융경제, 재정정책, 경제 데이터 분석 등 폭넓은 교육을 제공하며, 4차 산업혁명과 디지털 경제의 발전에 맞춰 최신 경제 이슈를 반영한 실무 중심의 교육과정을 운영합니다. 이를 통해 학생들은 경제 이론과 계량적 분석 능력을 기반으로 글로벌 경제 흐름을 이해하고, 실제 정책 및 금융 시장에서의 문제 해결 능력을 갖춘 경제 전문가로 성장할 수 있습니다.  학과 목표 및 비전 경제학부는 경제 이론과 실무적 응용을 결합한 교육을 통해 경제 분석, 정책 수립, 금융 시장 연구, 데이터 기반 경제 모델링 등 다양한 분야에서 주도적인 역할을 수행할 수 있도록 합니다.  1. 데이터 기반 경제 분석 역량 강화 최신 데이터 분석 기술과 계량경제학을 활용한 실증적 연구 수행 Python, R, Stata 등 데이터 분석 도구를 활용하여 경제 문제 해결 머신러닝과 인공지능(AI)을 접목한 경제 데이터 분석 역량 배양 2. 실무 중심 교육과 글로벌 경쟁력 강화 기업 및 공공기관과 연계한 프로젝트 및 인턴십 운영 국제 경제 및 금융 흐름을 반영한 실제 경제 현장 기반 교육 과정 제공 글로벌 경제 환경에서의 무역, 투자, 경기 분석 역량 배양 3. 정책 분석 및 금융 전략 연구 정부 및 민간 부문의 경제 정책 분석 및 평가 능력 배양 금융 시장과 투자 전략 연구를 통한 실무 적용 강화 금융정책, 공공재정, 규제정책 연구 및 데이터 기반 정책 효과 분석 4. 국제 경제 환경 대응 역량 강화 글로벌 경제 및 국제 무역 정책의 흐름 이해 및 분석 국제금융기구 및 다국적 기업과 협력한 연구 및 교육 진행 환율 변동, 무역 협정, FTA 및 글로벌 공급망 변화에 대한 심층 연구 경제학부는 이론적 깊이와 실무 역량을 겸비한 인재를 양성하여, 경제 및 금융 산업에서 경쟁력을 갖춘 전문가로 성장할 수 있도록 지원합니다.  배우는 내용 (주요 과목 및 학습 영역) 경제학부의 교육과정은 이론과 실무를 접목하여 현대 경제 문제를 분석하고 해결하는 능력을 배양하는 데 중점을 둡니다.  1. 경제 이론 및 분석 기초 과정 미시경제학 (Microeconomics): 시장 구조, 소비자 행동, 기업의 의사결정 분석 거시경제학 (Macroeconomics): 경제 성장, 실업, 인플레이션, 국가 경제 정책 연구 경제사 (Economic History): 경제 발전의 역사적 흐름 및 경제 모델 분석 계량경제학 (Econometrics): 통계 기법을 활용한 경제 데이터 분석 2. 금융경제 및 투자 전략 금융경제학 (Financial Economics): 금융 시장, 이자율, 투자 분석 연구 국제금융론 (International Finance): 글로벌 외환 시장과 국제 금융 시스템 분석 투자론 (Investment Analysis): 주식, 채권, 파생상품 분석 및 투자 전략 수립 핀테크 및 블록체인 경제 (Fintech & Blockchain Economics): 새로운 금융 기술과 디지털 화폐 연구 3. 정책 및 공공경제 연구 재정학 (Public Finance): 조세 정책, 정부 지출, 공공재 공급 분석 노동경제학 (Labor Economics): 임금 결정, 노동 시장 정책 연구 사회경제정책 (Social & Economic Policy): 소득 불평등, 복지 정책, 지속가능한 경제 성장 연구 환경경제학 (Environmental Economics): 기후 변화, 탄소 배출권, 지속 가능한 경제 모델 연구 4. 국제경제 및 글로벌 시장 분석 국제무역론 (International Trade Theory): 무역 정책, FTA, 보호무역과 자유무역 연구 환율 및 외환시장 분석 (Exchange Rate & Foreign Exchange Market): 글로벌 통화 가치 변동성 연구 다국적 기업 경제학 (Multinational Corporations Economics): 글로벌 기업의 투자 및 생산 전략 연구 5. 데이터 기반 경제 분석 및 AI 경제 연구 빅데이터와 경제 분석 (Big Data & Economic Analytics): 데이터 기반 경기 예측 및 경제 모델 개발 머신러닝을 활용한 경제 예측 (Machine Learning for Economic Forecasting): AI를 활용한 경제 데이터 분석 디지털 경제 및 플랫폼 경제 (Digital & Platform Economy): 공유경제, 전자상거래, 플랫폼 비즈니스 연구 연구 분야 경제학부에서는 경제 이론과 실증 연구를 통해 경제 및 금융 분야의 다양한 문제를 해결하는 데 중점을 둡니다.  1. 거시경제 및 정책 연구 경제 성장과 경기 변동 연구 통화정책 및 재정정책의 효과 분석 정부의 경제 개입 및 공공경제 연구 2. 미시경제 및 산업 조직 연구 시장 구조와 기업의 경쟁 전략 분석 소비자 행동 및 가격 결정 연구 행동경제학을 활용한 정책 효과 분석 3. 금융 및 투자 분석 연구 금융 시장 및 자산 가격 결정 이론 연구 금융 리스크 및 포트폴리오 최적화 연구 핀테크 및 블록체인 기반 금융 혁신 연구 4. 계량경제 및 데이터 분석 연구 머신러닝과 빅데이터를 활용한 경제 예측 모델 개발 실증 연구를 위한 통계 및 계량경제 기법 적용 경제지표 분석 및 경기 예측 연구 졸업 후 진로 경제학부 졸업생들은 다양한 산업과 분야에서 경제 전문가로 활약할 수 있으며, 대표적인 진로는 다음과 같습니다.  1. 금융 및 투자 전문가 은행, 증권사, 자산운용사, 보험사에서 금융 분석 및 투자 전략 수립 헤지펀드, 벤처 캐피털, 핀테크 기업에서 데이터 기반 투자 전략 개발 2. 경제 및 정책 분석가 **정부기관 및 공기업 (기획재정부, 한국은행, 금융감독원, 통계청)**에서 경제 정책 연구 및 거시경제 분석 **국내외 연구소 및 싱크탱크 (KDI, 한국금융연구원, 세계은행, OECD)**에서 경제 및 정책 연구 3. 기업 및 컨설팅 전문가 대기업 및 글로벌 기업에서 경제 분석, 리스크 관리, 경영 전략 수립 **컨설팅 회사 (맥킨지, BCG, 베인앤컴퍼니 등)**에서 경영 컨설팅 및 경제 전략 분석 4. 국제 경제 및 무역 전문가 **국제금융기구 (IMF, WTO, OECD, UN)**에서 활동 다국적 기업에서 국제 시장 분석 및 경제 협력 프로젝트 수행 5. 데이터 분석 및 AI 기반 경제 전문가 빅데이터 및 인공지능을 활용한 경제 연구 및 예측 분석 머신러닝 및 데이터 기반 금융 전략 수립 경제학부는 학생들이 경제 및 금융 분야에서 글로벌 경쟁력을 갖춘 전문가로 성장할 수 있도록 폭넓은 교육과 실무 경험을 제공합니다."
    },
    {
        "department_id": 89,
        "학과": "고고문화인류학과",
        "학과설명": "고고문화인류학과는 인간과 그 문화의 기원, 변화, 발전을 연구하는 학문으로, 고고학과 문화인류학을 포괄하는 학과입니다. 본 학과는 유적과 유물 발굴을 통해 과거 인류의 생활과 문화를 탐구하는 고고학과, 현재의 다양한 문화와 그 변화 과정을 연구하여 인간 사회를 심층적으로 분석하는 문화인류학을 전문적으로 교육합니다.  고고학 분야에서는 선사시대부터 조선시대에 이르는 유적을 발굴하고 연구하며, 유물 보존 및 문화유산 관리에 대한 실질적인 경험을 제공합니다. 문화인류학 분야에서는 현대 사회의 다양한 문화적 현상, 전통과 산업의 변화, 대중문화와 문화유산의 활용을 탐구하며, 이를 바탕으로 문화 기획, 박물관 및 전시 운영, 디지털 인류학, 문화유산 정책 연구 등 실용적인 분야로 확장할 수 있도록 지원합니다.  고고문화인류학과는 한국을 넘어 세계 각국의 역사와 문화에 대한 폭넓은 연구와 국제적인 시각을 바탕으로 인류 문화의 다양성을 탐구하는 학문적 중심지로 자리 잡고 있습니다.  학과 비전 및 목표 고고문화인류학과는 과거와 현재를 아우르는 문화 연구를 통해 문화유산의 가치를 보존하고, 이를 실용적으로 활용할 수 있는 전문가를 양성하는 것을 목표로 합니다.  1. 고고학 및 유적 연구의 전문성 강화 선사·고대 유적 발굴 및 분석 연구 유물 보존 및 박물관 전시 기획 역량 강화 문화유산 보호 및 활용 전략 연구 2. 문화인류학을 통한 현대 사회 및 문화 변화 연구 산업화, 도시화에 따른 전통문화의 변화 연구 대중문화, 문화 콘텐츠, 문화산업 분석 국제 문화교류 및 비교문화 연구 3. 실무 중심 교육을 통한 현장 연구 및 응용 능력 배양 발굴 실습, 유물 분석 및 보존 실습 운영 박물관 및 문화기관 연계 인턴십 지원 디지털 기술을 활용한 문화 연구 (디지털 인류학, 3D 유적 복원 연구 등) 4. 글로벌 문화 연구 및 국제 교류 역량 확대 세계 고고학 및 인류학 연구 네트워크 구축 국제 학술 교류 및 해외 유적 조사 참여 기회 제공 유네스코, ICOM(국제박물관협의회) 등 국제 기관과 협력 연구 진행 교육과정 고고문화인류학과의 교육과정은 고고학과 문화인류학의 학문적 균형을 이루면서도, 현장 실무 경험과 응용력을 키울 수 있도록 체계적으로 구성되어 있습니다.  1. 고고학 분야 고고학개론 (Introduction to Archaeology): 고고학의 이론적 기초와 연구 방법론 학습 유적 및 유물 발굴 실습 (Archaeological Fieldwork & Excavation Practice): 실제 발굴 실습 및 연구 진행 선사 및 고대 문화 연구 (Prehistoric and Ancient Cultures): 구석기, 신석기, 청동기 시대의 사회와 문화 연구 역사고고학 (Historical Archaeology): 삼국시대, 고려, 조선 시대의 고고학적 연구 문화유산 관리 및 보존학 (Cultural Heritage Management & Conservation): 문화재 보호 및 활용 방안 연구 2. 문화인류학 분야 문화인류학개론 (Introduction to Cultural Anthropology): 인간 문화의 개념과 주요 이론 연구 민속학 및 구술사 연구 (Folklore and Oral History Studies): 전통문화와 민속신앙 연구 도시 및 산업 인류학 (Urban and Industrial Anthropology): 현대 사회의 산업 및 도시 문화 연구 대중문화와 문화산업 (Popular Culture & Cultural Industries): 영상, 음악, 공연 등 대중문화의 사회적 의미 분석 국제 문화교류 및 비교문화연구 (Global Cultural Exchange & Cross-Cultural Studies): 세계 각국의 문화 비교 연구 3. 실무 및 응용 과정 박물관학 및 전시기획 (Museum Studies & Exhibition Planning): 박물관 운영 및 전시 기획 실습 문화 기획 및 축제 연구 (Cultural Planning & Festival Studies): 지역 문화 행사의 기획 및 운영 연구 디지털 인류학 (Digital Anthropology): 디지털 기술을 활용한 문화 연구 및 기록 방법 연구 연구 분야 및 연구실 고고문화인류학과에서는 유적 조사 및 연구, 문화유산 관리, 현대 문화 연구 등 다양한 연구 분야를 중심으로 국내외 학술 연구 및 현장 실습을 진행하고 있습니다.  1. 고고학 및 유적 연구 한국 및 세계 각국의 선사·고대 유적 발굴 연구 유물 분석 및 보존 기술 연구 역사적 도시 및 건축 유적 연구 2. 문화유산 관리 및 박물관 연구 문화유산 보호 및 활용 방안 연구 박물관 및 전시 기획 연구 전통문화의 현대적 재해석 및 보존 연구 3. 현대 문화 및 산업화 연구 대중문화 및 디지털 콘텐츠 연구 도시화 및 산업화에 따른 문화 변화 분석 축제, 문화 행사 및 문화정책 연구 졸업 후 진로 고고문화인류학과 졸업생들은 문화유산, 박물관, 관광, 문화 기획, 학술 연구 등 다양한 분야에서 전문성을 발휘할 수 있습니다.  1. 문화유산 및 박물관 분야 국립 및 사립 박물관 (학예사, 전시 기획자) 문화재청 및 문화재 연구소 (유적 발굴, 문화유산 관리) 국제 문화유산 보호 기관 (유네스코, ICOM 등) 2. 문화 기획 및 문화산업 분야 축제 및 문화 행사 기획 (지역 문화 축제, 전통문화 행사 기획자) 관광 및 문화 컨설팅 (문화유산 관광, 지역 문화 정책 기획) 미디어 및 대중문화 연구 (영상 제작, 콘텐츠 기획 및 문화콘텐츠 전문가) 3. 학술 연구 및 교육 분야 국내외 대학 및 연구기관 (문화인류학, 고고학 연구) 국제 학술 단체 및 연구소 연구원 고고학 및 인류학 전문 교육자 및 강사 학과의 역할과 목표 고고문화인류학과는 과거와 현재의 문화를 탐구하고 이를 실용적으로 활용할 수 있는 전문가를 양성하는 것을 목표로 합니다.  문화유산 보존 및 활용 역량 강화 – 고고학적 연구와 문화유산 관리 능력 배양 현대 문화 및 산업과의 연계 – 문화 기획, 관광, 미디어 활용 능력 증진 국제적 연구 역량 확대 – 글로벌 문화 비교 및 국제 교류 프로그램 운영 실무 중심 교육 제공 – 박물관 실습, 문화 기획 프로젝트, 유적 발굴 참여 기회 확대 본 학과는 국내외 고고학 및 문화 연구의 중심지로 자리 잡으며, 현대 사회에서 문화유산을 보존하고 활용하는 방법을 지속적으로 연구하고 있습니다."
    },
    {
        "department_id": 7,
        "학과": "고분자나노공학과",
        "학과설명": "고분자·나노공학과는 고분자 및 나노 소재 공학을 기반으로 IT, BT, NT 분야에서 활용 가능한 첨단 부품 및 소재를 연구·개발하는 학과입니다. 본 학과는 전자, 반도체, 바이오 의용 소재, 신재생에너지, 디스플레이(LCD, OLED) 등의 다양한 산업 분야에서 요구되는 고분자 및 나노 기술을 학습하고, 이를 실무에 적용할 수 있는 능력을 배양하는 융합형 학문을 제공합니다.  이 학과는 유기 신소재 분야의 고급 인력 부족에 대한 국가적 요청에 따라 신소재공학부에서 독립하여 설립되었으며, 짧은 역사에도 불구하고 고분자 및 나노 기술 분야에서 선도적인 위치를 차지하고 있습니다. 첨단 재료 및 소재 산업에서 중요한 역할을 수행하는 본 학과는 학생들에게 블루오션 산업과 국제 표준화 시대에 적응할 수 있는 역량을 갖추도록 지도하고 있습니다.  학과 비전 고분자·나노공학과는 차세대 신소재 및 나노 기술을 바탕으로 첨단 산업을 선도할 인재를 양성하는 것을 목표로 합니다.  1. 산업과 연계된 실무 중심 교육 최신 기술 트렌드를 반영한 실험 및 프로젝트 기반 학습 반도체, 디스플레이, 바이오 소재 등 다양한 산업 적용 연구 2. 창의적 연구 역량 강화 나노 기술, 신재생에너지, 바이오 소재 연구를 통한 미래 산업 대응 학제 간 융합 연구 및 창의적 문제 해결 능력 배양 3. 국제적 경쟁력 확보 글로벌 연구 협력 및 국제 표준화 프로젝트 참여 해외 연구 기관 및 기업과의 협력 네트워크 구축 4. 환경 친화적 기술 개발 지속 가능한 미래를 위한 친환경 고분자 및 신소재 연구 탄소중립 및 에너지 절감 기술 개발 본 학과는 미래 기술 혁신의 핵심이 될 고분자 및 나노 기술 전문가를 양성하여, 학생들이 다양한 산업 분야에서 국제적 경쟁력을 갖춘 인재로 성장할 수 있도록 지원합니다.  교육과정 고분자·나노공학과의 교육과정은 기초 과학, 고분자 및 나노 기술의 전문적 이해, 실무 적용을 목표로 구성되어 있으며, 학사 과정뿐만 아니라 대학원 과정을 통해 심도 있는 연구 기회를 제공합니다.  1. 기초 및 필수 과정 고분자화학 (Polymer Chemistry): 고분자의 합성 및 반응 기구 학습 나노소재 개론 (Introduction to Nanomaterials): 나노 기술과 소재의 기본 개념 이해 재료역학 및 고분자 물성 (Mechanics of Materials & Polymer Properties): 고분자 물질의 기계적·물리적 성질 분석 유기화학 및 물리화학 (Organic Chemistry & Physical Chemistry): 재료 개발을 위한 기초 화학 원리 학습 2. 심화 및 응용 과정 고분자 가공 및 공정 (Polymer Processing & Engineering): 고분자 제품의 제조 및 응용 기술 연구 나노구조 및 응용 (Nanostructures & Applications): 나노 소재의 설계 및 응용 분야 학습 전기·전자 고분자 소재 (Electronic & Optoelectronic Polymers): 반도체, 디스플레이, 센서 등에 활용되는 고분자 연구 바이오 고분자 및 의용소재 (Biopolymers & Biomedical Materials): 바이오 센서 및 의료용 고분자 소재 개발 친환경 고분자 및 신재생에너지 소재 (Sustainable Polymers & Renewable Energy Materials): 환경 친화적 소재 및 에너지 저장·변환 시스템 연구 3. 실험 및 연구 과정 고분자 및 나노소재 실험 (Polymer & Nanomaterials Laboratory) 3D 프린팅 및 첨단 소재 실험 (Advanced Materials & 3D Printing Lab) 반도체 및 디스플레이 재료 실습 (Semiconductor & Display Materials Practice) 연구 분야 고분자·나노공학과는 첨단 소재 산업의 발전에 발맞춰 다양한 연구 분야에서 활발한 연구 및 실용화 프로젝트를 진행하고 있습니다.  1. 고분자 합성 및 가공 기술 기능성 고분자 및 스마트 재료 개발 초고분자량 및 초분자 고분자 설계 2. 나노소재 및 나노기술 응용 나노 구조 설계 및 응용 (나노입자, 나노튜브, 그래핀 등) 나노 센서 및 바이오 나노 기술 연구 3. 전자 및 광전자 소재 반도체 및 디스플레이용 유기 전자소재 개발 고분자 태양전지 및 OLED 소재 연구 4. 바이오 및 의료용 소재 조직공학 및 바이오 고분자 연구 인공지능(AI) 기반 생체소재 설계 5. 친환경 및 신재생 에너지 소재 생분해성 고분자 및 지속 가능한 플라스틱 개발 연료전지 및 에너지 저장 소재 연구 졸업 후 진로 고분자·나노공학과 졸업생들은 IT, BT, NT, 전자·반도체, 신소재, 환경, 바이오·의료 등 다양한 첨단 산업 분야에서 핵심적인 역할을 수행할 수 있습니다.  1. 첨단 소재 및 반도체 산업 반도체 및 전자재료 기업 (삼성전자, SK하이닉스, LG디스플레이) 첨단 소재 기업 (듀폰, 3M, 코오롱, 한화케미칼, 솔베이) 2. 바이오 및 의료 소재 산업 바이오 및 의료기기 기업 (셀트리온, 한미약품, 메디톡스, 필립스 헬스케어) 인공 조직 및 바이오센서 연구소 3. 친환경 및 신재생에너지 분야 신재생에너지 및 배터리 기업 (LG에너지솔루션, SK이노베이션, 테슬라, 현대자동차) 수소연료전지 및 탄소중립 관련 연구소 4. 연구 및 학술 분야 국내외 연구기관 및 대학원 진학 (KIST, ETRI, KAIST, POSTECH) 공공 연구소 및 정부 기관 (국가과학기술연구회, 산업기술연구원) 고분자·나노공학과는 첨단 신소재 연구 및 산업 혁신을 선도할 글로벌 인재를 양성하는 것을 목표로 하고 있습니다. 본 학과는 지속 가능한 신소재 개발과 차세대 첨단 기술 연구를 통해 학생들이 미래 산업을 이끌어갈 핵심 인재로 성장할 수 있도록 지원합니다."
    },
    {
        "department_id": 91,
        "학과": "과학학과",
        "학과설명": "과학학과는 과학기술의 본질과 사회적 역할을 탐구하는 학문 분야로, 과학기술과 사회·문화 간의 관계를 심도 있게 연구합니다. 현대 사회에서 과학기술이 인류의 생존과 발전에 필수적인 요소로 자리 잡으면서, 이에 대한 이해와 분석이 점점 더 중요해지고 있습니다. 본 학과는 과학기술의 본질과 역사, 윤리적 문제, 정책 및 대중화 방안을 연구하여, 과학과 사회의 올바른 관계를 정립하고, 가치 있는 과학문화를 창출하는 것을 목표로 합니다.  과학학과에서는 과학기술과 사회의 상호작용을 깊이 이해하고, 이를 기반으로 효율적인 과학기술 정책 수립, 과학 커뮤니케이션 및 대중화, 기술철학 및 윤리 문제 해결에 기여할 수 있는 인재를 양성하고자 합니다. 또한, 21세기 디지털 혁신 및 빅데이터 시대에 대응할 수 있는 분석 역량을 배양하며, 과학기술이 인간과 사회에 미치는 영향을 종합적으로 탐구합니다.  과학학과의 교육과정은 과학기술의 역사, 철학, 사회적 영향, 정책 및 윤리 문제를 중심으로 구성되어 있으며, 학생들이 과학기술과 사회의 관계를 폭넓게 이해할 수 있도록 다양한 course를 제공합니다.  Course 과학기술의 역사 및 철학  한국과학문화재 (Korean Scientific Heritage): 한국의 과학기술 유산 연구 한국과학문명사 (History of Korean Scientific Civilization): 한국 과학기술의 발전 과정 분석 기술철학 (Philosophy of Technology): 과학기술의 철학적 개념과 가치 연구 과학기술사 (History of Science and Technology): 세계 과학기술의 발전 과정과 사회적 영향 탐구 과학기술과 사회의 관계 연구  과학기술사회학 (Sociology of Science and Technology): 과학과 기술이 사회적, 문화적 맥락에서 어떻게 형성되는지 연구 현대한국의 과학발전 (Modern Scientific Development in Korea): 대한민국 과학기술 발전 과정과 주요 이슈 분석 과학기술과 윤리 (Ethics in Science and Technology): 과학기술과 도덕적 문제에 대한 탐구 과학기술 정책 및 데이터 과학 윤리  과학기술정책 (Science and Technology Policy): 과학기술 발전을 위한 정책적 접근 방법 연구 빅데이터 윤리 (Big Data Ethics): 데이터 과학과 인공지능 기술의 윤리적 문제 분석 과학기술 법과 제도 (Science and Technology Law and Regulation): 과학기술과 관련된 법적·제도적 문제 탐구 과학문화 창출 및 대중화 연구  과학문화론 (Science Culture Studies): 과학이 대중 문화와 어떻게 융합되는지 분석 과학기술 홍보 및 커뮤니케이션 (Science Communication and Public Engagement): 과학기술을 효과적으로 전달하는 방법 연구 미디어와 과학기술 (Media and Science Technology): 대중매체가 과학기술을 표현하고 전달하는 방식 탐구 연구 분야 과학학과에서는 과학과 사회의 관계를 다양한 관점에서 연구하며, 다음과 같은 주요 연구 분야를 다룹니다.  과학기술과 역사 연구  한국 및 세계 과학문명 발전 과정 연구 전통 과학기술과 현대 과학기술의 연결고리 분석 과학기술과 사회적 영향 연구  과학기술 발전이 사회구조 및 문화에 미치는 영향 분석 기술 발전에 따른 윤리적·철학적 문제 해결 방안 연구 과학기술 정책 및 거버넌스 연구  국가 및 국제 과학기술 정책 연구 지속 가능한 과학기술 개발과 법·제도 연구 과학 커뮤니케이션 및 대중 인식 연구  대중이 과학을 이해하는 방식 연구 및 개선 방안 모색 과학 미디어, 전시, 박물관 등의 콘텐츠 개발 및 평가 졸업 후 진로 과학학과 졸업생들은 과학기술정책, 연구 기획, 과학 문화 콘텐츠 개발, 과학 커뮤니케이션 및 교육 등 다양한 분야에서 활약할 수 있습니다.  과학기술 정책 및 연구 기획 분야  정부 및 공공기관 (과학기술정보통신부, 국가과학기술연구회, 한국연구재단) 국내외 연구소 및 싱크탱크 (STEPI, KAIST 문명연구원, OECD 과학기술정책팀) 과학 커뮤니케이션 및 미디어 분야  과학 전문 저널리스트 및 미디어 전문가 (과학 방송·출판, 유튜브·팟캐스트 등 뉴미디어 콘텐츠 기획) 박물관 및 과학관 기획자 (국립과학관, 국립중앙박물관, 국립과학기술연구원) 과학문화 및 과학기술 대중화 분야  과학문화 콘텐츠 기획자 (과학 전시, 과학 축제 기획) 공공 및 민간 과학 커뮤니케이션 전문가 (과학 홍보 및 기업 커뮤니케이션) 학술 및 교육 분야  대학 및 연구소 연구원 (과학기술사, 과학철학, 기술사회학 연구) 과학 교육 및 정책 컨설팅 (교육기관, 국제기구, 과학 관련 NGO) 학과 목표 과학학과는 과학기술과 사회의 올바른 관계를 정립하고, 가치 있는 과학문화를 창출하며, 과학기술 정책 및 커뮤니케이션 역량을 갖춘 전문가를 양성하는 것을 목표로 합니다.  과학기술의 본질과 사회적 의미 탐구 – 과학기술의 발전이 사회와 문화에 미치는 영향을 연구 과학정책 및 윤리적 문제 해결 역량 강화 – 과학기술 관련 정책, 법, 윤리적 문제에 대한 이해 심화 대중과 소통하는 과학 커뮤니케이션 전문가 양성 – 효과적인 과학 홍보 및 교육 기법 학습 다양한 학문과 융합하는 창의적 연구 환경 조성 – 과학기술과 인문·사회과학, 미디어의 융합 연구 활성화 본 학과는 과학기술이 우리 사회에 미치는 영향을 깊이 있게 분석하고, 과학과 대중을 연결하는 역할을 수행할 창의적이고 비판적인 사고를 지닌 인재를 양성합니다."
    },
    {
        "department_id": 80,
        "학과": "국어국문학과",
        "학과설명": "국어국문학과는 한국어와 한국문학에 대한 깊이 있는 연구를 통해 전통문화를 계승·발전시키고, 현대 사회에서 언어와 문학이 수행하는 역할을 탐구하는 학문입니다. 본 학과에서는 국어와 문학을 체계적으로 학습하여 언어적 사고력과 문학적 감수성을 함양하며, 다양한 사회·문화적 맥락에서 한국어와 문학을 응용할 수 있는 전문 인재를 양성하는 것을 목표로 합니다.  학생들은 고전문학과 현대문학, 국어학, 문학 연구 방법론, 창작 및 스토리텔링, 커뮤니케이션과 의미론 등 다양한 분야를 학습하며, 언어와 문학이 가진 힘을 실생활에서 활용할 수 있는 방향을 모색합니다. 또한, 출판, 미디어, 교육, 콘텐츠 기획, 창작 및 문화산업 등 다양한 분야에서 실질적인 역량을 갖춘 전문가로 성장할 수 있도록 지원합니다.  학과 비전 국어국문학과는 전통과 현대를 아우르는 언어와 문학 연구를 통해 창의적이고 실용적인 역량을 갖춘 인재를 양성하는 것을 목표로 합니다.  1. 전통과 현대를 연결하는 교육 고전문학과 현대문학, 국어학과 디지털 콘텐츠 연구를 포괄하는 학문적 접근 언어와 문학을 활용한 사회적 기여 및 학문적 발전 도모 2. 국어와 문학의 사회적 역할 강화 미디어, 문화산업, 교육 분야에서 활용 가능한 역량 배양 한국어 및 한국문학의 세계화에 기여할 수 있는 연구 및 교육 지원 3. 창의적인 스토리텔링 및 창작 능력 개발 웹소설, 드라마, 영화 등 다양한 콘텐츠 창작 지원 서사 구조와 문학적 기법을 활용한 스토리텔링 교육 강화 4. 국제적 시각 확장 한국어와 한국문학을 해외에 알릴 수 있는 번역 및 교육 역량 강화 글로벌 문화 콘텐츠 시장에서 경쟁력을 갖춘 전문가 양성 교육과정 국어국문학과의 교육과정은 전통적인 언어 연구와 문학 연구뿐만 아니라 현대적인 창작과 실용적 응용을 포함하는 폭넓은 커리큘럼으로 구성되어 있습니다.  1. 국어학 연구 국어학의 이해: 국어의 구조와 체계를 탐구하며, 한국어의 특성을 학습 국어사 (국어사의 이해): 국어의 역사적 변천 과정과 시대별 특징 연구 국어음운론 (한국어 소리의 이해): 한국어 음운 체계 및 발음의 원리 분석 국어통사론 (국어 문법의 이해): 국어 문장의 구성 원리와 문법적 구조 탐색 방언과 언어생활: 한국어의 지역적 변이와 사회적 사용 방식 연구 2. 고전문학 연구 고전문학사: 한국 고전문학의 흐름과 시대별 작품 특징 학습 고전시가론: 고려가요, 시조, 가사 등 전통 시가 문학의 구조와 미학 탐구 고전비평의 이해: 조선 시대 문학 비평서 및 문학 이론 분석 고전소설강독·고전시가강독: 주요 고전 문학 작품을 직접 해석하고 비평하는 과정 3. 현대문학 연구 현대문학사: 개화기 이후 한국문학의 변천과 시대적 흐름 분석 현대시론: 현대시의 형식과 기법, 주요 작가와 작품 연구 현대소설론: 현대 소설의 서사적 특징과 문학적 의미 탐색 현대소설 작품 및 작가론: 개별 작가 연구 및 주요 소설 작품 분석 현대시 작품론: 시인의 시적 기법과 언어 실험 연구 4. 창작 및 실용 국문학 연구 시창작연습·산문창작연습: 시와 산문을 창작하고 문학적 표현 기법을 익히는 과정 희곡론: 연극 및 드라마 대본 창작과 극문학 연구 공연문화예술론: 문학과 공연 예술의 융합 연구 고서와 스토리텔링: 전통 문학과 현대 콘텐츠(웹소설, 드라마, 영화 등)의 연결 연구 5. 디지털 시대의 국어국문학 응용 국어자료정보처리론: 국어학과 문학 연구에서 데이터 분석 및 디지털 기술 활용법 연구 커뮤니케이션과 의미: 언어의 사회적 역할과 의미 전달 방식 연구 한국어 어문규범의 이해와 적용: 맞춤법, 띄어쓰기, 외래어 표기법 등을 학습하여 실무 능력 향상 졸업 후 진로 국어국문학과 졸업생들은 언론, 교육, 문화 콘텐츠, 번역 및 국어 연구 등 다양한 분야에서 활동할 수 있습니다.  1. 언론 및 미디어 분야 기자, 편집자, 방송 작가, 영화·드라마·웹소설 기획자 출판사 및 언론사(신문, 잡지, 방송국) 편집·교정 전문가 2. 교육 및 연구 분야 중·고등학교 국어 교사(교원 자격증 취득 후) 국어교육 연구원 및 한국어 교사(외국인을 위한 한국어 교육) 국립국어원 및 한국어 관련 연구소 연구원 3. 콘텐츠 및 창작 분야 소설가, 시인, 극작가(영화, 드라마, 연극 시나리오 작가) 웹소설·웹툰 기획 및 스토리 작가, 게임 스토리텔링 전문가 4. 국어 연구 및 번역·통역 분야 한국어 교육 및 번역(외국어 학습자를 위한 한국어 교재 개발) 국어사전 편찬 및 국어 연구 기관 연구원 5. 공공기관 및 행정 분야 국립국어원, 문화체육관광부, 국립박물관, 문화재청 등 공공기관 공무원(문화·예술·언어 관련 행정직) 국어국문학과는 언어와 문학의 가치를 재조명하고, 문화 콘텐츠 및 미디어 산업에서 활용 가능한 전문 지식을 갖춘 인재를 양성하는 것을 목표로 합니다. 다양한 산업과 융합 가능한 교육과정을 통해 학생들이 국어와 문학을 활용하여 창의적인 분야에서 역량을 발휘할 수 있도록 지원하고 있습니다."
    },
    {
        "department_id": 9,
        "학과": "기계공학과",
        "학과설명": "기계공학과는 수학, 기초과학, 컴퓨터 및 전공 기초 과목을 바탕으로 기계공학의 기초를 확립하고, 창의적인 문제 해결 능력을 갖춘 엔지니어를 양성하는 것을 목표로 합니다. 기계공학은 모든 공학의 기초가 되는 학문으로, 기계 시스템의 설계, 해석, 제작, 제어 등을 연구하여 산업 전반에서 중요한 역할을 수행합니다.  본 학과에서는 정역학, 동역학, 열역학, 유체역학, 고체역학, 기계재료, 제조공학 등의 필수 기초 과목을 통해 기계공학의 기본 원리를 체계적으로 학습하며, 이를 바탕으로 수치해석법, 유한요소법, 자동제어, 기계진동학 등의 고급 분석 기법을 익힙니다. 또한, 최신 CAD 및 해석 소프트웨어를 활용한 설계 능력을 배양하고, 메카트로닉스, 로봇공학, 자동차공학, 냉동·공기조화, 정밀가공, MEMS 공정 등 다양한 응용 분야를 학습할 수 있는 course를 개설하여 4차 산업혁명 시대에 요구되는 첨단 기술을 익힐 수 있도록 교육합니다.  특히, 종합설계(Capstone Design) 과정을 통해 실무 프로젝트 경험을 쌓으며, 창의적이고 실용적인 문제 해결 능력을 함양합니다. 기계공학과는 기계를 직접 용접하고 조립하는 것이 아니라, 기계를 설계하고 분석하는 방법을 배우는 학문으로, 다양한 공학적 원리와 응용 기술을 종합적으로 다루고 있습니다.  Course 기초 공학 및 필수 과목  정역학 (Statics): 힘의 평형과 구조물 해석 동역학 (Dynamics): 운동과 힘의 관계 연구 열역학 (Thermodynamics): 열 에너지의 변환 및 활용 유체역학 (Fluid Mechanics): 유체의 흐름과 압력 특성 연구 고체역학 (Solid Mechanics): 재료의 응력과 변형 해석 기계재료 (Mechanical Materials): 기계 구조물에 사용되는 재료 특성 연구 설계 및 해석 과정  수치해석법 (Numerical Analysis): 공학 문제 해결을 위한 수학적 해법 유한요소법 (Finite Element Method, FEM): 구조 해석 및 응력 분석 자동제어 (Automatic Control Systems): 기계 및 전자 시스템의 제어 기법 기계진동학 (Mechanical Vibrations): 진동 및 동적 응답 분석 컴퓨터지원설계(CAD) 및 해석 (CAE): 3D 모델링 및 시뮬레이션 응용 및 첨단 기술 분야  메카트로닉스 (Mechatronics): 전자공학과 기계공학의 융합 로봇공학 (Robotics Engineering): 로봇 설계 및 제어 기술 자동차공학 (Automotive Engineering): 차량 설계 및 동력전달 시스템 연구 냉동·공기조화 (Refrigeration & Air Conditioning): 공기조화 및 에너지 효율 연구 정밀가공 및 제조공학 (Precision Manufacturing & Production Engineering): CNC 및 스마트 제조 기술 MEMS 공정 (Micro-Electro-Mechanical Systems): 나노 및 마이크로 기계 시스템 개발 종합설계 및 실무 경험  캡스톤 디자인 (Capstone Design Project): 실무 프로젝트를 통한 종합적인 문제 해결 산학협력 인턴십 및 연구 프로젝트: 기업 및 연구소와 연계한 실무 경험 제공 연구 분야 기계공학과는 다양한 산업 분야에서 활용할 수 있는 최신 기술과 연구 개발을 진행하며, 주요 연구 분야는 다음과 같습니다.  첨단 기계 설계 및 제조 기술  스마트 제조 및 인공지능(AI) 기반 설계 초정밀 가공 및 3D 프린팅 기술 연구 에너지 및 환경 공학  친환경 에너지 시스템 (풍력, 태양열, 수소연료) 자동차 엔진 및 배터리 기술 로봇 및 메카트로닉스  자율주행 및 인공지능 로봇 개발 산업용 로봇 및 협업 로봇 기술 항공 및 우주공학  드론 및 미래 항공기 설계 우주탐사 및 극한 환경 기계 설계 졸업 후 진로 기계공학 전공자는 다양한 산업에서 핵심적인 역할을 담당하며, 기계산업뿐만 아니라 토목, 건축, 조선, 항공, 전자, 반도체, 에너지 산업 등에서도 활약할 수 있습니다.  기계 및 제조 산업  자동차, 로봇, 항공, 조선 등 기계 설계 및 생산 엔지니어 반도체, 전자제품, 디스플레이 등 정밀 제조 산업 에너지 및 플랜트 산업  신재생에너지 및 친환경 기술 개발 원자력 및 화력발전소 설계 및 유지보수 연구 및 학술 분야  대학원 진학 후 연구소 및 국책연구기관에서 연구직 수행 공대 교수 및 기술교육 전문가 공공기관 및 행정 분야  국가 연구기관 (한국기계연구원, 한국에너지기술연구원) 공무원 및 공기업 (한국전력, 가스공사, 조선해양공학 분야) 창업 및 기술 전문직  스타트업 및 창업 (스마트 제조, 로봇, AI 기계 설계) 변리사, 특허 엔지니어 (기술 개발 및 지적재산권 관리) 학과 목표 기계공학과는 4차 산업혁명 시대에 걸맞은 창의적이고 실무 능력을 갖춘 엔지니어를 양성하는 것을 목표로 합니다.  산업과 연계된 실무 중심 교육 – 최신 기술 트렌드를 반영한 실험 및 프로젝트 기반 학습 창의적 문제 해결 역량 강화 – 종합설계 및 연구 프로젝트 수행 국제적 경쟁력 확보 – 글로벌 기업 및 연구소와 협력 프로젝트 수행 지속 가능한 기술 개발 – 친환경 에너지 및 미래형 기계 기술 연구 기계공학과는 전통적인 기계 산업을 넘어, 미래 첨단 산업을 선도할 핵심 인재를 양성하여, 학생들이 다양한 산업 분야에서 국제적인 경쟁력을 갖춘 전문 엔지니어로 성장할 수 있도록 지원합니다."
    },
    {
        "department_id": 10,
        "학과": "기계설계공학부",
        "학과설명": "기계설계공학부는 기계설계공학전공과 나노바이오기계시스템공학전공으로 구성되어 있으며, 기계 설계와 첨단 나노·바이오 기술을 융합한 미래 공학 기술을 연구하는 학문 분야입니다. 본 학부는 최신 기술과 소프트웨어를 활용한 자동차 및 기계 요소 설계, 나노·바이오 기술 융합 연구, 의료 및 진단 시스템 개발 등을 통해 4차 산업혁명 시대를 선도할 전문 엔지니어 양성을 목표로 합니다.  기계설계공학전공에서는 첨단 자동화 설계 소프트웨어를 활용하여 자동차 및 다양한 기계 요소 부품을 설계하는 능력을 배양하며, 산업 전반에서 필요로 하는 정밀 설계 및 해석 역량을 갖춘 인재를 양성합니다.  나노바이오기계시스템공학전공은 나노 기술, 바이오 생명과학, 기계공학을 융합하여 첨단 기계 기술을 활용한 혁신적인 치료 및 진단 기술 개발에 초점을 맞추고 있습니다. 이를 통해 의료기기, 바이오센서, 정밀 나노기술 등의 연구·개발 능력을 배양하여 미래 바이오 및 헬스케어 산업을 이끌어갈 엔지니어를 양성합니다.  학과 비전 기계설계공학부는 첨단 기계 설계 기술과 나노·바이오 기술을 융합하여 차세대 엔지니어를 양성하는 것을 목표로 합니다.  1. 산업과 연계된 실무 중심 교육 최신 기술을 반영한 연구 프로젝트 및 인턴십 운영 종합설계(Capstone Design) 및 실험 연구 수행 2. 창의적 문제 해결 역량 강화 AI, IoT, 나노·바이오 기술과 기계공학을 융합한 융합기술 교육 첨단 설계 소프트웨어 및 해석 기술 활용 능력 배양 3. 국제적 연구 협력 및 글로벌 경쟁력 강화 해외 연구소 및 기업과의 협력 프로젝트 수행 글로벌 산업에서 경쟁력을 갖춘 전문 엔지니어 양성 교육과정 기계설계공학부는 기계설계의 핵심 이론과 실무, 나노·바이오 기술의 융합을 강조하는 교육과정을 운영하고 있습니다.  1. 기계설계공학전공 (Mechanical Design Engineering) 기계설계개론 (Introduction to Mechanical Design): 기계 설계의 기본 개념과 원리 CAD 및 3D 모델링 (Computer-Aided Design & 3D Modeling): 최신 설계 소프트웨어 활용 능력 배양 기계요소설계 (Machine Element Design): 자동차, 항공, 조선 등 다양한 산업에서 활용되는 기계 부품 설계 유한요소해석 (Finite Element Analysis, FEA): 기계 구조 해석 및 응력 분석 자동차 설계 및 해석 (Automotive Design & Analysis): 자동차 부품 설계 및 내구성 평가 제조 및 생산공학 (Manufacturing & Production Engineering): 3D 프린팅, CNC 가공, 정밀 가공 기술 2. 나노바이오기계시스템공학전공 (Nano-Bio Mechanical Systems Engineering) 나노공학 개론 (Introduction to Nano Engineering): 나노소재 및 나노구조 연구 바이오센서 및 진단기기 (Biosensors & Diagnostic Devices): 생체 신호 검출 및 분석 기술 정밀의료기기 설계 (Precision Medical Device Design): 의료용 로봇 및 바이오센서 시스템 개발 MEMS 및 바이오MEMS (Micro-Electro-Mechanical Systems & Bio-MEMS): 초소형 전자기계 시스템 연구 바이오 나노소재 (Bio-Nanomaterials): 바이오 친화적 나노소재 설계 및 응용 스마트 헬스케어 시스템 (Smart Healthcare Systems): 웨어러블 의료기기 및 디지털 헬스케어 기술 연구 분야 기계설계공학부에서는 전통적인 기계설계 연구뿐만 아니라, 나노·바이오 기술과 융합된 첨단 연구를 수행하며, 주요 연구 분야는 다음과 같습니다.  1. 첨단 기계 설계 및 해석 고성능 자동차 부품 및 구조 설계 항공기 및 우주 기계 시스템 설계 스마트 제조 및 인공지능(AI) 기반 기계 설계 2. 나노·바이오 기술 융합 연구 바이오센서 및 인공지능 기반 의료 진단 시스템 생체 삽입형 나노소재 및 인공 조직 연구 정밀 나노로봇 및 초소형 의료기기 설계 3. 자동화 및 로봇공학 의료용 로봇 및 정밀 제어 시스템 자율주행 및 AI 기반 기계 시스템 개발 4. 친환경 및 에너지 시스템 지속가능한 에너지 변환 시스템 연구 친환경 나노소재 기반 연료전지 및 배터리 기술 졸업 후 진로 기계설계공학부 졸업생들은 자동차, 항공, 의료기기, 반도체, 나노·바이오 기술, 스마트 제조 등 다양한 첨단 산업에서 활약할 수 있습니다.  1. 기계설계 및 제조 산업 자동차·항공·조선 엔지니어링 (현대자동차, 한국항공우주산업, 삼성중공업 등) 기계 설계 및 분석 (3D CAD, CAE 전문 엔지니어) 2. 바이오·의료기기 산업 의료기기 및 바이오센서 설계 (삼성바이오로직스, 메디톡스, 필립스 헬스케어) 정밀 의료 및 스마트 헬스케어 개발 3. 반도체 및 나노기술 산업 나노소재 및 MEMS 기반 반도체 설계 (삼성전자, SK하이닉스, ASML) 초정밀 기계 가공 및 나노공정 엔지니어 4. 연구 및 학술 분야 국내외 대학원 진학 및 연구소 연구원 (KAIST, POSTECH, MIT, ETH Zürich 등) 국가 연구기관 및 정부 산하 연구소 (KIST, ETRI, 한국기계연구원) 5. 로봇 및 AI 융합 산업 자율주행 로봇 및 AI 기반 제조 자동화 연구 스마트 팩토리 및 IoT 기반 기계 시스템 설계 6. 창업 및 기술 컨설팅 첨단 기계설계 및 바이오벤처 창업 나노·바이오 기술 기반 스타트업 기계설계공학부는 기계공학을 넘어 바이오, 나노, AI 등의 첨단 기술과 융합하여 글로벌 산업을 이끌어갈 전문 엔지니어를 양성하는 것을 목표로 합니다. 최신 산업 기술을 반영한 실무 중심 교육을 제공하며, 연구 프로젝트 및 국제 협력 프로그램을 통해 학생들이 창의적이고 도전적인 미래 공학자로 성장할 수 있도록 지원하고 있습니다."
    },
    {
        "department_id": 11,
        "학과": "기계시스템공학부",
        "학과설명": "기계시스템공학부는 정밀기계공학전공과 응용기계공학전공의 두 전공 체제로 운영되며, 4차 산업혁명 시대에 요구되는 문제 창발 역량, 도전 혁신 역량, 인텔리전스 전문 역량, 시스템 통합 역량을 함양하기 위한 체계적인 교육 커리큘럼을 제공합니다.  정밀기계공학전공에서는 로봇, 미래자동차, 플랜트, IT, 나노, 에너지 산업과 관련된 초정밀 생산기술에 대한 심화 교육을 제공하며, 응용기계공학전공에서는 이러한 산업 분야와 관련된 응용기계시스템 설계 기술을 심화 교육합니다. 이를 통해 학생들은 기계시스템공학 전 분야에 관한 이론과 실제적인 현장 응용 능력을 갖춘 고급 과학기술 인재로 성장하게 됩니다.  교육 목표 및 핵심 역량 문제 창발 역량: 산업 문제를 창의적으로 정의하고 해결하는 능력 도전 혁신 역량: 4차 산업혁명 시대의 신기술 개발 및 융합적 사고 능력 인텔리전스 전문 역량: 기계시스템의 스마트화 및 AI, 빅데이터 활용 능력 시스템 통합 역량: 복합 기계시스템을 설계, 제작, 최적화할 수 있는 능력 전공별 교육 과정 1. 정밀기계공학전공 정밀한 생산기술과 스마트 제조공정을 중심으로, 미래의 첨단 산업을 선도할 수 있는 기계시스템을 연구합니다.  정밀가공 및 생산공학 (Precision Manufacturing & Production Engineering) 나노 및 마이크로 시스템 (Nano/MEMS Engineering) 로봇 및 메카트로닉스 (Robotics & Mechatronics) 스마트 팩토리 및 자동화 시스템 (Smart Factory & Automation) 고급 재료공학 및 신소재 기술 (Advanced Materials & New Materials Engineering) 2. 응용기계공학전공 기계 시스템을 설계하고, 실제 산업에서 활용할 수 있도록 응용기술을 심화 학습합니다.  기계시스템 설계 및 해석 (Mechanical System Design & Analysis) 미래자동차 및 모빌리티 공학 (Future Automotive & Mobility Engineering) 에너지 및 친환경 시스템 (Energy & Sustainable Systems) 항공 및 우주 기계 시스템 (Aerospace & Space Engineering) 플랜트 및 구조 시스템 공학 (Plant & Structural Systems Engineering) 연구 분야 기계시스템공학부는 산업과 연구 현장에서 실질적인 기여를 할 수 있도록 다양한 연구 분야를 운영하고 있습니다.  스마트 제조 및 정밀가공 기술  AI 및 데이터 기반 제조 공정 초정밀 가공 및 3D 프린팅 기술 지능형 로봇 및 미래자동차 기술  자율주행 및 전기차 기술 협업 로봇 및 AI 기반 제어 시스템 에너지 및 친환경 기술  친환경 에너지 시스템(태양광, 수소연료, 풍력) 에너지 효율 최적화 및 열관리 기술 항공우주 및 고급 기계시스템  우주 탐사 로봇 및 드론 기술 극한 환경에서의 기계 시스템 설계 졸업 후 진로 기계시스템공학부 졸업생들은 첨단 기계산업, 전자·반도체, 자동차, 로봇, 항공우주, 에너지, IT, 플랜트 산업 등 다양한 분야에서 핵심 역할을 수행할 수 있습니다.  첨단 기계 및 제조 산업  스마트 제조, 반도체 공정 및 자동화 설비 엔지니어 초정밀 가공, 로봇 및 AI 융합 기술 전문가 자동차 및 미래 모빌리티 산업  전기차, 자율주행차 개발 및 제어 엔지니어 미래 모빌리티 및 친환경 자동차 연구원 에너지 및 환경 공학  신재생에너지(태양광, 풍력, 수소연료) 개발 에너지 저장 및 열관리 시스템 전문가 항공 및 우주 공학  드론 및 무인 항공기 개발 우주 탐사 및 극한 환경 시스템 엔지니어 연구 및 학술 분야  대학 및 국책 연구기관에서 연구직 수행 기계공학 및 융합공학 분야 교수 및 연구원 공공기관 및 기업 연구소  국가 연구소(한국기계연구원, 항공우주연구원, 전자통신연구원) 대기업 및 글로벌 기업 연구개발(R&D) 부서 학과의 비전 기계시스템공학부는 전통적인 기계공학을 넘어 4차 산업혁명 시대의 융합형 공학 인재를 양성하는 것을 목표로 합니다.  실무 중심 교육 제공 – 산업체 연계 프로젝트, 인턴십 및 연구 참여 기회 확대 창의적 문제 해결 능력 배양 – 실험 및 프로젝트 기반 학습 강화 국제적 역량 강화 – 글로벌 기업 및 연구소와 협력 프로젝트 수행 미래 첨단 기술 연구 – 인공지능, 스마트 제조, 친환경 에너지 기술 연구 기계시스템공학부는 산업과 기술의 변화에 발맞추어 혁신적인 연구와 교육을 지속하며, 학생들이 국제적인 경쟁력을 갖춘 전문 엔지니어로 성장할 수 있도록 적극 지원합니다."
    },
    {
        "department_id": 35,
        "학과": "농경제유통학부",
        "학과설명": "농경제유통학부는 전통적인 농업경제에서 농식품유통으로 확대되는 농산업의 변화에 대응하여, 농식품유통 전문가를 양성하는 것을 목표로 합니다. DDA(도하개발아젠다), FTA(자유무역협정) 등 글로벌 유통환경의 변화 속에서 농식품산업의 경쟁력을 강화하고, 효과적인 유통 전략을 수립할 수 있는 인재를 배출하고자 합니다.  농산업과 관련 산업에서 농식품유통의 중요성이 증가함에 따라, 기획력, 현장과 시장에 대한 통찰력, 네트워크적 협력이 필수적인 역량이 되고 있습니다. 본 학과에서는 농식품 경영, 소비자 행동, 마케팅 및 조사, 브랜드와 경영, 경영전략, 빅데이터 분석 등 전문 이론과 현장 실무를 병행하여, 농식품산업에서 다양한 능력을 발휘할 수 있는 인재를 양성합니다.  농경제유통학부의 교육과정은 농업경제학과 농식품유통을 중심으로 한 경영, 마케팅, 데이터 분석, 정책 연구 등을 포함하여 구성되어 있습니다.  Course 농업경제 및 경영 분야  농업경제학 (Agricultural Economics): 농업과 경제의 관계 및 농산업의 경제적 특성 연구 농업경영학 (Agribusiness Management): 농업경영 전략 및 효율적인 운영 방안 학습 농식품 경영전략 (Agrifood Business Strategy): 농식품 기업의 경영전략 및 시장 분석 농촌경제학 (Rural Economics): 농촌 경제의 구조와 발전 전략 연구 농식품 유통 및 마케팅  농식품유통론 (Agrifood Distribution & Logistics): 농산물 공급망 및 유통 시스템 분석 농식품 마케팅 (Agrifood Marketing): 소비자 행동 분석 및 브랜드 마케팅 기법 학습 소비자 행동 및 시장 조사 (Consumer Behavior & Market Research): 소비자의 구매 패턴 분석 및 유통 전략 수립 농식품 브랜드와 경영 (Agrifood Branding & Management): 농식품 브랜드 전략 개발 및 관리 데이터 분석 및 글로벌 농업 정책 연구  빅데이터와 농식품산업 (Big Data & Agrifood Industry): 농업 데이터 분석 및 스마트 농업 기술 활용 농업 및 식품 정책 (Agricultural & Food Policy): 국내외 농업 및 식품 정책 연구 FTA와 국제농업경제 (FTA & International Agricultural Economics): 국제 무역 협정이 농업에 미치는 영향 연구 스마트 유통과 전자상거래 (Smart Distribution & E-Commerce): 온라인 농식품 유통 전략 연구 실무 및 현장 연계 과정  농업 현장 실습 (Field Training in Agribusiness): 농업 기업 및 유통업체 실무 경험 캡스톤 디자인 (Capstone Design for Agribusiness): 농업·유통 산업 문제 해결을 위한 프로젝트 수행 창업 및 비즈니스 모델 개발 (Start-up & Business Model Development): 농업·유통 분야 창업 및 사업 계획 수립 연구 분야 농경제유통학부는 농업과 경제, 유통, 데이터 분석, 정책 연구 등 다양한 분야에서 연구를 수행하며, 주요 연구 분야는 다음과 같습니다.  스마트 농업 및 농산업 혁신 연구  농업 데이터 분석 및 빅데이터 활용 스마트 팜 및 자동화 농업 시스템 연구 농식품 유통 및 물류 최적화  농산물 공급망 관리 및 물류 최적화 온라인·모바일 유통 플랫폼 개발 소비자 행동 및 농식품 마케팅 연구  농식품 소비 트렌드 및 소비자 행동 분석 브랜드 및 제품 차별화 전략 연구 국제 농업 정책 및 무역 연구  FTA 및 글로벌 농업 시장 분석 지속가능한 농업정책 및 기후변화 대응 연구 졸업 후 진로 농경제유통학부 졸업생들은 농업경제, 농식품 유통, 마케팅, 정책 연구, 데이터 분석, 창업 등 다양한 분야에서 활동할 수 있습니다.  농업 및 식품 유통 기업  농업·식품 기업 (CJ제일제당, 농심, 오뚜기, 대상) 농산물 유통 및 물류 기업 (농협유통, 이마트, 쿠팡, 마켓컬리) 글로벌 농식품 기업 (네슬레, 카길, ADM 등) 농업 및 식품 정책 및 연구기관  정부기관 및 공공기관 (농림축산식품부, 한국농촌경제연구원) 국제기구 및 NGO (FAO, WTO, UNDP) 농업경제 연구소 및 컨설팅 회사 농식품 마케팅 및 브랜드 관리  농산물 및 식품 브랜드 마케팅 (식품회사, 프랜차이즈, 유통사) 소비자 데이터 분석 및 시장 조사 기관 창업 및 스타트업  스마트 농업 및 푸드테크 스타트업 창업 온라인 농식품 유통 플랫폼 개발 학과의 비전 농경제유통학부는 4차 산업혁명과 글로벌 유통 환경 변화 속에서 경쟁력을 갖춘 농식품 유통 전문가를 양성하는 것을 목표로 합니다.  산업과 연계된 실무 중심 교육 – 최신 유통 트렌드를 반영한 연구 프로젝트 및 인턴십 기회 확대 창의적 문제 해결 역량 강화 – 캡스톤 디자인 및 데이터 기반 분석 연구 수행 글로벌 경쟁력 강화 – 국제 협력 및 해외 연수 프로그램 운영 농경제유통학부는 농업경제, 유통, 마케팅, 데이터 분석을 융합한 전문성을 갖춘 인재를 양성하여, 학생들이 다양한 산업에서 영향력 있는 전문가로 성장할 수 있도록 지원합니다."
    },
    {
        "department_id": 34,
        "학과": "농생물학과",
        "학과설명": "농생물학과는 해충과 질병으로부터 식물자원을 보호하고, 농업 생물자원의 활용 및 생산성을 증대시키는 것을 목표로 하는 학문입니다. 본 학과는 **식물의학(Plant Medicine)**을 중심으로, 기초생물학, 곤충학, 식물병리학 등의 기초 이론을 학습하고, 병해충 발생 원인의 정확한 진단과 효율적인 방제 기술을 연구합니다.  이를 통해 농업과 환경을 조화롭게 유지하며, 지속 가능한 농업을 위한 생물학적 해충 및 병해 방제 전략을 개발하고자 합니다. 또한, 농업의 기반이 되는 생물자원의 연구를 바탕으로 재배 및 생산 효과를 증대시키기 위한 응용생물학적 지식을 교육하며, 종합적인 생물재해 방제체계를 확립할 수 있는 전문 인재를 양성합니다.  학과 비전 농생물학과는 지속 가능한 농업을 실현하고, 환경 친화적인 병해충 방제 기술을 개발하여 글로벌 농업 환경 변화에 대응할 수 있는 전문가를 양성하는 것을 목표로 합니다.  1. 지속 가능한 농업 및 환경 보호 기술 개발 친환경 해충 및 병해 방제 기술 연구 생물다양성 보존 및 생태계 기반 농업 기술 연구 2. 스마트 농업 및 정밀 농업 기술 연구 드론 및 원격 감지를 활용한 병해충 모니터링 시스템 개발 빅데이터 및 AI 기반 병해충 예측 시스템 연구 3. 생명과학 및 생물자원 연구 유전자 조작 및 미생물 활용을 통한 식물 면역력 강화 지속 가능한 생물자원 활용 및 농업 생명공학 연구 4. 산업과 연계된 실무 중심 교육 현장 경험을 강화하는 실습 및 연구 프로젝트 운영 농업 및 생명과학 산업과 협력한 기술 개발 및 적용 연구 교육과정 농생물학과의 교육과정은 식물의학, 곤충학, 식물병리학, 응용생물학 등의 분야를 중심으로 구성되어 있습니다.  1. 기초 생물학 및 식물과학 기초생물학 (General Biology): 생명체의 구조와 기능, 생명과학의 기본 개념 학습 식물학 개론 (Introduction to Plant Science): 식물의 구조, 생리작용 및 생태적 특성 연구 유전학 (Genetics): 식물 유전자의 특성과 유전 원리 이해 2. 해충 및 병해 관리 곤충학 (Entomology): 해충의 생태, 행동 및 방제 방법 연구 식물병리학 (Plant Pathology): 식물 질병의 원인과 예방·치료법 연구 응용 해충학 (Applied Entomology): 농업 해충 및 천적 활용 기술 학습 미생물학 및 병원균학 (Microbiology & Plant Pathogens): 식물 병원균의 특성과 방제 연구 3. 생물재해 방제 및 친환경 농업 기술 생물적 방제 (Biological Control): 친환경 해충 방제 및 자연 생태계 활용 연구 화학적 방제 및 농약학 (Chemical Pest Control & Pesticide Science): 농약의 원리 및 안전한 사용법 연구 식물면역학 (Plant Immunology): 식물의 자연 면역 반응 및 병해충 저항성 연구 종합적 병해충 관리(IPM, Integrated Pest Management): 해충과 질병을 종합적으로 관리하는 기술 4. 응용생물학 및 농업 생명과학 연구 환경생물학 (Environmental Biology): 생물다양성과 생태계 보존 연구 농업생명공학 (Agricultural Biotechnology): 유전자 변형 기술 및 농업생물 응용 연구 바이오컨트롤 기술 (Biocontrol Technology): 미생물 및 천적을 이용한 병해충 방제 연구 5. 실무 및 연구 연계 과정 현장 실습 및 연구 프로젝트 (Field Training & Research Project): 농업 관련 기관 및 연구소에서의 실무 경험 식물의학 실험 및 분석 기술 (Plant Medicine Lab & Diagnosis): 식물 병해충의 실험적 진단 및 분석 방법 연구 분야 농생물학과는 농업 생명과학과 환경보전 기술을 융합한 연구를 수행하며, 주요 연구 분야는 다음과 같습니다.  1. 해충 및 병해 방제 연구 친환경 해충 방제 기술 및 유용 천적 활용 연구 식물병의 원인 규명 및 예방·치료 기술 개발 2. 생물 다양성과 농업 환경 연구 농업 생태계 보전 및 지속가능한 농업 기술 연구 생물자원 및 미생물을 활용한 환경친화적 농업 연구 3. 유전자 조작 및 생명공학 연구 식물 면역 시스템 강화 및 병해충 저항성 품종 개발 미생물을 이용한 농업용 바이오 기술 연구 4. 스마트 농업 및 정밀 농업 기술 드론 및 원격 감지를 활용한 병해충 모니터링 시스템 개발 빅데이터 및 AI 기반 병해충 예측 시스템 연구 졸업 후 진로 농생물학과 졸업생들은 농업생명과학, 식물의학, 해충 및 병해 관리, 바이오 연구, 환경보전, 스마트 농업 기술 개발 등 다양한 분야에서 활동할 수 있습니다.  1. 농업 및 환경 관련 연구소 및 공공기관 농촌진흥청, 국립농업과학원, 국립식량과학원 환경부 및 생태계 보호 기관 국립식물검역소, 농산물품질관리원 2. 농약 및 생물 방제 산업 친환경 농약 및 생물 방제제 개발 연구소 생명공학 및 농업 생명과학 기업 3. 농업 및 바이오 연구 기관 생명공학 및 미생물 연구소 식물병리 및 해충 연구 기관 4. 스마트 농업 및 정밀 농업 기업 스마트 팜 및 IoT 기반 정밀 농업 기술 개발 기업 AI 및 빅데이터를 활용한 병해충 예측 시스템 개발 연구소 5. 창업 및 기술 컨설팅 친환경 해충 방제 및 농업 컨설팅 창업 바이오 및 생물자원 기반 스타트업 학과의 역할과 목표 농생물학과는 식물의 건강을 보호하고, 지속가능한 농업을 실현할 수 있는 전문가를 양성하는 것을 목표로 합니다.  실무 중심 교육 강화: 산업과 연계된 실습 및 연구 프로젝트 운영 창의적 문제 해결 역량 육성: 최신 기술을 반영한 연구 프로젝트 수행 스마트 농업 및 친환경 농업 연구 강화: 지속 가능한 생물 방제 기술 개발 농생물학과는 농업과 환경의 균형을 맞추는 지속가능한 생물 방제 기술을 연구하고, 식물보호 및 생물자원 활용 전문가를 양성하여, 다양한 산업에서 핵심적인 역할을 수행할 인재를 배출하는 것을 목표로 합니다."
    },
    {
        "department_id": 48,
        "학과": "농축산식품융합학과",
        "학과설명": "농축산식품융합학과는 국제 농축산식품 분야의 전문 인력을 양성하고, 개발도상국의 우수 연구자를 배출하기 위해 설립된 대학원 협동과정입니다. 본 학과는 농업, 축산, 식품 분야의 융합적 접근을 통해 기후변화 대응, 친환경 농업, 국제농업정책, 도시농업, 식품가공, 동물복지 등 다양한 연구 분야를 포괄하는 다학제적 교육 과정을 운영합니다.  본 학과의 목표는 지속가능한 농업과 식량안보, 글로벌 농업 협력, 친환경 농업기술 개발 등의 분야에서 선도적인 역할을 수행할 국제적 미래형 농업·축산·식품 전문가를 양성하는 것입니다. 이를 통해 농축산식품 산업의 글로벌 경쟁력을 강화하고, 지속 가능한 미래 농업을 실현하는 데 기여합니다.  Course 농업 및 환경 과학  기후변화와 농업 (Climate Change & Agriculture): 기후변화가 농업에 미치는 영향 및 적응 방안 연구 친환경 농업 (Sustainable & Eco-friendly Agriculture): 지속 가능한 농업기술 및 유기농업 연구 국제농업정책 (International Agricultural Policy): 글로벌 농업 협력 및 무역정책 연구 도시농업 (Urban Agriculture & Smart Farming): 스마트 팜, 수직농업 및 도시농업 시스템 연구 축산 및 동물복지학  동물복지학 (Animal Welfare & Ethics): 동물복지 기준 및 지속가능한 축산 연구 축산환경 및 에너지 (Livestock Environment & Energy): 축산업에서의 환경문제 및 에너지 효율화 연구 국제축산개발 (International Livestock Development): 개발도상국 축산업 발전 전략 연구 식품가공 및 유통  식품가공학 (Food Processing & Engineering): 농축산물을 활용한 가공 기술 및 식품 안전 연구 농축산식품 유통 및 마케팅 (Agrifood Distribution & Marketing): 글로벌 식품 유통 시스템 및 마케팅 전략 연구 식품안전 및 품질관리 (Food Safety & Quality Management): HACCP, 식품위생 및 품질 보증 연구 국제개발 및 융합 연구  국제농업개발 및 협력 (International Agricultural Development & Cooperation): 개발도상국 농업개발 및 협력 방안 연구 농업생명공학과 지속가능성 (Agricultural Biotechnology & Sustainability): 농업 유전자 기술 및 지속가능한 식량 생산 연구 농업 빅데이터 및 스마트 기술 (Big Data & Smart Agriculture): AI, 데이터 분석을 활용한 농업 최적화 기술 연구 연구 및 실습 과정  현장 실습 및 글로벌 농업 프로젝트 (Field Training & Global Agribusiness Project): 국제 농업·축산·식품 기업 및 기관에서의 실무 경험 캡스톤 연구 및 프로젝트 (Capstone Research & Development Project): 융합형 연구 프로젝트 수행 연구 분야 농축산식품융합학과는 농업, 축산, 식품과학의 융합 연구를 통해 지속가능한 농업·식품 산업 발전을 목표로 하며, 주요 연구 분야는 다음과 같습니다.  지속가능한 농업 및 기후변화 대응 연구  친환경 농업기술 및 스마트 농업 연구 기후변화에 따른 작물 및 축산 시스템 최적화 동물복지 및 지속가능한 축산 연구  친환경 사료 및 지속가능한 축산 기술 연구 가축 생태계와 동물복지 표준 연구 식품가공 및 글로벌 식량안보 연구  식품가공 및 식품 안정성 연구 글로벌 식량 공급망 및 유통 최적화 연구 스마트 농업 및 데이터 기반 농축산 연구  AI 및 빅데이터를 활용한 스마트 농업 기술 연구 스마트 축산 및 자동화 시스템 연구 국제 농업 협력 및 개발 연구  개발도상국 농업 발전을 위한 기술 협력 연구 글로벌 농업정책 및 무역 연구 졸업 후 진로 농축산식품융합학과 졸업생들은 국제 농업, 축산, 식품 산업의 다양한 분야에서 전문가로 활동할 수 있습니다.  국제기구 및 공공기관  UN 산하 기구 (FAO, WFP, IFAD) 국제농업연구센터 (CGIAR, IRRI 등) 농림축산식품부, 한국농촌경제연구원 농축산 및 식품 산업  글로벌 농식품 기업 (네슬레, 카길, ADM, 롯데푸드) 스마트 농업 및 스마트 축산 기술 개발 기업 친환경 농업 및 유기농 관련 기업 연구 및 학술 분야  대학 및 연구기관 (농업생명공학, 식품과학 연구소) 글로벌 식량안보 및 지속가능한 농업 연구소 창업 및 기술 컨설팅  친환경 농업 및 축산 기술 스타트업 글로벌 농식품 무역 및 수출 컨설팅 학과의 비전 농축산식품융합학과는 국제 농업·축산·식품 분야의 전문 인재를 양성하고, 지속가능한 농업 기술과 글로벌 식량안보를 위한 연구를 수행하는 것을 목표로 합니다.  산업과 연계된 실무 중심 교육 – 글로벌 농식품 기업 및 연구소와 협력 국제 농업 개발 및 협력 강화 – 개발도상국 농업 발전 및 기술 협력 지원 스마트 농업 및 축산 기술 연구 – AI 및 데이터 기반 최적화 기술 연구 기후변화 대응 및 지속가능한 농업 정책 개발 – 글로벌 식량안보 문제 해결 기여 농축산식품융합학과는 농업, 축산, 식품과학을 융합하여 국제적으로 경쟁력 있는 전문 인력을 배출하는 학문적 허브로 자리 잡는 것을 목표로 합니다."
    },
    {
        "department_id": 12,
        "학과": "도시공학과",
        "학과설명": "도시공학과는 도시 및 지역의 공간계획, 환경, 교통, 토지이용을 연구하고, 이를 바탕으로 지속가능한 도시 개발 및 정주 환경 개선을 목표로 하는 학문입니다. 도시공학은 물리적 계획뿐만 아니라 사회 및 경제 계획까지 포함하는 종합적 학문으로, 도시의 성장과 변화 과정을 분석하고, 쾌적한 도시 환경과 효율적인 교통 체계 구축을 연구합니다.  이 학과에서는 도시 공간의 효율적인 이용을 위한 도시계획, 토지이용, 교통계획, 도시설계, 환경계획 등의 이론을 배우며, GIS·CAD·스마트시티 기술을 활용한 데이터 분석 및 공간 설계 능력을 배양합니다. 또한, 4차 산업혁명과 연계한 도시 발전 방향을 탐구하며, 도시 문제 해결을 위한 스마트 도시 기술 및 정책 개발을 연구합니다.  교육과정 1학년: 도시공학 기초 및 기초 기술 습득 도시학개론: 도시의 개념과 성장 과정 이해 컴퓨터그래픽스기초: 조경 및 도시 설계를 위한 그래픽스 기술 학습 컴퓨터응용공간모델링실습: 공간 모델링을 통한 도시 설계 기초 실습 2학년: 도시 및 교통계획 이론과 실습 도시계획론: 도시계획의 이론과 원칙 학습 도시조사분석방법론: 도시 조사 및 데이터 분석 기법 연구 건축 및 환경설계의 이해: 건축과 환경 설계의 기초 개념 학습 교통운영: 도시 교통 시스템의 운영 원리 연구 가로설계: 도시 미관 및 가로 공간 설계 연구 토지이용계획: 효율적인 토지 활용 방안 연구 GIS 공간분석기초: GIS를 활용한 공간 분석 기초 학습 도시건축론: 도시 건축의 이론 및 설계 원칙 연구 도시계획사: 도시계획의 역사적 발전 과정 연구 교통공학개론: 교통공학의 기초 개념 이해 3학년: 전문성 강화 및 설계 실습 교통계획: 도시 교통계획의 이론과 실무 학습 도시종합설계: 도시 공간 설계 및 종합 실습 GIS 공간분석중급: 중급 GIS 기술을 활용한 도시 분석 단지계획 및 지구단위계획: 단지 및 지구 단위의 계획 수립 연구 도시개발론: 도시 개발과 재개발 전략 연구 도시관계법규: 도시 및 건축 관련 법규 연구 단지설계: 효율적인 단지 설계 기법 연구 교통공학실습: 교통공학 이론을 실무 사례에 적용 도시계획실습: 도시계획의 실제 적용 및 분석 4학년: 실무 적용 및 스마트 도시 연구 현장실습: 도시공학 분야 실무 경험 제공 공간관리 및 스마트도시정책론: 스마트시티 정책과 공간 관리 연구 도시종합계획실습: 도시 종합 계획 실습 및 프로젝트 수행 교통계획실습: 실질적인 교통 문제 해결 방안 탐구 커뮤니티 설계기법: 커뮤니티 중심의 공간 설계 연구 공간정보캡스톤디자인: 공간 정보를 활용한 종합 설계 연구 도시재생계획실습: 도시 재생을 위한 실습 및 현장 적용 도시교통시설공학: 도시 교통 시설 설계 및 운영 연구 부동산학 및 주택정책론: 부동산 및 주택 정책 연구 연구 분야 1. 스마트시티 및 도시 계획 연구 스마트시티 개발 및 ICT 기술 융합 연구 빅데이터 및 AI 기반 도시 공간 분석 지속가능한 도시 개발 전략 연구 자율주행, 스마트 교통 시스템 연구 2. 교통계획 및 운영 연구 도시 교통 네트워크 최적화 및 대중교통 시스템 연구 스마트 모빌리티 및 친환경 교통 정책 연구 도로 및 교통 시설 최적화 연구 3. 토지이용 및 도시개발 연구 지속가능한 토지이용 및 도시재생 전략 연구 친환경 및 에너지 효율적인 도시 개발 연구 도시 인프라 및 공공 공간 계획 연구 4. 공간정보 및 GIS 응용 연구 공간 데이터 분석 및 도시 설계 최적화 연구 GIS 기반 도시 문제 해결 및 예측 분석 공간정보기술을 활용한 환경 모니터링 및 도시 관리 5. 주택 및 부동산 개발 연구 주택정책 및 공공임대주택 연구 도시 부동산 시장 분석 및 정책 연구 부동산 개발 및 투자 전략 연구 졸업 후 진로 1. 도시 및 교통 관련 공공기관 및 연구소 국토교통부, 국토연구원, 한국교통연구원 지자체 도시계획 및 교통부서 공공기관 (LH공사, SH공사 등) 2. 도시계획 및 엔지니어링 기업 도시계획 및 건설 컨설팅 기업 스마트시티 및 공간정보 기술 기업 환경 및 지속가능한 도시개발 연구소 3. 교통공학 및 인프라 관련 기업 교통 엔지니어링 및 교통체계 설계 기업 철도 및 대중교통 시스템 기획 및 운영 기업 스마트 교통 및 모빌리티 솔루션 기업 4. 스마트시티 및 IT 융합 기업 스마트 교통 및 도시 인프라 개발 기업 GIS 및 공간 데이터 분석 기업 스마트시티 기술 및 도시 인프라 솔루션 기업 5. 부동산 및 주택 정책 관련 분야 부동산 개발 및 투자 기업 주택정책 연구 및 도시재생 컨설팅 학과의 비전 도시공학과는 스마트 도시 및 지속가능한 도시개발 연구를 통해 미래 도시 환경을 조성할 실무형 도시공학 전문가를 양성하는 것을 목표로 합니다.  스마트시티 및 첨단 기술 기반 도시개발 연구 공간정보 및 데이터 분석을 활용한 도시 문제 해결 지속가능한 도시 및 교통계획 전략 개발 실무 중심의 프로젝트 및 협력 연구 수행 도시공학과는 미래 도시와 교통을 연구하고, 지속가능한 도시 공간을 설계하는 글로벌 인재를 양성하는 학문적 중심으로 자리 잡고 있습니다."
    },
    {
        "department_id": 84,
        "학과": "독일학과",
        "학과설명": "독일학과는 독일어 구사 능력 향상을 핵심 목표로 하며, 독일어권 국가(독일, 스위스, 오스트리아)의 언어, 문화, 정치, 경제, 사회 전반을 심도 있게 연구하는 학문입니다. 본 학과는 학생들이 독일어를 언어적 도구로 활용하여 문학, 예술, 철학, 정치, 외교, 경제, 무역, 정보기술(IT) 등 다양한 분야에서 글로벌 역량을 갖춘 전문가로 성장할 수 있도록 교육합니다.  독일은 유럽연합(EU) 내 최대 경제 강국이자 국제 정치·경제·기술 발전을 선도하는 국가로서, 독일어 구사 능력은 국제 사회에서 경쟁력을 갖추는 중요한 요소입니다. 이에 따라 본 학과는 학생들이 독일어를 실용적으로 활용할 수 있도록 다양한 교육과정을 운영하며, 독일 및 유럽 국가들과 긴밀한 협력 관계를 맺고 있는 기업, 연구소, 국제기구에서 활동할 수 있도록 지원합니다.  학과 비전 독일학과는 독일어와 독일어권 문화 연구를 통해 국제 사회에서 독일어 전문가로 성장할 인재를 양성하는 것을 목표로 합니다.  1. 실용 독일어 교육 강화 기초부터 고급 수준까지 체계적인 독일어 교육 독일어권 국가에서 활용 가능한 실용 언어 교육 2. 다학문적 연구 및 융합 교육 독일 문학, 문화, 역사, 정치, 경제 등 다양한 학문적 접근 국제 협력, 무역, 외교 분야와의 연계 교육 3. 국제 교류 및 협력 프로그램 운영 독일 및 유럽 대학과의 교환학생 및 연수 프로그램 지원 글로벌 기업 및 국제기구와의 협력 기회 확대 4. 번역 및 통번역 전문가 양성 독일어-한국어 번역 및 통번역 연구 강화 디지털 콘텐츠 및 독일어 미디어 번역 능력 배양 교육과정 독일학과의 교육과정은 독일어 실력을 기초부터 고급 수준까지 체계적으로 향상시키는 데 중점을 둡니다.  1. 독일어 기초 및 언어 습득 독일어 소리연습 (Phonetics) 독일어 회화 1·2 (German Conversation) 독일어 작문 (German Composition) 독일어 기초 문법 (German Grammar Basics) 독일어 연습 (German Practice) 이 과정을 통해 발음 및 회화 능력을 탄탄히 다지고, 기초적인 작문과 문법을 익히며 독일어의 기본적인 언어 구조를 이해합니다.  2. 독일어 이론과 실습 병행 독일문학사 (History of German Literature) 독일어 번역 연습 (Translation Practice) 독일어 문법 심화 (Advanced German Grammar) 독일어권 지역 연구 (Introduction to German-Speaking Regions) 독일 언어와 문화 (German Language and Culture) 독일어권 국가의 역사, 문화, 문학을 연구하며 실질적인 독일어 활용 능력을 키우는 과정을 포함하고 있습니다.  3. 독일어 심화 학습 및 전문성 강화 고급 독일어 회화 (German Conversation High Level) 독일어 음운론 및 통사론 (Morphology & Syntax) 독일문학과 영화 (German Literature and Film) 독일 드라마 이해 (Introduction to German Drama) 독일어 의미론 및 화용론 (Semantics and Pragmatics) 독일어권 영화 감상 (Introduction to German Film) 베를린의 역사와 문화 (Historical and Cultural Studies of Berlin) 독일 작가론 (German Writer Studies) 독일 현대사회 연구 (Modern German Society Studies) 독일어 문학뿐만 아니라 영화, 대중문화, 예술, 철학 및 현대 정치와 경제 분석 등 다양한 학문적 연구가 이루어집니다.  연구 분야 독일학과에서는 독일어 및 독일어권 문화 연구를 바탕으로 다양한 학문적 접근을 시도하며, 특히 다음과 같은 주요 연구 분야를 중점적으로 다룹니다.  1. 독일어학 연구 독일어 음운론 및 통사론 연구 독일어 의미론 및 화용론 연구 독일어와 기타 유럽 언어의 비교 언어학적 연구 2. 독일 문학 및 문화 연구 중세에서 현대까지의 독일 문학 연구 독일어권 영화 및 대중문화 연구 독일 예술 및 철학 사상의 흐름 연구 3. 독일 역사 및 사회 연구 독일 현대사회 및 정치 연구 베를린의 역사와 문화 연구 독일어권 국가들의 경제 및 사회 구조 분석 4. 번역 및 실용 독일어 연구 독일어-한국어 번역 및 통번역 연구 디지털 콘텐츠 및 독일어 미디어 연구 독일어 교육 방법론 및 언어 습득 연구 5. 국제 관계 및 경제 연구 독일 및 유럽연합의 외교 및 국제정치 연구 독일어권 국가와의 무역 및 글로벌 경제 협력 연구 독일의 환경 정책 및 지속가능한 경제 발전 연구 졸업 후 진로 독일학과 졸업생들은 국제 비즈니스, 외교, 무역, 번역·통역, 관광, 문화 교류, 교육 및 학문 연구 등 다양한 분야에서 활약할 수 있습니다.  1. 국제 무역 및 경제 분야 독일 및 유럽 기업과의 무역 업무 독일어를 활용한 해외 영업 및 글로벌 마케팅 다국적 기업에서 독일어권 시장 담당 2. 번역 및 통역 전문가 국제 회의 및 외교 행사에서 독일어 통·번역 업무 출판 및 언론사에서 독일어 번역가로 활동 독일어 영상 및 디지털 콘텐츠 번역 3. 외교 및 국제기구 외교부 및 독일어권 국가와의 외교 업무 국제기구 (UN, EU, KOICA)에서 독일어를 활용한 국제 협력 활동 국제 개발 협력 NGO에서 독일어권 국가와의 프로젝트 수행 4. 관광 및 문화 교류 분야 독일어권 관광 산업 및 여행 가이드 독일-한국 문화 교류 행사 및 기획 업무 5. 교육 및 학계 독일어 교사 자격 취득 후 교육 분야 진출 독일어권 대학에서 연구 및 학문 활동 한국 및 해외 대학에서 독일어 관련 강의 및 연구 수행 학과의 역할과 목표 독일학과는 독일어를 기반으로 글로벌 역량을 갖춘 인재를 양성하며, 학생들이 다양한 국제 무대에서 활약할 수 있도록 지원합니다.  독일어 실력 강화를 위한 체계적 교육 문화, 문학, 경제, 정치 등 다방면의 학문 연구 국제 협력, 무역, 외교, 번역·통역 등 다양한 분야의 전문가 양성 독일학과 졸업생들은 국제 비즈니스, 무역, 외교, 관광, 문화 교류, 번역·통역, 교육 및 학문 연구 등 다양한 분야에서 독일어권 국가와의 협력을 이끄는 전문가로 성장하고 있습니다."
    },
    {
        "department_id": 36,
        "학과": "동물생명공학과",
        "학과설명": "동물생명공학전공은 동물자원과 생명과학 분야의 발전을 선도하는 학문으로, 생명공학적 기술을 활용하여 동물산업 및 의생명과학 분야에서 혁신적인 연구와 교육을 수행합니다. 21세기는 생명공학의 시대로, 세계 각국이 생명공학 발전을 국가 전략으로 삼고 있으며, 이에 발맞추어 본 전공은 동물자원을 기반으로 한 생명공학의 이론과 응용능력을 배양합니다.  본 전공은 첨단 실험실과 연구시설을 활용한 실무 중심 교육을 제공하며, **ET(생명공학), NT(나노기술), IT(정보기술)**을 융합한 다학제적 교육을 통해 창의력과 응용력을 갖춘 미래형 인재를 양성하는 데 중점을 두고 있습니다. 동물 생명공학의 발전을 위한 신기술 개발 및 연구를 수행하며, 산업과 학문의 융합을 통해 동물 관련 산업의 다양화 및 전문화에 기여하고 있습니다.  교육 목표 생명공학 기반의 동물자원 연구  동물유전학, 동물영양학, 근육생물학 등 생명과학 기초 학문을 바탕으로 동물 생명공학 기술을 연구 생명공학적 기법을 활용하여 동물산업의 효율성을 향상 첨단 바이오 기술 융합  ET(생명공학), NT(나노기술), IT(정보기술)을 접목한 융합 교육 제공 복제 및 형질전환 동물 연구, 이종장기 생산 기술 개발 실무 중심의 연구 및 교육  동물 생명공학 관련 실험 및 현장 실습을 통한 실무 능력 배양 동물 유전체 연구 및 생명정보학(Animal Bioinformatics) 활용 Well-being 및 인류 복지 기여  지속 가능한 동물 생명과학 연구를 통해 인간과 동물의 건강 증진 친환경적이고 안전한 동물산업 개발 Course 1~2학년: 기초 이론 및 연구 기초 동물생명공학개론 (Introduction to Animal Biotechnology) 동물분자유전학 (Animal Molecular Genetics) 경제동물생리학 (Economic Animal Physiology) 동물유전학 (Animal Genetics) 동물영양학 (Animal Nutrition) 기초생화학 (Basic Biochemistry) 분자세포생물학 (Molecular Cellular Biology) 동물시스템생물학 (Biology of Bio System) 동물소재공학 (Animal Resource Engineering) 유전체학개론 (Introduction to Genomics) 3학년: 응용 및 실험 연구 동물육종학 (Animal Breeding) 동물사양시스템학 (Animal Feeding System) 경제동물내분비학 (Economic Animal Endocrinology) 근육생물학 (Muscle Biology) 동물면역학 (Animal Immunology) 동물생명정보학 (Animal Bioinformatics) 4학년: 연구 프로젝트 및 실무 적용 경제동물번식공학 (Economic Animal Reproduction Engineering) 동물생산관리학 (Animal Production Management) 양돈과학 (Swine Science) 동물단백체학 (Animal Proteomics) 반려동물과학 (Animal Companion Science) 동물생명과학연구 (Research of Animal Bio Science) 경제동물발생공학 (Economic Animal Embryology) 동물진단과학 (Animal Diagnosis Science) 집단유전학 (Population Genetics) 캡스톤디자인 (Capstone Design 1, 2) 유전공학 (Genetic Engineering) 연구 분야 동물 생명공학 및 유전자 연구  동물 유전자 조작 및 형질전환 연구 유전체학 및 유전공학 기술 개발 동물 영양 및 생리학 연구  최적의 동물영양 및 사양 관리 연구 경제동물의 내분비 및 생리학적 반응 연구 의생명 및 기능성 소재 연구  동물 유래 기능성 물질 연구 의료 및 바이오 산업과의 융합 연구 복제 및 형질전환 기술 연구  이종장기 생산 및 생명윤리 연구 동물복제 및 줄기세포 응용 연구 스마트 축산 및 데이터 기반 연구  동물 생명정보학 및 빅데이터 분석 AI 및 자동화 기술을 활용한 동물산업 혁신 졸업 후 진로 동물생명공학전공 졸업생들은 바이오산업, 동물자원 산업, 생명과학 연구소, 정부기관 등 다양한 분야에서 활동할 수 있습니다.  생명공학 및 연구소  국공립 연구소 (농촌진흥청, 국립수의과학검역원 등) 동물생명과학 및 바이오 연구소 대학원 진학 및 해외 유학 동물 및 생명과학 관련 기업  생명공학 기업 (바이오제약, 유전자 연구소) 동물사료 및 동물성식품 가공회사 반려동물 관련 산업 (동물의약품, 기능성 사료 개발) 의생명 및 의료 분야  의학전문대학원 및 임상의학 연구 불임클리닉 및 생식공학 관련 연구소 줄기세포 및 이종장기 연구 농·축산 및 공공기관  농협 및 축산협동조합 한국마사회 및 동물복지 관련 기관 중등교원, 대학교원 및 교육 연구직 학과의 비전 동물생명공학전공은 동물자원 및 생명과학 분야의 선도적 역할을 수행하며, 지속 가능한 동물산업과 인류 복지를 위한 첨단 생명공학 기술 개발을 목표로 합니다.  산업과 연계된 실무 중심 교육 – 바이오기업, 농·축산업체와 협력하여 실습 및 연구 기회 제공 창의적 문제 해결 능력 배양 – 유전체학, 생명정보학 등 최신 기술을 반영한 연구 수행 글로벌 경쟁력 강화 – 국제 연구 협력 및 해외 대학과의 공동 프로젝트 진행 Well-being과 인류 복지 기여 – 동물과 인간이 공존하는 지속 가능한 생명과학 연구 수행 동물생명공학전공은 생명공학과 동물자원의 융합을 통해 미래 생명과학 산업을 선도할 글로벌 인재를 양성하는 것을 목표로 합니다."
    },
    {
        "department_id": 37,
        "학과": "동물자원과학과",
        "학과설명": "동물자원과학과는 가축 및 동물자원의 생산, 가공, 소비 전반에 걸친 과학적 연구와 교육을 수행하는 학문으로, 동물영양, 번식, 육종, 초지관리 등의 생산기술과 축산식품 가공기술에 대한 기초지식과 응용기술을 학습합니다.  본 학과는 소, 돼지, 닭 등 전통적인 경제동물뿐만 아니라, 특수가축 및 애완동물 등 다양한 축종을 연구하며, 인간과 동물의 공존을 위한 친환경적이고 지속가능한 축산업 발전을 목표로 합니다. 특히, 고품질 축산식품 생산 및 가공 기술, 동물복지, 친환경 가축환경 관리, 기능성 축산식품 개발 등 현대 축산업의 요구에 부응하는 전문 인재 양성을 목표로 합니다.  학과 비전 동물자원과학과는 과학적이고 체계적인 축산 교육 및 연구를 수행하며, 지속 가능한 축산업 발전을 위한 실용적이고 혁신적인 기술을 연구하는 것을 목표로 합니다.  1. 지속 가능한 축산업 실현 친환경 및 지속가능한 축산업 기술 개발 가축 복지 기준 정립 및 환경 친화적 사육 시스템 연구 2. 고품질 축산식품 생산 및 안전성 강화 축산물 위생 및 품질 개선 연구 기능성 축산식품 개발 및 식품 안전 기술 연구 3. 스마트 축산 및 자동화 기술 연구 AI 및 IoT 기반 스마트 팜 시스템 개발 로봇 기술을 활용한 자동화 축산 연구 4. 산업 연계 및 실무 중심 교육 강화 대기업 및 연구소와 연계한 실습 및 연구 프로젝트 운영 현장 실무 경험을 쌓을 수 있는 인턴십 및 기술 교육 제공 교육과정 동물자원과학과의 교육과정은 가축생산, 동물영양, 축산식품가공, 동물복지 및 환경관리 등 다양한 분야를 포함하여 구성되어 있습니다.  1. 기초 및 전공 필수 과목 동물자원과학 개론 (Introduction to Animal Resources Science) 동물생리학 (Animal Physiology) 동물영양학 (Animal Nutrition) 동물번식학 (Animal Reproduction) 가축유전육종학 (Animal Genetics & Breeding) 사료학 (Feed Science & Technology) 2. 가축 생산 및 관리 가축사양관리 (Livestock Management) 가축질병학 (Animal Diseases & Veterinary Science) 초지 및 사료작물학 (Pasture & Forage Crops) 동물생명공학 (Animal Biotechnology) 가축환경 및 동물복지 (Animal Welfare & Environment Management) 3. 축산식품 가공 및 품질 관리 축산식품가공학 (Meat, Dairy & Egg Processing) 기능성 축산식품학 (Functional Livestock Products) 식품미생물학 (Food Microbiology) HACCP 및 식품위생 (HACCP & Food Safety) 축산물 품질평가 (Livestock Product Quality Evaluation) 4. 친환경 축산 및 지속가능한 축산업 친환경 축산학 (Eco-friendly Livestock Production) 동물복지 및 지속가능 축산 (Sustainable Livestock & Animal Welfare) 축산에너지 및 온실가스 관리 (Livestock Energy & Greenhouse Gas Management) 5. 실험 및 연구 과정 가축생리 실험 (Animal Physiology Lab) 동물번식 및 인공수정 실습 (Reproduction & Artificial Insemination Lab) 사료 및 영양 분석 실습 (Feed & Nutrition Analysis Lab) 축산식품가공 실습 (Livestock Product Processing Lab) 캡스톤 디자인 및 연구 프로젝트 (Capstone Design & Research Project) 연구 분야 동물자원과학과는 가축 생산, 영양, 유전육종, 축산식품 가공, 친환경 축산 등 다양한 연구 분야를 다루며, 다음과 같은 주요 연구를 수행합니다.  1. 가축 생산 및 번식 연구 유전자 개량 및 맞춤형 육종 기술 연구 가축 번식 기술 개발 및 수정란 이식 연구 가축 사양 및 생산성 향상 연구 2. 동물영양 및 사료 연구 기능성 사료 및 친환경 사료 개발 가축 영양 대사 및 사료 효율 연구 축산업의 탄소 배출 저감을 위한 사료 연구 3. 축산식품 가공 및 품질 개선 연구 기능성 축산식품 개발 및 건강식품 연구 육류 및 유제품의 가공 및 품질 유지 기술 연구 축산물 위생 및 식품안전 연구 (HACCP 적용 연구) 4. 동물복지 및 친환경 축산 연구 지속 가능한 축산 시스템 개발 가축 복지 기준 및 환경 친화적 사육 시스템 연구 가축 폐기물 및 온실가스 저감 기술 연구 5. 스마트 축산 및 축산 자동화 연구 AI 및 IoT 기반 스마트 팜 시스템 개발 로봇 기술을 활용한 자동화 축산 연구 데이터 분석을 통한 가축 건강 모니터링 시스템 연구 졸업 후 진로 동물자원과학과 졸업생들은 축산업, 식품산업, 동물영양, 유전육종, 생명과학 및 친환경 농업 등 다양한 산업 분야에서 활동할 수 있습니다.  1. 축산 및 농축산업 관련 분야 대기업 축산업체 및 농장 운영 (CJ제일제당, 하림, 선진, 팜스코 등) 사료 및 동물영양 관련 기업 (카길, 한일사료, 우성사료) 친환경 축산 및 스마트 축산 관련 연구소 2. 축산식품 가공 및 품질 관리 분야 육류, 유제품, 계란 가공업체 품질 관리 및 연구직 기능성 축산식품 개발 및 연구원 (HACCP 전문가) 3. 연구 및 학술 분야 국립축산과학원, 농촌진흥청, 환경부 연구소 대학 및 국공립 연구기관 연구원 4. 공공기관 및 행정 분야 축산 관련 공무원 및 공기업 (농림축산식품부, 한국농어촌공사, 한국축산환경관리원) 국제축산 및 동물복지 NGO 활동 (FAO, WHO, OIE) 5. 스마트 축산 및 농업 기술 분야 스마트 팜 및 IoT 기반 축산업 기술 개발 기업 축산 자동화 및 AI 기반 가축 관리 시스템 개발 동물자원과학과는 지속 가능한 축산업 발전과 동물복지 향상, 고품질 축산식품 생산을 목표로 하는 전문 인력을 양성하는 것을 목표로 합니다. 본 학과는 첨단 동물과학 및 축산식품 가공 기술을 융합한 연구 및 교육을 통해 글로벌 축산업을 선도할 인재를 양성하며, 학생들이 다양한 축산 및 식품 관련 산업에서 활약할 수 있도록 실용적이고 전문적인 교육을 제공합니다."
    },
    {
        "department_id": 38,
        "학과": "목재응용과학과",
        "학과설명": "목재응용과학과는 목재를 비롯한 다양한 임산자원을 물리적·화학적으로 가공하여 건축재료, 가구, 악기, 펄프·종이 등 인간 생활에 유용한 제품을 생산·제조하는 학문을 연구합니다.  화석자원의 고갈과 환경 문제에 대응하기 위해 친환경 목재 가공 기술 및 자원 절약형 기술을 개발하며, 신소재 개발과 지속 가능한 목재 산업의 발전을 목표로 합니다. 이를 통해 친환경적인 목재 응용 기술과 고부가가치 제품 개발을 선도할 전문 인재를 양성합니다.  교육과정 목재응용과학과의 교육과정은 목재의 물리·화학적 특성 연구, 친환경 가공 기술, 산업 응용 및 설계 등을 포함하여 구성됩니다.  1. 목재 및 임산자원 기초 과목 목재학개론 (Introduction to Wood Science) 목재물리학 (Wood Physics) 목재화학 (Wood Chemistry) 목재미생물학 (Wood Microbiology) 임산자원학 (Forest Biomaterials Science) 2. 목재 가공 및 응용 기술 목재가공학 (Wood Processing Technology) 목재접착 및 코팅기술 (Wood Adhesives & Coatings) 합판 및 집성재 기술 (Plywood & Laminated Wood Technology) 목질재료학 (Wood-Based Materials Science) 목재보존학 (Wood Preservation & Protection) 3. 목재 공학 및 설계 과정 목조건축 및 구조공학 (Timber Construction & Structural Engineering) 목재제품설계 및 제조공정 (Wood Product Design & Manufacturing Process) 펄프 및 종이공학 (Pulp & Paper Engineering) 목재기계 및 자동화 (Woodworking Machinery & Automation) 4. 친환경 목재 및 바이오소재 연구 친환경 목재가공기술 (Eco-friendly Wood Processing Technology) 바이오매스 및 신재생에너지 (Biomass & Renewable Energy) 탄소저감형 목재소재 연구 (Carbon-Reducing Wood Materials) 목재폐기물 재활용 (Recycling of Wood Waste) 5. 연구 및 실습 과정 목재재료 실험 및 분석 (Wood Material Testing & Analysis Lab) 목재가공 실습 (Wood Processing & Manufacturing Lab) 목조 구조물 설계 실습 (Timber Structure Design Workshop) 산업 현장실습 및 캡스톤 디자인 (Industry Internship & Capstone Design) 연구 분야 목재응용과학과는 목재 및 임산자원의 과학적 연구를 기반으로 친환경 신소재 및 지속가능한 산업 기술을 개발하며, 주요 연구 분야는 다음과 같습니다.  목재 재료 및 구조 연구  목재의 기계적·물리적 특성 연구 내구성이 높은 목재 건축재료 개발 고기능성 합판 및 복합재료 연구 친환경 목재 가공 및 보존 연구  탄소중립 및 친환경 목재 가공 기술 연구 내수·내구성이 강화된 목재 보존 기술 개발 화학적·생물학적 처리 방법을 통한 목재 수명 연장 연구 바이오매스 및 신재생에너지 연구  목질계 바이오매스를 이용한 친환경 연료 개발 목재폐기물 재활용 및 지속 가능한 자원 순환 연구 펄프 및 종이 생산 공정의 효율성 향상 연구 목조 건축 및 구조공학 연구  친환경 목조 건축 및 모듈러 하우스 개발 CLT(교차 적층 목재) 및 집성재를 활용한 대형 목조건축 연구 목조 구조물의 내진성 및 안전성 평가 연구 자동화 및 스마트 제조 연구  목재가공 자동화 및 스마트 공정 연구 AI 및 로봇 기술을 활용한 목재 가공 시스템 개발 디지털 설계 및 CNC 가공 기술 연구 졸업 후 진로 목재응용과학과 졸업생들은 건축, 가구 디자인, 바이오소재 개발, 친환경 에너지, 목재 가공 및 제조 등 다양한 분야에서 전문가로 활동할 수 있습니다.  목재 및 건축재료 산업  목재 가공 및 제조 기업 (한솔홈데코, 동화기업, 성창기업 등) 목조건축 설계 및 시공 회사 건축 내·외장재 및 친환경 건축소재 개발 기업 가구 및 인테리어 디자인 분야  가구 설계 및 제작 기업 (한샘, 리바트, 에몬스 등) 인테리어 및 공간 디자인 회사 맞춤형 가구 및 친환경 인테리어 소재 개발 바이오소재 및 친환경 산업  바이오매스 및 신재생에너지 기업 친환경 접착제 및 목재 보존제 개발 연구소 펄프 및 종이산업 (한솔제지, 무림P&P, 한국제지 등) 연구소 및 공공기관  국립산림과학원, 산림청, 환경부 산하 연구소 목재 관련 국가 연구기관 및 산업 연구소 목재 품질관리 및 표준화 연구소 자동화 및 스마트 제조 분야  목재 가공 자동화 및 AI 기반 스마트 공정 기업 CNC 및 디지털 가공 기술 개발 회사 학과의 비전 목재응용과학과는 친환경 목재 기술 및 지속 가능한 자원 활용을 통해 미래 사회의 목재 산업을 혁신하는 것을 목표로 합니다.  지속가능한 목재 및 바이오소재 연구 활성화 스마트 제조 및 자동화 기술을 활용한 고부가가치 목재 제품 개발 탄소중립 및 친환경 목재가공 기술 선도 목조 건축 및 인테리어 분야의 창의적 인재 양성 본 학과는 첨단 목재과학 및 응용기술을 융합한 연구 및 교육을 통해 글로벌 목재산업을 선도할 인재를 양성하며, 학생들이 다양한 산업 분야에서 활약할 수 있도록 실용적이고 전문적인 교육을 제공합니다."
    },
    {
        "department_id": 4,
        "학과": "무역학과",
        "학과설명": "무역학과는 국제 경제 및 글로벌 시장의 흐름을 이해하고, 국제 무역과 비즈니스 환경에서 실무 역량을 갖춘 무역 전문가를 양성하는 학과입니다. 국제무역 이론과 정책, 무역 실무 및 법규, 글로벌 마케팅과 재무, 디지털 무역 및 공급망 관리 등을 포괄적으로 학습하며, 수출입 절차, 무역 금융, 글로벌 기업 경영 및 통상 협정 등 실질적인 무역 활동에 필요한 전문 지식을 익힙니다.  현대 무역 환경에서는 자유무역협정(FTA), 글로벌 공급망(SCM), 디지털 무역, ESG(환경·사회·지배구조) 경영, 전자상거래 등의 개념이 필수적으로 요구되고 있습니다. 무역학과는 이러한 변화에 맞춰 국제 시장에서 경쟁력을 갖춘 무역 전문가를 양성하기 위해 이론과 실무를 접목한 교육과정을 운영하고 있습니다.  학과 비전 및 목표 무역학과는 이론과 실무를 겸비한 글로벌 무역 전문가를 양성하는 것을 목표로 하며, 다음과 같은 방향성을 갖고 교육을 운영합니다.  1. 실무 중심의 글로벌 무역 전문가 양성 국제 무역 실무, 수출입 절차, 무역 금융 및 통관 시스템 학습 글로벌 기업 및 공공기관과 연계한 인턴십 및 실전 프로젝트 운영 2. 디지털 무역 및 핀테크 기술 융합 연구 블록체인, AI, 빅데이터를 활용한 무역 자동화 및 혁신 연구 전자상거래(E-Commerce) 및 디지털 마케팅 전략 학습 3. 국제 통상 정책 및 무역 협정 연구 WTO, FTA, RCEP 등 국제 통상 협정 및 무역 정책 분석 무역 분쟁 및 글로벌 경제 협력 연구 4. 지속가능한 무역 및 ESG 경영 연구 친환경 무역 및 지속 가능한 경제 발전 연구 공정무역(Fair Trade) 및 윤리적 소비 연구 배우는 내용 무역학과의 교육과정은 국제무역 이론, 무역 실무, 법과 정책, 글로벌 경영 전략 등 다양한 영역을 포함하여 구성됩니다.  1. 국제무역 및 경제 이론 학습 국제무역이론 (International Trade Theory): 무역 원리와 경제 구조 분석 무역정책론 (Trade Policy): 보호무역, 자유무역, 관세 정책 연구 국제경제학 (International Economics): 환율, 무역 환경 및 경제 동향 분석 세계경제론 (Global Economy): 글로벌 경제 발전 전략 연구 2. 무역 실무 및 경영 전략 연구 무역상무론 (Trade Business Practice): 무역 절차, 통관 및 신용장(L/C) 실무 관세제도론 (Customs & Tariff Systems): 관세 행정 및 수출입 절차 이해 국제마케팅 (Global Marketing): 해외 시장 조사 및 글로벌 브랜드 전략 수립 국제재무론 (International Finance): 환율 리스크 관리 및 외환 거래 실무 3. 법과 규정의 실무 적용 능력 강화 국제통상관계법 (International Trade Law): 국제 무역 계약 및 분쟁 해결 연구 무역영어 (Trade English): 무역 관련 계약 및 비즈니스 협상 실습 국제무역규범 (International Trade Regulations): WTO 및 국제 규범 이해 FTA 및 국제통상정책 (FTA & Global Trade Policy): 자유무역협정(FTA) 분석 4. 글로벌 비즈니스 환경 대응 역량 개발 국제기업론 (Multinational Corporation Management): 글로벌 기업 운영 전략 무역데이터 분석 (Trade Data Analytics): 빅데이터 기반 무역시장 분석 무역물류관리 (Trade Logistics Management): 국제 운송, 공급망 관리(SCM) 학습 전자무역과 e-비즈니스 (E-Trade & E-Business): 디지털 무역 및 전자상거래 활용 5. 연구 및 실습 과정 무역 실무 실습 (Trade Business Internship): 무역 관련 기업 인턴십 캡스톤디자인 프로젝트 (Capstone Project in Trade & Business): 글로벌 무역 시뮬레이션 실습 국제비즈니스 협상 실습 (International Business Negotiation Practice) 연구 분야 무역학과는 국제 경제, 무역 정책, 글로벌 시장 분석, 디지털 무역 및 통상 협정 등 다양한 학문적 연구를 수행합니다.  1. 국제무역 이론 및 정책 연구 자유무역과 보호무역 정책 비교 연구 WTO 및 FTA가 국제 무역에 미치는 영향 분석 글로벌 무역 흐름과 신흥 시장 조사 2. 무역 실무 및 공급망 관리 연구 글로벌 공급망(SCM) 최적화 및 무역 자동화 연구 AI 및 데이터 기반 무역 분석 및 예측 연구 국제 통관 및 무역 금융 실무 연구 3. 디지털 무역 및 전자상거래 연구 블록체인 및 핀테크 기반 무역 금융 연구 전자상거래(E-Commerce) 플랫폼 및 디지털 마케팅 연구 AI 및 빅데이터를 활용한 무역 전략 개발 4. 무역법 및 국제 통상 협상 연구 국제 무역 분쟁 및 규범 연구 (WTO, NAFTA, RCEP 등) 국가 간 무역 협정 및 경제 협력 모델 연구 무역 규제 및 비관세 장벽(NTB) 분석 5. ESG 및 지속가능한 무역 연구 친환경 무역 및 지속가능한 경제 발전 연구 ESG(환경·사회·지배구조) 경영과 글로벌 무역의 관계 분석 윤리적 소비 및 공정무역(Fair Trade) 연구 졸업 후 진로 무역학과 졸업생들은 국제무역, 무역 금융, 전자무역, 공급망 관리, 글로벌 마케팅 및 공공기관 등 다양한 분야에서 전문가로 활동할 수 있습니다.  1. 국제 무역 전문가 수출입 기업 (삼성전자, LG화학, 현대글로비스 등) 국제 무역 컨설팅 및 시장 분석 전문가 해외 영업 및 글로벌 무역 실무 담당자 2. 관세 및 법률 전문가 관세사 및 통관 전문가 (세관, 관세청, 무역법무팀) 국제 무역 규범 및 법률 컨설턴트 3. 국제 마케팅 및 금융 전문가 무역 금융 및 외환거래 전문가 (한국은행, 외국계 은행 등) 해외 브랜드 마케팅 및 글로벌 시장 분석 담당자 4. 공공기관 및 국제 기구 한국무역협회, 대한무역투자진흥공사(KOTRA) 세계무역기구(WTO), 국제통화기금(IMF), UNCTAD 5. 전자무역 및 핀테크 관련 산업 글로벌 전자상거래 기업 (Amazon, Alibaba, Coupang 등) 블록체인 및 핀테크 기반 무역 금융 스타트업 무역학과는 세계 무역 시장에서 활약할 글로벌 인재를 양성하며, 학생들이 국제 비즈니스 및 경제 분야에서 전문가로 성장할 수 있도록 실용적이고 전문적인 교육을 제공합니다."
    },
    {
        "department_id": 90,
        "학과": "문헌정보학과",
        "학과설명": "문헌정보학과는 정보화 시대에 필수적인 정보 전문가를 양성하기 위해, 도서관 및 정보센터 등 다양한 환경에서 정보를 수집, 정리, 축적, 배포하는 과정을 과학적으로 연구하고 이를 실무에 적용하는 능력을 배양하는 학문입니다.  오늘날 정보의 양이 폭발적으로 증가함에 따라 정보의 효율적 관리, 검색, 활용이 중요해지고 있으며, 이를 위한 디지털 정보 기술, 데이터베이스 관리, 메타데이터 분석, 인공지능(AI) 기반 정보 검색 기술 등의 최신 정보과학 기술이 요구됩니다.  본 학과는 전통적인 문헌 정보 조직 및 서비스뿐만 아니라, 디지털 도서관, 정보 분석, 빅데이터 관리 및 정보 윤리 등 다양한 분야를 연구하며, 정보 자원의 효율적인 운영과 활용을 통해 정보 가치 극대화에 기여할 수 있는 전문 인재를 양성하는 것을 목표로 합니다.  교육과정 문헌정보학과의 교육과정은 정보의 수집, 정리, 분석, 배포, 활용을 과학적으로 연구하고 실무에 적용하는 내용을 중심으로 구성되어 있습니다.  1. 기초 문헌정보학 및 정보 관리 과정 문헌정보학입문 (Introduction to Library & Information Science): 문헌정보학의 개념과 역할 이해 정보자료조직론 (Organization of Information Resources): 분류 및 색인 체계 연구 정보서비스론 (Information Services): 이용자 맞춤형 정보 제공 기술 연구 정보검색 (Information Retrieval): 검색 엔진과 검색 기법 학습 2. 디지털 정보 관리 및 데이터 분석 과정 디지털도서관론 (Digital Libraries): 전자 도서관 및 디지털 정보 관리 연구 데이터베이스론 (Database Management): 데이터베이스 구축 및 검색 시스템 설계 정보시스템 및 네트워크 (Information Systems & Networks): 정보 관리 시스템 및 네트워크 이론 데이터 사이언스와 문헌정보 (Data Science for Information Science): 빅데이터 및 데이터 분석 기법 연구 3. 정보기술 및 정보활용 과정 정보학개론 (Introduction to Informatics): 정보기술과 정보관리 연구 정보기술과 인공지능 (Information Technology & AI): AI를 활용한 정보 분석 및 자동 분류 기술 정보 시각화 (Information Visualization): 데이터 시각화 및 그래픽 분석 메타데이터론 (Metadata & Information Architecture): 디지털 콘텐츠 구조 및 메타데이터 설계 4. 정보정책 및 윤리 과정 정보윤리와 프라이버시 보호 (Information Ethics & Privacy Protection): 정보사회에서의 윤리적 문제 연구 지적재산권 및 저작권법 (Intellectual Property & Copyright Law): 정보 자원의 법적 보호 및 활용 방안 연구 정보정책 및 법제론 (Information Policy & Law): 국가 및 기관의 정보정책 연구 5. 연구 및 실습 과정 정보기관 운영 및 관리 (Library & Information Center Management): 도서관 및 정보센터 운영 기법 캡스톤 디자인 프로젝트 (Capstone Project in Library & Information Science): 실무 적용형 연구 프로젝트 수행 정보검색 실습 (Information Retrieval Lab): 검색 시스템 실습 및 정보 분석 프로젝트 진행 연구 분야 문헌정보학과는 전통적인 도서관학뿐만 아니라 디지털 정보 환경에서의 정보 관리 및 활용 기술을 연구하며, 주요 연구 분야는 다음과 같습니다.  디지털 도서관 및 정보 검색 연구  디지털 도서관 시스템 및 정보 검색 기술 개발 검색 엔진 최적화(SEO) 및 자연어 처리(NLP) 기술 연구 이용자 행태 분석을 통한 검색 알고리즘 개선 데이터베이스 및 빅데이터 분석 연구  데이터베이스 구축 및 효율적인 정보 저장 관리 연구 빅데이터를 활용한 정보 분석 및 트렌드 예측 AI 기반 정보 추천 시스템 개발 정보정책 및 정보 윤리 연구  정보 접근권 및 프라이버시 보호 연구 저작권 및 정보 보안 정책 연구 공공 데이터 및 오픈 액세스(Open Access) 연구 정보서비스 및 사용자 경험(UX) 연구  인공지능 및 챗봇을 활용한 정보 제공 시스템 연구 사용자의 정보 이용 행동 분석 및 인터페이스 설계 연구 지능형 검색 시스템 및 맞춤형 정보 추천 기술 개발 메타데이터 및 콘텐츠 관리 연구  디지털 콘텐츠 구조 설계 및 메타데이터 표준 연구 디지털 아카이브 및 장기 보존 기술 연구 멀티미디어 정보의 분류 및 관리 기술 연구 졸업 후 진로 문헌정보학과 졸업생들은 전통적인 도서관 및 정보센터뿐만 아니라, 빅데이터 분석, AI 기반 정보 검색, 데이터베이스 관리, 정보 보안 및 정책 연구 등 다양한 분야에서 전문가로 활동할 수 있습니다.  도서관 및 정보기관 전문가  국립 및 공공 도서관 사서 (국립중앙도서관, 국회도서관, 대학 도서관) 기업 및 연구소 정보센터 운영자 디지털 아카이브 및 기록 관리 전문가 빅데이터 및 정보 분석 전문가  빅데이터 분석 및 데이터 사이언티스트 정보 검색 및 추천 알고리즘 개발자 AI 기반 데이터 관리 및 정보 검색 시스템 엔지니어 정보정책 및 보안 전문가  정부 및 공공기관 정보정책 연구원 지적재산권 및 정보윤리 컨설턴트 사이버 보안 및 개인정보 보호 전문가 IT 및 콘텐츠 관리 전문가  웹 콘텐츠 관리자 및 데이터베이스 엔지니어 디지털 콘텐츠 큐레이터 및 메타데이터 설계자 정보기술 및 검색 엔진 최적화(SEO) 전문가 학계 및 연구소 연구원  문헌정보학 및 정보과학 연구기관 연구원 대학 및 연구소에서 정보관리 및 데이터 과학 연구 정보기술 및 인공지능을 활용한 정보분석 연구 학과의 비전 문헌정보학과는 디지털 정보 시대를 선도할 정보 전문가를 양성하는 것을 목표로 합니다.  정보 검색, 데이터 분석, AI 및 디지털 기술을 활용한 정보관리 연구 강화 디지털 도서관 및 정보 네트워크 시스템 최적화 지적재산권, 정보윤리 및 프라이버시 보호를 위한 정책 연구 빅데이터 및 인공지능 기반의 스마트 정보 서비스 개발 본 학과는 전통적인 문헌정보학에서 디지털 정보과학까지 융합하는 교육과 연구를 통해 정보 시대를 선도할 창의적이고 실무 중심의 전문가를 양성하며, 학생들이 다양한 정보 환경에서 혁신적인 솔루션을 제시할 수 있는 글로벌 인재로 성장할 수 있도록 지원합니다."
    },
    {
        "department_id": 92,
        "학과": "물리학과",
        "학과설명": "물리학과는 자연 환경과 우주 등 다양한 물리적 현상을 이해하고 해석하는 능력을 배양하며, 공학, 농학, 의학 등 여러 과학기술 분야의 기초가 되는 물리학적 개념과 원리를 실험과 실습을 통해 실질적으로 학습할 수 있도록 합니다.  물리학은 자연과학의 근본 원리를 탐구하는 학문으로, 역학, 전자기학, 양자역학, 열역학 등의 기본 개념을 바탕으로 현대 과학과 기술 발전에 기여하는 학문입니다. 본 학과에서는 기초 물리학부터 응용 물리학까지 폭넓은 교육을 제공하여, 학생들이 다양한 산업 및 연구 분야에서 창의적인 문제 해결 능력을 갖춘 인재로 성장할 수 있도록 합니다.  학과 비전 물리학과는 기초 및 응용 물리 연구를 통해 자연과 우주의 근본 원리를 탐구하고, 신기술 개발을 위한 학문적 토대를 제공하는 것을 목표로 합니다.  1. 창의적 문제 해결 능력 배양 기초 물리학 및 응용 물리 연구 강화 다양한 실험과 연구 프로젝트를 통한 문제 해결 역량 개발 2. 첨단 과학 및 신기술 연구 활성화 양자 정보 과학, 반도체 기술, AI 물리학 등 최첨단 분야 연구 산업 및 연구소와 협력하여 실무 중심 연구 기회 제공 3. 융합형 인재 양성 4차 산업혁명 시대에 필요한 데이터 분석, 컴퓨팅 물리 등 융합 학문 연구 공학 및 정보과학과 연계한 실용적 물리학 교육 제공 교육과정 물리학과의 교육과정은 기초 물리학, 수리물리학, 현대 물리학, 응용 물리학 등의 단계별 학습을 통해 물리학적 사고력을 배양하는 체계적인 과정으로 구성되어 있습니다.  1. 기초 물리학 및 수학 과정 일반물리학 I, II (General Physics I, II): 물리학의 기본 개념 학습 수리물리학 (Mathematical Physics): 미적분, 벡터 해석, 미분방정식 등을 활용한 물리학 문제 해결 역학 (Classical Mechanics): 뉴턴 역학, 라그랑주 및 해밀토니안 역학 연구 전자기학 (Electromagnetism I, II): 전기장, 자기장, 맥스웰 방정식 연구 2. 현대 물리학 및 이론 물리 과정 양자역학 I, II (Quantum Mechanics I, II): 양자역학적 원리 및 파동 함수 해석 통계물리학 (Statistical Mechanics): 열 및 통계 역학 개념 연구 상대성이론 (Theory of Relativity): 특수 상대성이론 및 일반 상대성이론 연구 고급 전자기학 (Advanced Electromagnetism): 전자기파 및 전자기장 응용 연구 3. 응용 물리학 및 실험 과정 광학 (Optics): 빛의 성질 및 광학 기기 원리 연구 고체물리학 (Solid State Physics): 결정 구조, 전자 밴드 구조 및 초전도체 연구 반도체물리학 (Semiconductor Physics): 반도체 소자의 원리 및 응용 연구 입자물리학 (Particle Physics): 기본 입자 및 표준 모형 연구 플라스마물리학 (Plasma Physics): 고온 플라스마 및 응용 연구 4. 실험 및 연구 과정 물리학 실험 I, II (Physics Laboratory I, II): 기초 실험을 통해 물리 개념 적용 현대물리 실험 (Modern Physics Laboratory): 양자역학 및 나노물리학 실험 고급 실험물리학 (Advanced Experimental Physics): 연구 중심 실험 수행 캡스톤 프로젝트 (Capstone Research in Physics): 물리학 응용 프로젝트 및 논문 작성 연구 분야 물리학과는 기초 및 응용 물리 연구를 통해 자연과 우주의 근본 원리를 탐구하며, 신기술 개발에 기여하는 다양한 연구를 수행합니다.  1. 이론 물리 및 수리물리 연구 양자역학 및 상대성이론 연구 블랙홀 및 우주론 연구 혼돈 이론 및 비선형 동역학 연구 2. 고체 및 나노물리 연구 나노소재 및 나노전자학 연구 반도체 물리 및 차세대 소자 개발 초전도체 및 양자 정보 과학 연구 3. 입자 및 핵물리 연구 기본 입자 및 강한 상호작용 연구 원자핵 물리 및 방사선 과학 연구 고에너지 물리 및 우주 입자 탐색 4. 응용 물리 및 신기술 연구 레이저 및 광학 물리 연구 플라스마 물리 및 핵융합 연구 양자 컴퓨팅 및 양자 정보 연구 5. 우주 및 천체 물리 연구 암흑 물질 및 암흑 에너지 연구 중력파 및 블랙홀 연구 우주론 및 은하 구조 연구 졸업 후 진로 물리학과 졸업생들은 기초 연구, 응용 기술, 산업 기술, 데이터 과학 및 공학 분야 등 다양한 분야에서 활동할 수 있습니다.  1. 연구 및 학술 분야 물리학 및 응용물리 연구소 연구원 국내외 대학원 진학 후 연구 활동 국립연구소(기초과학연구원, 한국천문연구원, KIST 등) 2. 첨단 산업 및 기술 분야 반도체 및 전자 산업 (삼성전자, SK하이닉스, LG전자 등) 레이저 및 광학 기술 개발 기업 나노기술 및 신소재 연구소 3. IT 및 데이터 과학 분야 양자 컴퓨팅 및 AI 연구 빅데이터 분석 및 금융 물리학 소프트웨어 및 알고리즘 개발 4. 공공기관 및 정부 연구기관 한국항공우주연구원(KARI) 및 기초과학연구원(IBS) 국방과학연구소(ADD) 및 원자력 연구소(KAERI) 기상청 및 기후변화 연구소 5. 교육 및 과학 커뮤니케이션 중·고등학교 과학 교사 (교원자격증 취득 후) 과학 기자 및 과학 콘텐츠 개발 전문가 과학관 및 천문대 연구원 학과의 역할과 목표 물리학과는 자연과 우주의 근본 원리를 탐구하고, 과학과 기술 발전에 기여할 인재를 양성하는 것을 목표로 합니다.  기초 물리학 및 응용 물리 연구 강화 양자 정보 과학, 반도체 기술, AI 물리학 등 신기술 연구 활성화 산업 및 연구소와 협력하여 실무 중심의 연구 및 실험 기회 제공 4차 산업혁명 시대에 필요한 데이터 분석, 컴퓨팅 물리 등 융합형 인재 양성 물리학과는 기초과학 연구의 핵심 학문으로서, 물리학적 사고력과 문제 해결 능력을 갖춘 글로벌 인재를 배출하며, 학생들이 과학기술의 발전을 선도할 수 있도록 실용적이고 혁신적인 교육을 제공합니다."
    },
    {
        "department_id": 62,
        "학과": "미디어커뮤니케이션학과",
        "학과설명": "미디어커뮤니케이션학과는 미래 사회가 요구하는 전문 언론인과 미디어 전문가를 양성하기 위해 학술적 이론과 실무를 병행한 교육을 제공합니다. 본 학과는 디지털 미디어, 소셜 미디어, 메타버스, AI 기반 미디어 분석, 실감형 콘텐츠 제작 등 급변하는 미디어 환경에 대응하여 창의적이고 비판적인 사고를 갖춘 미디어 인재를 양성하는 것을 목표로 합니다.  현대 사회에서 미디어는 단순한 정보 전달 도구를 넘어 사회적 영향력을 행사하는 중요한 요소로 자리 잡고 있습니다. 이에 따라 본 학과는 미디어의 사회적 역할과 영향력을 이해하고, 뉴미디어 환경에서 효과적인 콘텐츠 제작 및 전략적 커뮤니케이션 역량을 배양하는 데 초점을 맞추고 있습니다.  교육과정 미디어커뮤니케이션학과의 교육과정은 미디어 이론, 커뮤니케이션 연구, 콘텐츠 제작, 미디어 경영 및 정책, 디지털 미디어 기술 적용 등 다양한 영역을 포함하여 구성되어 있습니다.  1. 미디어 및 커뮤니케이션 이론 과정 미디어커뮤니케이션이론 (Media Communication Theories): 미디어와 사회의 상호작용 이해 미디어와 대중문화 (Media and Popular Culture): 미디어 콘텐츠가 대중문화에 미치는 영향 연구 한국언론사 (History of Korean Journalism): 한국 언론의 발전 과정 및 역할 분석 매체비평론 (Media Criticism): 미디어 콘텐츠 분석 및 비평 기법 연구 방송통신매체론 (Broadcast & Telecommunications Media): 방송 및 통신 매체의 구조와 정책 연구 2. 미디어 연구 및 데이터 분석 과정 미디어커뮤니케이션조사방법론 (Research Methods in Media Communication): 정량 및 정성 연구 방법론 학습 디지털스토리텔링과 데이터 시각화 (Digital Storytelling & Data Visualization): 데이터 기반 콘텐츠 제작 기법 미디어 분석 및 알고리즘 연구 (Media Analytics & Algorithms): AI 및 빅데이터 기반 미디어 분석 3. 미디어 제작 및 실무 과정 방송미디어제작기획 (Broadcast Media Production Planning): 방송 콘텐츠 제작 과정 이해 및 실습 VR/AR 및 실감형 콘텐츠 제작기획 (VR/AR & Immersive Media Production): 가상현실(VR), 증강현실(AR) 콘텐츠 제작 기법 연구 1인 미디어 콘텐츠 제작기획 (Personal Media Content Production): 유튜브, 팟캐스트, SNS 콘텐츠 기획 및 운영 디지털 광고 및 브랜디드 콘텐츠 (Digital Advertising & Branded Content): 브랜드 마케팅을 위한 콘텐츠 제작 및 운영 4. 미디어 경영 및 정책 과정 미디어경제경영론 (Media Economics & Management): 미디어 산업의 경제적 구조 및 경영 전략 연구 미디어 창업론 (Media Entrepreneurship): 미디어 스타트업 및 콘텐츠 기반 창업 전략 정치커뮤니케이션 (Political Communication): 미디어가 정치 과정에 미치는 영향 분석 PR과 전략 커뮤니케이션 (Public Relations & Strategic Communication): 공공 및 기업 커뮤니케이션 전략 연구 5. 디지털 전환 및 미래 미디어 과정 메타버스와 실감 미디어 (Metaverse & Immersive Media): 메타버스 기술과 콘텐츠 제작 연구 지능정보사회와 미디어 (Intelligent Information Society & Media): AI 및 데이터 기반 커뮤니케이션 기술 연구 디지털 뉴스 및 정보윤리 (Digital News & Information Ethics): 디지털 미디어 환경에서의 저널리즘 윤리 및 정보 신뢰성 연구 6. 연구 및 실습 과정 미디어 프로젝트 실습 (Media Project Lab): 팀 프로젝트를 통한 실무형 미디어 콘텐츠 제작 미디어 인턴십 및 현장 실습 (Media Internship & Fieldwork): 미디어 기업 및 기관에서의 실습 기회 제공 캡스톤 디자인 프로젝트 (Capstone Project in Media Studies): 학생들의 종합적인 미디어 기획 및 제작 프로젝트 연구 분야 미디어커뮤니케이션학과는 전통적인 저널리즘 및 커뮤니케이션 연구뿐만 아니라, 디지털 미디어 환경에서의 콘텐츠 생산, AI 기반 데이터 분석, 미디어 정책 연구 등 폭넓은 연구를 수행합니다.  디지털 미디어 및 뉴미디어 연구  소셜 미디어 및 디지털 저널리즘 연구 유튜브, 틱톡 등 1인 미디어 플랫폼 연구 디지털 트랜스포메이션과 미디어 산업 변화 연구 미디어 데이터 분석 및 인공지능(AI) 연구  미디어 알고리즘 및 추천 시스템 연구 AI 및 빅데이터 기반 콘텐츠 분석 정보 신뢰성과 가짜뉴스 탐지 연구 미디어 정책 및 법제 연구  언론 자유 및 미디어 규제 정책 연구 디지털 미디어 윤리 및 개인정보 보호 연구 미디어 플랫폼과 정부 정책 연구 미디어 경제 및 산업 연구  방송 및 OTT(넷플릭스, 디즈니+) 산업 분석 광고 및 PR 전략과 소비자 반응 연구 미디어 스타트업 및 창업 연구 실감형 콘텐츠 및 XR(Extended Reality) 연구  가상현실(VR) 및 증강현실(AR) 콘텐츠 연구 메타버스 플랫폼 및 실감형 미디어 연구 인터랙티브 콘텐츠 및 사용자 경험(UX) 연구 졸업 후 진로 미디어커뮤니케이션학과 졸업생들은 저널리즘, 방송, 광고, 홍보, 디지털 콘텐츠 제작, 미디어 정책 및 연구 등 다양한 분야에서 전문가로 활동할 수 있습니다.  저널리즘 및 방송 분야  신문사, 방송사 기자 (KBS, MBC, SBS, JTBC, 중앙일보, 조선일보 등) 방송국 프로듀서(PD), 아나운서, 뉴스 기획자 디지털 뉴스 플랫폼 및 데이터 저널리즘 전문가 디지털 콘텐츠 및 뉴미디어 분야  유튜브, 틱톡, SNS 콘텐츠 크리에이터 1인 미디어 및 팟캐스트 제작자 VR/AR 콘텐츠 및 인터랙티브 미디어 개발자 광고 및 홍보(PR) 분야  광고 기획 및 브랜드 마케팅 전문가 기업 및 공공기관 홍보(PR) 전문가 디지털 광고 및 인플루언서 마케팅 기획자 미디어 정책 및 연구 분야  정부 및 공공기관 미디어 정책 담당자 미디어 연구소 및 컨설팅 기업 연구원 미디어 법률 및 규제 전문가 미디어 창업 및 경영 분야  미디어 스타트업 창업 및 경영 OTT(넷플릭스, 유튜브 등) 콘텐츠 기획 및 유통 전문가 메타버스 및 실감형 콘텐츠 비즈니스 기획자 학과의 비전 미디어커뮤니케이션학과는 디지털 시대에 적합한 미디어 전문가를 양성하며, 다음과 같은 목표를 가지고 있습니다.  미디어 이론과 실무를 병행한 교육을 통해 창의적인 미디어 인재 양성 디지털 트렌드 및 최신 기술을 반영한 실습 중심 교육 제공 사회적 책임을 갖춘 저널리스트 및 미디어 기획자 양성 산업과 연계된 실무 경험을 통해 경쟁력 있는 전문가 배출 본 학과는 미디어 산업의 빠른 변화에 대응할 수 있도록 실용적이고 혁신적인 교육을 제공하며, 학생들이 다양한 미디어 분야에서 창의적이고 전문적인 역량을 갖춘 글로벌 인재로 성장할 수 있도록 지원합니다."
    },
    {
        "department_id": 13,
        "학과": "바이오메디컬공학부",
        "학과설명": "바이오메디컬공학부는 첨단 의료기기 기술과 정보공학을 융합하여 창의적 사고와 실무 능력을 갖춘 전문 인재를 양성하는 것을 목표로 합니다. 본 학부에서는 의료기기 개발, 생체신호 분석, 디지털 헬스케어 시스템 구축, 의료 인공지능(AI) 및 빅데이터 활용 등의 최첨단 기술을 학습하고 연구하며, 이를 실용적으로 적용할 수 있는 역량을 배양합니다.  본 학부는 헬스케어기기공학전공(Healthcare System Engineering) 과 헬스케어정보공학전공(Healthcare Information Engineering) 두 개의 전공으로 구성되어 있으며, 각 전공은 의료 및 헬스케어 산업에서 핵심 역할을 수행할 수 있는 전문성을 기르는 데 중점을 둡니다.  교육과정  1학년  공필: 전공진로설계 1 (0.5-0-1)  전필: 인체해부생리학 (Human Anatomy and Physiology) (3-3-0), 의료기기회로설계및실습 1 (Medical Device Electronic Circuit Design and Lab. 1) (3-2-2)  전선: 의공학개론 (Introduction to Biomedical Engineering) (3-3-0), 바이오메디컬AI의수학적기초 (Mathematical Foundation for Biomedical AI) (3-3-0), 의용기계공학 (Medical Engineering for Biomedical Equipment) (3-3-0), 데이터기반헬스케어기술 1 (Data-Driven Healthcare Technology 1) (3-2-2)  2학년  공필: 전공진로설계 2 (0.5-0-1)  전필: 생체역학 (Biomechanics) (3-3-0)  전선: 의료기기회로설계및실습 2 (Medical Device Electronic Circuit Design and Lab. 2) (3-2-2), 임상의학개론 (Introduction to Medical Terminology) (3-3-0), 확률통계학 (Probability and Statistics) (3-3-0), 생체물성학 (Biological Properties) (3-3-0), 데이터기반헬스케어기술 2 (Data-Driven Healthcare Technology 2) (3-2-2)  3학년  공필: 전공진로설계 3 (0.5-0-1)  전필: 의료기기앱설계및실습 1 (Medical Device App. Design and Lab. 1) (3-2-2)  전선: 데이터베이스및실습 (Database and Practice) (3-2-2), 의료기기학 1 (Biomedical Equipment 1) (3-3-0), 생체계측및실험 1 (Biomedical Measurement and Lab. 1) (3-3-0), 의료기기제어장치설계및실습 1 (Medical Device Controller Design and Lab. 1) (3-2-2), 운동역학활용및실습 (Exercise Mechanics Application and Lab.) (3-2-2)  4학년  공필: 전공진로설계 4 (0.5-0-1)  전필: 생체계측및실험 2 (Biomedical Measurement and Lab. 2) (3-3-0)  전선: 의료기기앱설계및실습 2 (Medical Device App. Design and Lab. 2) (3-2-2), 의료기기학 2 (Biomedical Equipment 2) (3-3-0), 헬스케어로봇활용및실습 (Healthcare Robot Application and Lab.) (3-2-2), 3D 설계기법및실습 (Computer Aided Mechanical Design and Lab.) (3-2-2), 나노바이오공학 (Nano-Bio Engineering) (3-3-0), 뇌신경공학 (Neuroengineering) (3-3-0)  졸업 프로젝트  공필: 전공진로설계 5 (0.5-0-1), 바이오메디컬종합설계 1 (Biomedical Engineering Capstone Design 1) (3-0-6)  전선: 생체신호처리및분석 (Biological Signal Processing and Analysis) (3-3-0), 의료기기규제과학(RA) (Medical Device Regulatory Affairs(RA)) (3-3-0), 재활공학및실습 (Rehabilitation Engineering and Lab.) (3-2-2), 3D 구조해석및실습 (Structural Mechanics and Practice) (3-2-2), 고령친화시스템공학 (Gerontological Healthcare Engineering) (3-3-0)  공필: 전공진로설계 6 (0.5-0-1)  전선: 바이오메디컬종합설계 2 (Biomedical Engineering Capstone Design 2) (3-0-6), 생체공학세미나 (Bionics Seminar) (3-3-0), 헬스케어기기디자인 (Healthcare Equipment Design) (3-3-0), 감성공학 (Sensibility Engineering) (3-3-0)  연구 분야  바이오센서 및 의료기기 연구  바이오센서를 이용한 질병 진단 기술 개발  웨어러블 헬스케어 기기 및 생체신호 측정 시스템 연구  의료 AI 및 빅데이터 분석 연구  의료 데이터 기반 딥러닝 및 머신러닝 연구  정밀의료를 위한 AI 기반 진단 및 예측 모델 개발  스마트 헬스케어 및 원격의료 연구  스마트 헬스케어 플랫폼 및 개인 맞춤형 건강 관리 시스템 연구  원격의료 시스템 개발 및 클라우드 헬스케어 연구  의료영상 분석 및 신경공학 연구  MRI, CT, 초음파 등 의료영상 분석 및 자동화 기술 연구  신경공학 및 뇌-컴퓨터 인터페이스(BCI) 기술 연구  의료기기 인증 및 표준화 연구  국제 의료기기 규제 및 인증 연구  의료기기 및 의료 AI 윤리적 문제 연구  바이오메디컬공학부는 최신 의료기기 및 디지털 헬스케어 기술 연구, AI 기반 의료 데이터 분석 및 원격의료 기술 개발, 실무 중심 연구 강화를 통해 국제적 경쟁력을 갖춘 전문가를 양성합니다."
    },
    {
        "department_id": 93,
        "학과": "반도체과학기술학과",
        "학과설명": "반도체과학기술학과는 반도체 분야의 기본 개념과 원리, 실험 및 첨단 기술을 학습하며, 결정 성장과 소자 공학 등 다양한 응용 분야를 연구하는 학문입니다.  반도체는 스마트폰, 컴퓨터, 자동차, 인공지능(AI) 시스템 등 다양한 첨단 기술의 핵심 소재로, 현대 전자기술의 근간이 되는 분야입니다. 이에 따라 본 학과는 반도체 물리, 반도체 재료, 반도체 공정, 반도체 소자 및 회로 설계 등 핵심 기술을 종합적으로 학습할 수 있도록 교육과정을 구성하고 있습니다.  또한 반도체물성연구소 및 화합물반도체공정센터의 첨단 장비를 활용한 실험 및 연구를 통해 실무 역량을 강화할 수 있도록 지원합니다.  교육과정 반도체과학기술학과의 교육과정은 반도체 물리 및 재료, 공정 기술, 소자 및 회로 설계, 반도체 응용 시스템 등 다양한 분야를 아우르며, 산업 및 연구 환경에서 요구되는 실무 능력을 갖출 수 있도록 체계적으로 구성되어 있습니다.  1. 반도체 기초 및 전공 필수 과목 반도체공학개론 (Introduction to Semiconductor Engineering): 반도체의 기본 개념 및 전자 소자의 동작 원리 학습 반도체재료학개론 (Introduction to Semiconductor Materials): 실리콘(Si), 갈륨비소(GaAs), 질화갈륨(GaN) 등 반도체 재료의 특성과 응용 전자기학 (Electromagnetics): 반도체 및 전자소자의 동작 원리를 이해하기 위한 전자기 이론 학습 응용수학 (Applied Mathematics for Semiconductor Engineering): 미분방정식, 벡터해석, 푸리에 변환 등 반도체 기술에 필수적인 수학 개념 학습 2. 반도체 공정 및 소자 기술 반도체 공정 기술 (Semiconductor Process Technology): 포토리소그래피, 이온 주입, 증착, 식각 등 반도체 제조 공정 연구 반도체 소자 물리 (Physics of Semiconductor Devices): 트랜지스터, 다이오드, MOSFET 등 반도체 소자의 동작 원리 연구 반도체 나노공정 (Nano-fabrication for Semiconductors): 나노스케일 반도체 소자의 설계 및 공정 기술 학습 화합물 반도체 공정 (Compound Semiconductor Processing): 실리콘(Si) 외 다양한 반도체 소재를 활용한 소자 개발 및 응용 연구 3. 반도체 회로 및 응용 시스템 디지털공학 (Digital Electronics): 논리회로, 디지털 집적회로(IC) 설계 및 응용 회로이론 (Circuit Theory): 아날로그 및 디지털 회로의 해석 및 설계 원리 학습 반도체 메모리 공학 (Semiconductor Memory Engineering): DRAM, NAND Flash, 차세대 메모리 기술 연구 반도체 및 AI 시스템 (Semiconductor & AI Systems): 인공지능(AI) 및 머신러닝을 활용한 반도체 설계 및 응용 4. 실험 및 연구 과정 반도체 물성 실험 (Semiconductor Physics Lab): 반도체 물질의 전기적, 광학적 특성을 실험적으로 분석 반도체 공정 실험 (Semiconductor Process Lab): 실제 반도체 공정 장비를 활용한 실습 및 실험 반도체 설계 및 시뮬레이션 (Semiconductor Design & Simulation): 반도체 소자 및 공정을 컴퓨터 시뮬레이션을 통해 설계 및 분석 캡스톤 디자인 프로젝트 (Capstone Design in Semiconductor Engineering): 산업 및 연구 프로젝트를 기반으로 한 반도체 소자 및 공정 개발 연구 분야 반도체과학기술학과는 반도체 물리, 공정, 소자 및 회로 설계, 응용 시스템 등 다양한 분야에서 최첨단 기술을 연구하며, 주요 연구 분야는 다음과 같습니다.  반도체 소자 및 신소재 연구  차세대 반도체 소재 (GaN, SiC, 2D Materials) 연구 트랜지스터 및 신소재 기반 반도체 소자 개발 초저전력 및 고성능 반도체 소자 설계 반도체 공정 및 나노기술 연구  나노 반도체 공정 기술 (EUV 리소그래피, 원자층 증착) 연구 반도체 제조 공정의 미세화 및 고효율화 기술 연구 3D 반도체 공정 및 집적 기술 연구 반도체 메모리 및 AI 반도체 연구  DRAM, NAND Flash 및 차세대 메모리 기술 연구 뉴로모픽(Neuromorphic) 반도체 및 AI 반도체 개발 반도체 기반 엣지컴퓨팅 및 AI 가속기 설계 연구 반도체 회로 및 시스템 연구  고성능 집적회로(IC) 설계 및 최적화 연구 RF 및 고주파 반도체 소자 및 회로 연구 반도체 기반 센서 및 전력 반도체 연구 졸업 후 진로 반도체과학기술학과 졸업생들은 반도체 산업, 연구개발, 공정 및 설계, 데이터 및 인공지능 반도체 기술 등 다양한 분야에서 전문가로 활동할 수 있습니다.  반도체 산업 및 연구 개발 분야  반도체 설계 및 공정 엔지니어 (삼성전자, SK하이닉스, TSMC, Intel) 반도체 공정 개발 및 품질 관리 전문가 반도체 신소재 및 소자 연구원 차세대 반도체 및 AI 반도체 기술 개발  뉴로모픽 반도체 및 AI 반도체 연구원 차세대 메모리 및 초고속 반도체 소자 개발자 반도체 기반 자율주행 및 IoT 시스템 설계자 반도체 관련 공공기관 및 연구소  한국전자통신연구원(ETRI), 한국반도체연구소(KISERI) KAIST, POSTECH, 서울대 등 반도체 관련 대학원 진학 및 연구 산업통상자원부, 과학기술정보통신부 등 공공기관 연구직 반도체 스타트업 및 창업  반도체 신기술 개발 및 소재 혁신 스타트업 창업 AI 및 반도체 융합 기술 기반 스타트업 창업 반도체 장비 및 설비 개발 기업 진출 학과의 비전 반도체과학기술학과는 첨단 반도체 산업을 이끌어 갈 창의적이고 실무 능력을 갖춘 전문 인재를 양성하는 것을 목표로 합니다.  반도체 소자 및 공정 기술 연구를 통한 혁신적 반도체 기술 개발 AI, 빅데이터, 양자컴퓨팅과 접목한 미래 반도체 연구 강화 산업체 및 연구기관과 협력하여 실무 중심의 반도체 교육 제공 반도체 공정 및 설계 실습을 통한 글로벌 경쟁력 있는 인재 양성 본 학과는 반도체 산업의 발전을 이끄는 창의적인 엔지니어와 연구자를 배출하며, 글로벌 반도체 시장에서 경쟁력을 갖춘 전문가를 양성하는 데 최선을 다할 것입니다."
    },
    {
        "department_id": 81,
        "학과": "사학과",
        "학과설명": "사학과는 한국사, 동양사, 서양사로 구분되며, 각 분야의 권위 있는 교수진과 함께 특성화된 커리큘럼을 통해 역사를 깊이 있게 탐구하는 학문입니다. 본 학과에서는 역사적 사건과 흐름을 분석하여 과거와 현재를 연결하고, 이를 바탕으로 미래를 조망하는 역사적 안목과 비판적 사고력을 기르는 것을 목표로 합니다.  역사 연구는 단순한 과거의 기록이 아니라 정치, 경제, 사회, 문화 등 다양한 분야와 연계되며, 글로벌 시대에 필요한 분석력과 통찰력을 제공합니다. 이를 바탕으로, 본 학과에서는 한국사, 동양사, 서양사 전반을 아우르는 폭넓은 학문적 기반을 구축하고, 지역사 및 국제 관계, 문화사, 사회사, 사상사 등의 특화된 연구를 수행합니다.  사학과의 교육과정은 역사적 자료 분석, 역사 이론 및 연구 방법론, 지역 및 시대별 역사 탐구 등으로 구성되어 있으며, 역사 연구를 심층적으로 진행할 수 있도록 단계별 학습 과정을 제공합니다.  1. 한국사 분야 한국고대사 (Ancient Korean History): 삼국 시대부터 고려까지의 역사 탐구 조선시대사 (History of Joseon Dynasty): 조선 왕조의 정치·사회·문화 연구 근현대한국사 (Modern & Contemporary Korean History): 대한제국, 일제강점기, 해방 이후 한국의 정치·사회 변화 분석 한국경제사 (Economic History of Korea): 전통 경제 체제에서 현대 경제 성장 과정까지 연구 호남지역사 (History of Honam Region): 호남 지역의 역사와 문화적 특성 탐구 한일관계사 (History of Korea-Japan Relations): 한국과 일본의 역사적 관계 및 외교적 상호작용 연구 2. 동양사 분야 중국고대사 (Ancient Chinese History): 중국의 황제 시대와 초기 문명 연구 동아시아국제관계사 (History of East Asian International Relations): 중국, 일본, 한국의 외교 관계 및 국제 질서 연구 동남아시아사 (History of Southeast Asia): 베트남, 태국, 인도네시아 등 동남아시아 국가들의 역사와 문화 연구 중국사상사 (History of Chinese Thought): 유교, 불교, 도교 등의 철학과 사상 연구 동양문화사 (Cultural History of the East): 동아시아 지역의 전통문화 및 사회적 변화 연구 3. 서양사 분야 고대오리엔트사 (Ancient Near Eastern History): 메소포타미아, 이집트 문명 연구 고대서양사 (Ancient Western History): 그리스·로마 시대의 정치·사회·철학 연구 서양중세사 (Medieval Western History): 중세 유럽의 봉건제도와 종교적 변화 연구 서양근현대사 (Modern & Contemporary Western History): 르네상스, 산업혁명, 세계대전 및 냉전 시대 연구 서양문명사 (History of Western Civilization): 서양 문명의 발전 과정과 세계사적 의미 분석 서양여성사 (History of Women in the West): 여성의 사회적 역할과 역사적 변화 연구 글로벌히스토리 (Global History): 지역을 초월한 역사적 흐름과 세계사적 연계 분석 4. 역사 연구 방법 및 실습 과정 사료분석 및 역사연구법 (Historical Research Methods & Archival Studies): 사료 분석 및 역사적 연구 방법론 학습 역사문헌강독 (Reading Historical Documents): 원문 사료를 해석하고 비판적으로 분석하는 과정 구술사 연구 (Oral History Research): 구술 자료를 활용한 역사적 연구 방법 습득 디지털역사학 (Digital Humanities in History): 빅데이터 및 디지털 기술을 활용한 역사 연구 역사기록학 (Historiography & Record Management): 문헌, 기록물의 관리 및 보존 연구   사학과는 시대별, 지역별 역사 연구를 넘어, 역사적 흐름을 종합적으로 이해하고 분석하는 다양한 연구를 수행합니다. 주요 연구 분야는 다음과 같습니다.  1. 한국사 연구 조선시대 법제 및 행정 연구 한국 근현대 경제 및 산업 발전 연구 독립운동 및 식민지 시대 연구 한국의 대외 관계 및 외교사 연구 2. 동양사 연구 중국의 정치 체제 및 사회 구조 연구 동아시아 국제 관계 및 교류사 연구 일본사 및 메이지유신 연구 동남아시아의 경제 및 문화 교류 연구 3. 서양사 연구 서양 철학 및 사상사 연구 산업혁명과 근대 경제 시스템 연구 전쟁사 및 국제 정치사 연구 서양 여성사 및 사회운동 연구 4. 역사 방법론 및 디지털 역사학 연구 사료 분석 및 데이터 기반 역사 연구 역사적 데이터 시각화 및 GIS 활용 연구 디지털 아카이브 및 역사 콘텐츠 개발  사학과 졸업생들은 전통적인 역사 연구 분야뿐만 아니라, 문화 콘텐츠 개발, 교육, 언론, 공공기관 및 데이터 기반 역사 연구 등 다양한 분야에서 활동할 수 있습니다.  1. 학술 및 연구 분야 대학원 진학 후 역사학 연구 및 강의 국사편찬위원회, 한국학중앙연구원 등 연구기관 연구원 역사 관련 아카이브 및 기록 관리 전문가 2. 문화 및 콘텐츠 산업 박물관 및 문화재 연구소 (국립박물관, 문화재청 등) 역사 다큐멘터리 및 콘텐츠 기획자 출판사 및 역사 교과서 개발 전문가 3. 교육 및 공공기관 중·고등학교 역사 교사 (교원자격증 취득 후) 공공기관 및 국회 도서관, 기록관리직 공무원 유네스코 및 국제기구 역사 및 문화 연구원 4. 언론 및 미디어 분야 역사 관련 기자 및 편집자 (신문, 잡지, 방송사) 역사 다큐멘터리 및 유튜브 콘텐츠 제작자 역사 기반 웹툰, 영화, 드라마 기획 및 제작자 5. 기업 및 데이터 분석 분야 역사 데이터 분석 및 디지털 아카이브 전문가 관광 및 역사 마케팅 전문가 (문화유산 활용) 글로벌 기업 및 국제기구 문화 관련 업무 담당   사학과는 역사적 자료를 분석하고, 과거와 현재를 연결하는 종합적 사고력을 갖춘 인재를 양성하는 것을 목표로 합니다.  체계적인 역사 연구 방법론을 바탕으로 학문적 탐구 역량 강화 국내외 역사 및 문화 연구를 통해 국제적 감각 배양 디지털 역사학 및 빅데이터 활용을 통한 역사 연구 혁신 역사와 연관된 다양한 산업과 연계하여 실용적 활용 가능성 확대 본 학과는 과거의 역사적 흐름을 분석하고, 이를 바탕으로 현대 사회의 문제를 이해하며, 미래를 대비할 수 있는 창의적이고 비판적인 사고력을 갖춘 전문가를 배출하는 데 최선을 다하고 있습니다."
    },
    {
        "department_id": 66,
        "학과": "사회복지학과", 
        "학과설명": "사회복지학과는 인간 중심의 철학을 바탕으로 사회복지 현상을 연구하고, 체계적인 실천 방법을 익히는 학문입니다. 본 학과에서는 사회문제의 원인과 해결 방안을 탐구하며, 복지 제도와 정책, 실천 기술을 학습하여 개인과 사회가 직면한 다양한 문제를 해결하는 전문 역량을 배양합니다.  사회복지학은 빈곤, 정신건강, 장애, 노인복지, 여성복지, 아동복지, 의료복지, 교정복지, 연금 및 사회보장제도 등 다양한 분야를 포괄하며, 사회 정의와 형평성을 실현하는 중요한 역할을 수행합니다. 이를 위해 본 학과는 사회복지 이론과 실천을 결합하여 복지 서비스의 질을 높이고, 복지 정책을 발전시키는 전문가를 양성하는 것을 목표로 합니다.  교육과정 사회복지학과의 교육과정은 사회복지 이론과 정책 연구, 실천 기술 및 현장 경험, 연금 및 사회보장제도 연구, 디지털 시대의 복지 혁신 등 다양한 분야를 아우르는 종합적인 학습 과정으로 구성되어 있습니다.  1. 사회복지 이론 및 정책 연구 사회복지학개론 (Introduction to Social Welfare): 사회복지의 기본 개념과 역사적 발전 과정 학습 인간행동과 사회환경 (Human Behavior and Social Environment): 개인과 사회 환경 간의 상호작용 연구 사회문제론 (Social Issues and Welfare Responses): 빈곤, 실업, 차별 등 주요 사회문제의 원인과 해결 방안 연구 사회복지정책론 (Social Welfare Policy): 복지 정책의 형성과 운영, 정책 평가 방법 연구 사회복지행정론 (Social Welfare Administration): 복지 행정의 체계와 운영 방식 연구 사회복지 법제와 윤리 (Social Welfare Law and Ethics): 복지 법률 및 사회복지사의 윤리적 가치 이해 2. 실천 기술 및 현장 중심 교육 사회복지실천론 (Social Work Practice): 개별, 집단, 지역사회 대상 복지 실천 기술 학습 사회복지조사론 (Research Methods in Social Welfare): 사회복지 연구 방법 및 자료 분석 기법 익히기 지역사회복지론 (Community Welfare Studies): 지역사회의 복지 환경 분석 및 지원 방법 연구 정신건강사회복지론 (Mental Health and Social Work): 정신건강 문제 해결을 위한 복지 실천 기술 연구 사회복지현장실습 (Field Practice in Social Work): 사회복지 기관에서의 실무 경험을 통해 현장 감각 배양 사례관리 및 위기개입 기법 (Case Management and Crisis Intervention): 위기 상황에서의 개입 및 지원 전략 연구 3. 연금 및 사회보장제도 연구 연금제도는 사회보장의 핵심 요소로, 고령화 사회에서 국민들의 경제적 안정과 노후 보장을 위한 필수적인 정책입니다. 사회복지학과에서는 연금제도의 구조와 운영 방식, 정책 효과 분석, 국제 연금제도 비교 등을 연구하여 지속 가능한 복지 모델을 개발하는 것을 목표로 합니다.  연금제도 연구 (Pension Systems): 국민연금, 퇴직연금, 공적 및 사적 연금의 구조와 운영 방식 연구 사회보장론 (Social Security Studies): 공적 연금, 실업급여, 건강보험 등 사회보장제도의 역할과 정책 연구 산업복지론 (Industrial Welfare Studies): 근로자 복지, 직장 내 복지 제도 연구 의료사회복지론 (Medical Social Work): 건강보험 및 의료복지와 연금의 관계 연구 사회서비스 및 복지재정 (Social Services and Welfare Finance): 연금 및 복지 재원의 운영과 정책 분석 4. 디지털 시대의 사회복지 및 글로벌 연구 디지털 시대와 사회복지 (Social Welfare in the Digital Era): 4차 산업혁명과 데이터 기반 복지 정책 변화 학습 미래사회복지연구 (Future Social Welfare Studies): 고령화, 인공지능(AI), 빅데이터 기반 복지 시스템 연구 비교사회복지론 (Comparative Social Welfare Studies): 해외 복지제도의 비교 분석 및 국제 사례 연구 국제사회복지론 (International Social Welfare Studies): 글로벌 복지 정책 및 국제 기구의 역할 연구 5. 세대별 맞춤형 복지 정책 연구 장애인복지론 (Disability Welfare Studies): 장애인의 삶의 질 향상을 위한 복지 정책 연구 아동 및 가족복지론 (Child and Family Welfare Studies): 아동 보호 및 가족 지원 정책 연구 노인복지론 (Elderly Welfare Studies): 고령화 사회에서의 노인복지 정책 연구 졸업 후 진로 사회복지학과 졸업생들은 공공 및 민간 부문에서 복지 정책 기획, 복지 서비스 운영, 연구 및 교육 등 다양한 분야에서 활동할 수 있습니다.  공공기관 및 정부 부문  보건복지부, 여성가족부, 고용노동부 등 정부기관 국민연금공단, 건강보험공단, 지방자치단체 사회복지 공무원 사회복지 정책 기획 및 연구기관 사회복지 기관 및 서비스 분야  사회복지관, 노인복지센터, 아동보호기관 등 정신건강 및 장애인 복지 시설 국제 NGO 및 개발협력기관 (UNICEF, 굿네이버스, 세이브더칠드런) 연구 및 학술 분야  대학원 진학 후 연구 및 교수직 사회복지 관련 연구소 연구원 복지정책 컨설턴트 및 평가 전문가 금융 및 기업 복지 분야  연금 컨설팅 및 사회적 금융 기업 기업 복지 프로그램 기획 및 운영 산업 복지 컨설턴트 학과의 비전: 지속 가능한 복지 및 연금제도 연구 사회복지학과는 연금 및 사회보장제도를 연구하여 사회적 안전망을 강화하고, 모든 세대가 안정적인 삶을 영위할 수 있도록 기여하는 전문가를 양성하는 것을 목표로 합니다.  연금 개혁 및 지속 가능한 사회보장 연구 국제 연금제도 비교 및 글로벌 복지 모델 연구 연금 사각지대 해소 및 노인 빈곤 예방 정책 연구 디지털 기술을 활용한 연금 서비스 개선 및 혁신 연구 본 학과는 사회적 책임과 윤리적 가치를 바탕으로 복지 서비스를 개선하고, 공공 및 민간 부문에서 전문적으로 활동할 수 있는 인재를 양성하며, 글로벌 복지 정책 발전에 기여할 것입니다."
    },
    {
        "department_id": 64,
        "학과": "사회학과",
        "학과설명": "사회학과는 인간 사회의 생성, 발전, 소멸을 구조적 관점에서 체계적으로 설명하며, 사회 질서와 변화를 심층적으로 연구하는 학문입니다. 본 학과는 사회적 행위, 사회체계, 구조적 변동을 분석하여 사회 문제 해결과 정책 개발에 기여할 수 있는 전문 인재를 양성하는 것을 목표로 합니다.  사회학은 경제, 정치, 문화, 교육, 종교, 가족, 젠더, 환경, 대중문화 등 다양한 사회 현상을 연구하며, 현대 사회의 복잡한 문제를 과학적으로 탐구하는 학문입니다. 본 학과는 이론적 지식과 실증적 연구 방법을 결합하여, 사회 현상을 분석하고 해결책을 모색하는 능력을 배양합니다.  교육과정 사회학과의 교육과정은 사회학 이론, 조사 방법론, 데이터 분석, 현대사회 문제 연구 등을 포함하여 사회 변화와 구조적 문제를 체계적으로 분석할 수 있도록 구성되어 있습니다.  1. 사회학 이론 및 기초 과정 사회학개론 (Introduction to Sociology): 사회학의 기본 개념과 주요 연구 분야 학습 현대사회학이론 (Contemporary Sociological Theories): 현대 사회학자들의 이론적 분석 연구 고전사회학이론 (Classical Sociological Theories): 마르크스, 베버, 뒤르켐 등 사회학의 고전적 이론 탐구 사회변동론 (Social Change and Development): 사회구조의 변화 과정과 발전 연구 사회체계와 구조 (Social Systems and Structure): 사회조직과 제도의 형성과 작동 원리 분석 2. 사회조사 및 데이터 분석 과정 사회조사방법론 (Research Methods in Sociology): 질적·양적 연구 기법 습득 사회통계학 (Social Statistics): SPSS, R 등을 활용한 데이터 분석 및 해석 질적연구방법론 (Qualitative Research Methods): 심층 인터뷰, 참여 관찰 등 질적 조사 방법 학습 네트워크 분석 (Social Network Analysis): 사회관계망 분석을 활용한 데이터 기반 연구 빅데이터와 사회분석 (Big Data and Social Analysis): 데이터 사이언스를 활용한 사회 연구 3. 현대 사회 문제 및 응용 연구 사회문제론 (Social Problems): 빈곤, 실업, 불평등, 환경오염 등 현대 사회 문제 연구 젠더와 사회 (Gender and Society): 성별, 여성학, 젠더 불평등 연구 도시사회학 (Urban Sociology): 도시화, 주거문제, 도시 개발 연구 문화사회학 (Cultural Sociology): 대중문화, 미디어, 예술과 사회의 관계 연구 경제사회학 (Economic Sociology): 경제 시스템과 사회구조의 상호작용 연구 4. 정책 및 사회 변동 연구 사회정책론 (Social Policy and Welfare Studies): 복지 정책과 공공정책의 효과 분석 노동사회학 (Sociology of Work and Labor): 노동시장, 고용형태 변화 연구 정치사회학 (Political Sociology): 권력구조, 사회운동, 시민사회 연구 환경사회학 (Environmental Sociology): 기후변화, 환경 정책 및 지속 가능성 연구 디지털 사회와 미디어 (Digital Society and Media Studies): SNS, 정보기술과 사회적 변화 연구 5. 연구 및 실습 과정 사회연구 세미나 (Sociological Research Seminar): 심층 연구 프로젝트 수행 사회현장실습 (Field Internship in Sociology): 공공기관, 연구소, 기업 등에서 실무 경험 캡스톤 프로젝트 (Capstone Project in Sociology): 사회문제 해결을 위한 실증 연구 프로젝트 수행 연구 분야 사회학과는 사회구조와 변화, 현대사회 문제 해결, 정책 개발 등 다양한 분야에서 연구를 수행합니다.  사회 불평등 및 계층 연구  빈곤, 교육격차, 세대 간 이동성 분석 소득 불평등 및 사회 계층 이동 연구 젠더, 인종, 지역 간 격차 연구 사회 네트워크 및 디지털 사회 연구  SNS 및 미디어를 통한 사회적 관계 연구 빅데이터를 활용한 사회 변화 분석 온라인 커뮤니티와 디지털 시민사회 연구 도시 및 환경 사회학 연구  도시화 및 지역 개발 연구 기후변화 및 지속가능한 사회 연구 주거 문제 및 교통 시스템 연구 정치·경제·노동 사회학 연구  노동시장 변화 및 일자리 정책 연구 사회운동과 정치 참여 연구 공공정책과 사회적 갈등 연구 졸업 후 진로 사회학과 졸업생들은 공공기관, 연구소, 기업, 미디어, 국제기구 등 다양한 분야에서 전문가로 활동할 수 있습니다.  공공기관 및 정책 연구 분야  국회 및 정부기관 (통계청, 고용노동부, 국토교통부 등) 정책 연구소 및 싱크탱크 (한국사회과학연구원, 한국행정연구원 등) 지방자치단체 및 공공기관 기업 및 산업 분석 분야  시장조사 및 데이터 분석 전문가 기업의 인사관리 및 조직 컨설팅 소비자 행동 및 마케팅 전략 연구 미디어 및 저널리즘 분야  방송사, 신문사, 미디어 기업의 콘텐츠 기획 및 제작 데이터 기반 저널리즘 연구 및 기사 작성 출판 및 콘텐츠 제작, 미디어 전략 기획 국제기구 및 NGO 분야  UN, OECD, 세계은행 등의 국제기구 연구원 인권 단체 및 비영리기구 연구 및 기획 담당 글로벌 사회 문제 해결 프로젝트 기획 및 실행 연구 및 학계 진출  대학원 진학 후 연구 및 교수직 사회학 및 정책 연구소 연구원 사회조사 및 데이터 분석 연구원 학과의 비전 사회학과는 이론과 실증적 연구를 바탕으로 현대 사회 문제를 분석하고, 실질적인 해결책을 제시하는 전문가를 양성하는 것을 목표로 합니다.  사회 구조와 변화 연구를 통한 정책 제안 및 문제 해결 빅데이터, AI, 디지털 기술을 활용한 사회 분석 및 예측 글로벌 사회 문제에 대한 비교 연구 및 국제 협력 강화 다양한 분야에서 사회학적 통찰력을 가진 전문가 양성 본 학과는 사회과학적 분석 능력과 비판적 사고력을 갖춘 글로벌 인재를 육성하여, 사회 발전과 혁신을 주도할 인재를 배출하는 데 최선을 다하고 있습니다."
    },
    {
        "department_id": 39,
        "학과": "산림환경과학과",
        "학과설명": "산림환경과학과는 산림자원의 보전과 활용을 통해 국민경제, 국토보전, 생태계 유지, 국민 건강, 그리고 관광과 휴양에 기여하는 산림 전문가를 양성하는 학과입니다. 숲과 인류의 공존을 기반으로, 산림의 과학적 관리와 보호, 지속 가능한 발전을 목표로 다양한 학문적 지식을 제공하며, 이를 실무에 적용할 수 있는 고도의 기술을 갖춘 인재를 배출합니다.  본 학과에서는 숲의 생태적, 환경적, 경제적 가치를 이해하고, 산림의 조성·관리·복원·이용에 대한 체계적인 교육을 통해 산림 경영가, 산림 행정가, 연구원, 기술 전문가를 양성합니다. 학생들은 조림학, 산림생태학, 산림경영학, 산림휴양학, 산림환경보호학 등 산림과 관련된 핵심 분야를 학습하며, 산림의 보전과 이용이라는 균형 잡힌 접근 방식을 익힙니다.  학과 비전 산림환경과학과는 기후변화 시대에 맞는 지속 가능한 산림 관리와 보전 기술을 연구하고, 실무 중심의 산림 전문가를 양성하는 것을 목표로 합니다.  1. 지속 가능한 산림 관리 및 생태 보전 연구 산림 복원 및 기후변화 대응 전략 수립 생태계 서비스 및 지속 가능한 산림 경영 연구 2. 산림과 인간의 공존을 위한 정책 및 기술 개발 산림 정책 및 법제 연구를 통한 공공 행정 역량 강화 산림 기술 및 조림 방법론 개발을 통한 경제적 활용 극대화 3. 실무 중심 교육 및 산학 협력 강화 산림 측량, GIS(지리정보 시스템) 및 원격 탐사 기술 교육 공공기관 및 민간 산림 관련 기업과 연계한 실습 및 연구 프로젝트 4. 글로벌 환경 변화 대응 및 산림 산업 발전 기여 국제 산림 보호 및 기후변화 대응 연구 수행 친환경 임업 기술 및 탄소 중립 관련 연구 활성화 교육과정 산림환경과학과의 교육과정은 산림의 조성, 보호, 복원, 경영, 활용 등 다양한 분야를 포함하며, 단계별로 체계적인 학습이 이루어집니다.  1~2학년: 기초 및 기본 이론 학습 산림환경과학개론 (Introduction to Forest Environmental Science): 산림과 환경의 상호작용 개념 학습 수목학 및 실습 (Dendrology & Practice): 주요 수종의 생리적 특성 및 분류 연구 조림학 (Silviculture): 조림 기술 및 생태적 중요성 연구 산림자원 측정 및 관리 (Forest Resource Measurement & Management): 산림 경영을 위한 측정 및 데이터 활용 기법 3학년: 심화 과정 및 실습 강화 산림환경보존공학 (Forest Environmental Conservation Engineering): 산림 보호 및 복원 공학 연구 산림경영학 (Forest Management & Economics): 지속 가능한 산림 경영 및 경제성 평가 산림정책학 (Forest Policy & Law): 국내외 산림 정책 및 법률 연구 산림토양학 및 비배학 (Forest Soil Science & Fertilization): 산림 토양의 특성과 지속 가능한 이용 연구 4학년: 실무 중심 연구 및 프로젝트 수행 현장종합실습 (Field Training in Forest Science): 산림 자원 및 관리 실무 경험 산림생산시스템학 (Forest Production Systems): 지속 가능한 임산물 생산 기법 연구 휴양림계획 및 설계학 (Recreational Forest Planning & Design): 자연 휴양림 및 산림 관광 계획 연구 기후변화와 산림학 (Climate Change & Forestry): 탄소 중립 및 기후변화 대응 연구 연구 분야 산림환경과학과는 산림 자원의 보전과 활용, 환경 보호, 지속 가능한 산림 경영 등을 중심으로 다양한 연구를 수행합니다.  1. 산림 보전 및 복원 연구 훼손된 산림 생태계의 복원 기술 개발 기후변화에 대응하는 내건성 수종 연구 생태계 서비스 평가 및 보전 전략 연구 2. 지속 가능한 산림 경영 및 활용 연구 산림 자원의 경제적 가치 평가 및 지속 가능한 경영 전략 산림 바이오매스 및 신재생 에너지 개발 연구 탄소 흡수원으로서의 산림 경영 최적화 연구 3. 산림 환경 및 생태 연구 산림 생태계 구조 및 기능 분석 멸종 위기종 보호 및 생물다양성 연구 산림과 수자원 관리의 연계 연구 4. 스마트 산림 기술 및 원격 탐사 연구 드론 및 GIS(지리정보 시스템)을 활용한 산림 관리 연구 인공지능(AI) 기반 산림 건강 진단 및 조림 최적화 연구 원격 탐사 기술을 이용한 산림 모니터링 및 예측 연구 졸업 후 진로 산림환경과학과 졸업생들은 공공기관, 연구소, 환경 컨설팅 기업, 조경 및 복원 산업 등 다양한 분야에서 활동할 수 있습니다.  1. 공공기관 및 행정 분야 산림청, 국립공원공단, 환경부: 산림 행정 및 보호 정책 담당 지자체 산림 관련 부서: 지역별 산림 관리 및 복원 업무 수행 한국임업진흥원, 국립산림과학원: 연구 및 산림 정책 분석 2. 산림 복원 및 환경 컨설팅 분야 산림 복원 및 조경 회사: 훼손된 산림의 복원 및 생태계 회복 프로젝트 환경 NGO 및 국제기구: 산림 보호 및 국제 환경 협약 활동 3. 연구 및 학술 분야 대학원 진학 후 연구원 활동: 산림 생태학, 환경 공학, 기후변화 연구 등 국립 및 사립 연구소: 산림 생태 및 환경 연구 4. 기업 및 산업 분야 산림 바이오매스 및 신재생 에너지 기업: 친환경 자원 개발 산림 컨설팅 및 GIS 분석 기업: 스마트 산림 관리 및 환경 평가 휴양림 및 산림 관광 기업: 지속 가능한 산림 이용 및 관광 사업 운영 학과의 역할과 목표 산림환경과학과는 산림의 보전과 지속 가능한 이용을 선도하며, 기후변화 시대에 맞는 미래 산림과학의 발전과 자연과 공존하는 건강한 환경 조성에 기여할 인재를 양성합니다.  산림 복원 및 기후변화 대응 기술 개발 스마트 산림 관리 및 원격 탐사 기술 활용 국내외 산림 정책 및 지속 가능한 산림 경영 연구 탄소 중립 및 신재생 에너지 활용을 통한 산림의 역할 확대 산림환경과학과는 자연과 함께 성장하고, 지속 가능한 미래를 고민하는 여러분을 환영합니다. 숲을 사랑하고, 환경 보호 및 지속 가능한 산림 관리에 기여하고자 하는 학생들에게 체계적인 교육과 실무 경험을 제공하여, 미래 산림 산업의 핵심 전문가로 성장할 수 있도록 지원합니다."
    },
    {
        "department_id": 76,
        "학과": "산업디자인학과",
        "학과설명": "업디자인학과는 제품디자인, 시각디자인, 영상디자인 분야를 중심으로 다양한 디자인 능력을 교육합니다. 제품디자인 분야에서는 대량생산을 위한 제품 분석, 개발, 창조 과정을 배우며, 디자인 마케팅부터 아이디어 발상, 형상화, 최종 프로토타입 개발까지의 단계적인 과정을 학습합니다. 시각디자인 분야는 실용적인 정보 전달을 위한 디자인에 초점을 맞추고, 영상디자인 분야는 영상 컴퓨터그래픽, 합성, 미니어처, 3D 애니메이션 등 가상 콘텐츠 제작과 게임산업에 필요한 모든 콘텐츠 개발 과정을 집중적으로 교육합니다. 학과는 창의적이고 실무에 강한 디자인 전문가를 양성하는 것을 목표로 합니다."
    },
    {
        "department_id": 14,
        "학과": "산업정보시스템공학과",
        "학과설명": "산업정보시스템공학과는 기계적 요소와 정보기술(IT)을 융합하여 제조 시스템을 최적화하고, 생산성을 극대화하는 학문입니다. 본 학과에서는 생산관리, 품질관리, 공정 분석 및 개선, 공장자동화 등을 기반으로 산업 시스템을 효율적으로 운영할 수 있는 역량을 배양하며, 스마트 제조, 디지털 전환, 공급망 최적화 등의 최신 기술을 연구합니다.  특히, 공학적 기초(공업통계, 경영과학, 경제성공학)와 데이터 기반 분석(빅데이터, 데이터마이닝, 인공지능, ERP)를 접목하여, 공정 최적화 및 자동화 시스템을 구축할 수 있는 전문 인재를 양성하는 것을 목표로 합니다.  본 전공을 통해 학생들은 제조업에서 필수적인 기계적 요소, 시스템 설계, 생산 공정 최적화, 디지털 제조 기술을 학습하여, 스마트 팩토리, 로봇공학, 자동화 시스템, 신뢰성 공학 등 다양한 분야에서 핵심적인 역할을 수행할 수 있습니다.  전공 목표 및 핵심 역량 제조 및 생산 시스템 최적화  기계적 요소를 고려한 생산 공정 최적화 스마트 팩토리 및 공장 자동화 기술 연구 생산 계획 및 운영 효율화 공정 분석 및 품질 개선  통계적 품질 관리(SQC) 및 6시그마 기법 적용 실험계획법을 활용한 공정 최적화 신뢰성 공학 및 시스템 유지보수 관리 데이터 기반 제조 및 스마트 공장  빅데이터 및 AI를 활용한 제조 공정 최적화 ERP(전사적자원관리) 및 SCM(공급망 관리) 연구 데이터마이닝 및 시뮬레이션을 통한 생산 최적화 공장 자동화 및 로봇공학  스마트팩토리 및 IoT 기반 자동화 시스템 연구 공장자동화 및 로봇공학을 활용한 생산 효율화 인공지능 및 데이터 분석을 통한 자동화 기술 개발  연구 분야 1. 제조 및 생산 시스템 최적화 연구실 기계적 요소와 IT 융합 기반 생산성 향상 연구 생산공학 및 실습을 통한 제조 공정 개선 실시간 공정 모니터링 및 공정 최적화 연구 2. 스마트 팩토리 및 공장 자동화 연구실 IoT 기반의 스마트팩토리 구축 및 운영 최적화 AI 기반 공정 분석 및 자동화 시스템 연구 디지털 트윈 기술을 활용한 제조 공정 시뮬레이션 3. 데이터 분석 및 산업 최적화 연구실 빅데이터 및 머신러닝을 활용한 생산 공정 최적화 데이터마이닝 및 AI 기반 제조 데이터 분석 연구 AI 기반 예측 유지보수(Predictive Maintenance) 연구 4. 품질관리 및 신뢰성 공학 연구실 통계적 품질관리(SQC) 및 실험계획법(DoE) 연구 6시그마 및 Lean Manufacturing을 통한 품질 혁신 연구 제품 수명주기 및 신뢰성 분석 연구 5. 공급망 최적화 및 물류 시스템 연구실 공급망 네트워크 분석 및 물류 최적화 실시간 데이터 기반 SCM 최적화 연구 블록체인 및 IoT 기반 스마트 물류 연구  1. 기초 및 기본 공학 과정 공업통계(Engineering Statistics) 선형대수학(Linear Algebra) 경영과학(Management Science) 경제성공학(Engineering Economy) 2. 제조 및 생산 시스템 과정 생산관리(Production Management) 공정분석 및 개선(Process Analysis & Improvement) 생산공학 및 실습(Manufacturing Engineering & Lab) 시스템건전성관리(System Reliability Management) 3. 스마트 제조 및 자동화 과정 스마트팩토리 개론(Introduction to Smart Factory & IoT) 공장자동화 및 로봇공학(Factory Automation & Robotics) SCM(공급망 관리, Supply Chain Management) 6시그마(Six Sigma & Lean Manufacturing) 4. 데이터 분석 및 정보 시스템 과정 자료구조 및 알고리즘(Data Structures & Algorithms) 데이터베이스 설계(Database Design) 데이터마이닝(Data Mining) 빅데이터 분석 및 응용(Big Data Analytics & Applications) 전사적자원관리(Enterprise Resource Planning, ERP) 5. 실습 및 프로젝트 중심 교육 창의적 공학설계입문(Creative Engineering Design Introduction) 시스템 시뮬레이션(System Simulation) 종합설계 프로젝트(Capstone Design Project)  졸업 후 진로제조 및 공정 관리 분야   스마트 팩토리 및 공장 자동화 엔지니어 품질 및 생산 공정 개선 전문가 데이터 분석 및 IT 컨설팅 분야  데이터 사이언티스트 및 AI 엔지니어 IT 시스템 설계 및 ERP 컨설턴트 공정 최적화 및 시뮬레이션 전문가 공급망 및 물류 관리 분야  글로벌 물류 기업  공급망 최적화 및 물류 자동화 엔지니어 SCM 및 물류 컨설턴트경영 및 컨설팅 분야  경영 컨설팅 및 금융 데이터 분석 기업 프로세스 혁신 및 IT 전략 기획 e-비즈니스 및 디지털 트랜스포메이션 전문가 학과의 비전 산업정보시스템공학과는 기계적 요소를 기반으로 한 제조 시스템 최적화, 데이터 기반 공정 혁신, 스마트 제조 및 자동화, 공급망 최적화 등의 분야에서 글로벌 경쟁력을 갖춘 인재를 양성하는 것을 목표로 합니다.  스마트 제조 및 공장 자동화 연구를 통한 4차 산업혁명 대응 AI 및 데이터 분석을 활용한 산업 최적화 및 의사결정 지원 산업 공정 개선 및 지속가능한 경영 시스템 연구 현장 실무 중심 교육을 통해 산업 경쟁력을 갖춘 전문가 양성 본 학과는 산업과 정보기술의 융합을 통해, 효율적이고 혁신적인 제조 시스템을 구축하는 글로벌 전문가를 양성하며, 학생들이 다양한 산업 분야에서 창의적이고 실용적인 문제 해결 능력을 발휘할 수 있도록 지원합니다."
    },
    {
        "department_id": 102,
        "학과": "생명공학부",
        "학과설명": "생명공학부는 미생물, 식물, 동물 등 생명체를 활용하여 환경 정화 및 복원 기술을 개발하고, 생체분자의 특성을 규명하여 신기능성 생리활성소재를 개발하는 첨단 생명공학 분야의 고급 인력 양성을 목표로 합니다.  본 학부는 생물산업의 핵심 분야인 생물의약, 생물화학, 기능성식품 산업 등에 기여하며, 생리활성물질의 생산과 효능 평가를 포함한 교과과정을 제공합니다. 또한, 환경생명공학 전공을 통해 수질, 토양, 폐기물 관리 등 환경과학의 다양한 분야를 연구하며, 지속 가능한 생태계를 조성하고 인간 환경의 질적 향상을 도모합니다.  생명공학부는 기초부터 응용까지 폭넓은 교육을 통해 국가와 인류 사회 발전에 기여하는 생명자원 및 환경공학 전문가를 양성하는 것을 목표로 합니다.  교육과정 생명공학부의 교육과정은 기초 생명과학, 생명공학 응용, 환경생명공학, 생물의약 및 기능성 식품 연구 등 다양한 분야를 아우르며, 생명과학의 핵심 개념을 이해하고 이를 실제 산업 및 연구에 적용할 수 있도록 구성되어 있습니다.  1. 기초 생명과학 및 생명공학 개론 생명과학개론 (Introduction to Life Science): 생명과학의 기초 개념 및 최신 연구 동향 학습 분자생물학 (Molecular Biology): DNA, RNA, 단백질 등 생명현상의 분자적 이해 세포생물학 (Cell Biology): 세포의 구조와 기능 및 생명활동의 기본 원리 생화학 (Biochemistry): 생체분자의 화학적 성질 및 대사 과정 연구 유전학 (Genetics): 유전자 발현 및 유전정보의 전달 원리 학습 2. 생명공학 응용 및 바이오산업 연구 미생물공학 (Microbial Biotechnology): 미생물을 활용한 생명공학 기술 연구 단백질공학 (Protein Engineering): 단백질 구조 및 기능 연구, 신약 개발 응용 바이오소재공학 (Biomaterials Engineering): 생체재료 개발 및 바이오소재 응용 기술 기능성식품학 (Functional Food Science): 기능성 생리활성물질 개발 및 식품산업 응용 생물의약공학 (Biopharmaceutical Engineering): 백신, 항체 치료제 등 바이오의약품 개발 연구 3. 환경생명공학 및 생태복원 연구 환경생명공학개론 (Environmental Biotechnology): 생명공학을 활용한 환경 문제 해결 연구 수질 및 폐기물 관리 (Water & Waste Management): 수질 정화 및 폐기물 처리 기술 연구 토양 미생물학 (Soil Microbiology): 토양 미생물 활용을 통한 환경 복원 연구 바이오에너지공학 (Bioenergy Engineering): 미생물 및 생물소재를 이용한 친환경 에너지 생산 연구 생물 정화 및 환경 복원 기술 (Bioremediation & Environmental Restoration): 환경오염 정화 및 생태계 복원 기술 연구 4. 실험 및 연구 중심 교육 생명공학실험 (Biotechnology Lab): 유전자 조작, 단백질 분석 등 최신 실험 기술 습득 유전자조작기술 (Genetic Engineering Techniques): 유전자 편집 기술 및 응용 연구 세포배양 및 조직공학 (Cell Culture & Tissue Engineering): 세포 배양 및 조직 재생 기술 연구 바이오프로세스공학 (Bioprocess Engineering): 바이오 생산 공정 설계 및 최적화 연구 캡스톤디자인프로젝트 (Capstone Design Project in Biotechnology): 실무형 연구 프로젝트 수행 연구 분야 생명공학부는 생명공학, 환경생명공학, 바이오의약, 기능성식품 및 바이오에너지 등 다양한 산업 및 연구 분야에서 최신 기술을 탐구하고 혁신적인 연구를 수행합니다.  미생물 및 바이오소재 연구  유익 미생물 활용 및 대사 공학 연구 미생물 기반 생리활성물질 생산 연구 생물소재 기반 친환경 바이오플라스틱 개발 생물의약 및 신약 개발 연구  바이오의약품(백신, 단백질 치료제, 항체)의 생산 및 응용 연구 줄기세포 및 조직공학을 활용한 재생의료 연구 신기능성 생리활성소재 개발 및 항암제 연구 환경생명공학 및 생태복원 연구  환경오염 정화 및 미생물 활용 생태복원 연구 수질 및 토양 오염 복원 기술 개발 바이오에너지를 이용한 친환경 연료 개발 연구 기능성 식품 및 건강 산업 연구  건강 기능성 식품 개발 및 효능 평가 연구 천연물 기반 생리활성소재 연구 프로바이오틱스 및 장내 미생물 연구 졸업 후 진로 생명공학부 졸업생들은 생명공학, 바이오의약, 환경생명공학, 기능성 식품, 바이오에너지, 공공 및 연구 분야 등 다양한 산업 및 연구 분야에서 전문가로 활동할 수 있습니다.  바이오의약 및 생명공학 산업  바이오 제약 및 신약 개발 연구소 (삼성바이오로직스, 셀트리온, 한미약품 등) 유전자 치료 및 백신 개발 기업 바이오소재 및 생명공학 기업 환경생명공학 및 생태복원 산업  환경 정화 및 폐기물 관리 관련 연구소 정부 및 공공기관 환경 관련 부서 (환경부, 국립환경과학원 등) 바이오에너지 및 친환경 산업 연구소 기능성 식품 및 건강 산업  기능성 식품 및 건강보조제 연구 개발 기업 천연물 소재 및 생리활성물질 연구소 프로바이오틱스 및 발효식품 산업 연구 및 학술 분야  국내외 대학원 진학 및 연구소 연구원 생명과학 및 환경생명공학 연구기관 바이오 및 환경 관련 공공 연구기관 학과의 비전 생명공학부는 미래 생명과학과 환경공학을 선도할 글로벌 인재를 양성하고, 지속 가능한 생태계와 바이오 기술 혁신을 주도하는 연구를 수행하는 것을 목표로 합니다.  유전자 조작 및 바이오소재 개발을 통한 신기능성 생명공학 연구 환경 생명공학을 활용한 친환경 기술 개발 및 지속 가능한 발전 기여 바이오의약, 기능성식품 및 건강 산업의 혁신적인 연구 및 응용 실무형 연구 및 산업 연계를 통한 글로벌 바이오 전문가 양성 본 학부는 첨단 생명공학 기술을 기반으로 국가 및 글로벌 바이오산업을 선도할 전문 인재를 양성하며, 학생들이 다양한 산업 및 연구 분야에서 창의적이고 실용적인 역량을 발휘할 수 있도록 지원합니다."
    },
    {
        "department_id": 94,
        "학과": "생명과학부(분자생물학)",
        "학과설명": "생명과학부는 생명현상의 기본 원리를 분자 수준에서 탐구하는 학문으로, 동물, 식물, 미생물 등 다양한 생명체를 연구하여 생명과학의 이론적 기반을 구축하고 응용 기술을 개발하는 것을 목표로 합니다. 특히, 분자생물학, 유전학, 생화학을 중심으로 세포 내 생명현상의 조절 기작을 이해하고, 이를 의생명과학, 바이오의약, 환경과학 등의 산업에 적용할 수 있도록 교육합니다. 또한, 질병 치료, 생물자원 활용, 친환경 바이오 기술 개발 등 생명과학의 다양한 응용 분야에서 핵심적인 역할을 수행하는 전문가를 양성합니다.  학과 비전  분자생물학 및 유전공학 연구 강화  유전자 발현 조절 및 단백질 기능 연구  CRISPR-Cas9을 활용한 유전자 편집 기술 개발  바이러스 및 감염병 대응을 위한 유전적 메커니즘 연구  생체분자 및 세포 조절 기작 탐구  단백질 구조 및 기능 분석  효소 활성 및 신호전달 체계 연구  재조합 단백질 및 대사 네트워크 규명  실험 및 연구 중심 교육 강화  최신 분자생물학 실험 기법 및 분석 도구 활용  유전체 및 단백체 연구를 위한 생물정보학 교육  연구 프로젝트 및 기업·기관 인턴십을 통한 실무 역량 배양  생명과학의 융합 연구 활성화  생명공학, 환경과학, 정밀의료 분야 융합 연구  맞춤형 의학 및 신약 개발 연구  지속 가능한 바이오기술 및 친환경 생물자원 연구  교육 과정  1~2학년: 분자생물학 기초 및 생명현상 이해  세포생물학 (Cell Biology): 세포 구조 및 기능 연구  생화학 (Biochemistry): 생체분자의 구조 및 대사과정 연구  분자생물학 개론 (Introduction to Molecular Biology): DNA, RNA, 단백질 간의 상호작용 이해  유기화학 (Organic Chemistry): 생체분자의 화학적 특성 연구  3학년: 심화 분자생물학 연구  분자유전학 (Molecular Genetics): 유전자 발현 및 조절 연구  생체분자 분석학 (Biomolecular Analysis): 단백질 및 유전자 정제 및 분석 기술 학습  유전체학 및 생물정보학 (Genomics & Bioinformatics): 유전체 해독 및 데이터 분석  면역생물학 (Immunobiology): 면역 시스템의 분자적 기전 연구  4학년: 응용 및 실험 중심 과정  재조합 DNA 기술 (Recombinant DNA Technology): 유전자 클로닝 및 형질전환 연구  의학 및 암생물학 (Medical & Cancer Biology): 암 유전자 연구 및 치료법 개발  캡스톤 연구 프로젝트 (Capstone Research Project): 연구 중심 프로젝트 수행  연구 분야  1. 분자생물학 및 유전공학 연구  유전자 발현 조절 및 전사 기전 연구  CRISPR-Cas9 기반 유전자 편집 연구  인간 및 식물 유전체 분석 및 응용  2. 단백질 및 생화학 연구  단백질 구조 및 기능 규명  효소 활성 및 신호전달 체계 연구  단백질-단백질 상호작용 네트워크 분석  3. 바이오의약 및 신약 개발 연구  항암제 및 면역치료제 개발  단백질 치료제 및 바이오 의약품 연구  줄기세포 및 재생의학 기술 연구  4. 생물정보학 및 유전체 연구  유전자 서열 분석 및 데이터 마이닝 연구  AI 기반 신약 개발 및 질병 예측 모델 연구  단일세포 유전체학 및 메타유전체학 연구  졸업 후 진로  1. 바이오 및 의약산업  제약 및 바이오 기업 (삼성바이오로직스, 셀트리온, 한미약품 등)  맞춤형 유전자 치료 및 신약 개발 연구  바이오 벤처 및 신약 개발 스타트업 창업  2. 연구 및 학술 분야  국내외 대학원 진학 후 연구원 활동  국립생명과학연구소, 한국생명공학연구원 등 연구소  유전체학 및 생물정보학 연구소 연구원  3. 환경 및 지속가능 바이오 산업  생물학적 폐기물 처리 및 바이오리파이너리 연구  미생물을 활용한 환경 복원 및 바이오연료 연구  지속 가능한 식량 생산 및 유전자 변형 작물 연구  4. 헬스케어 및 정밀의료 분야  개인 맞춤형 유전체 분석 및 정밀의료 기업  AI 기반 의료 데이터 분석 및 질병 예측 연구  임상 연구 및 병원 연구소 (국립암센터, 서울대병원 연구소 등)  학과의 역할과 목표  생명과학부(분자생물학)는 분자 수준에서 생명현상을 탐구하고, 이를 생명공학, 의학, 정밀의료, 환경과학 등 다양한 산업에 응용할 수 있는 전문가를 양성합니다.  최신 분자생물학 연구 및 실험 기술 교육 강화  유전자 편집 및 신약 개발 분야 연구 활성화  정밀의료 및 생물정보학 전문가 양성  지속 가능한 바이오기술 및 환경 생물학 연구 확대  생명과학부(분자생물학)는 21세기 바이오 혁신 시대를 선도할 창의적이고 융합적인 인재를 양성하며, 생명과학의 발전과 실용화를 통해 인류 건강과 환경 보호에 기여하는 글로벌 인재를 배출하는 것을 목표로 합니다."
    },
    {
        "department_id": 95,
        "학과": "생명과학부(생명과학)",
        "학과설명": "생명과학부는 동물, 식물, 미생물 등 다양한 생물체와 생물학적 시스템을 활용하여 질병, 기아, 환경오염 등 인류가 직면한 문제를 해결하고, 삶의 질을 향상시키는 첨단 생명공학 분야를 연구하는 학문입니다.  본 학부는 생명과학의 기초 및 응용 원리를 교육하여, 21세기 미래 산업인 생명공학을 선도할 고급기술 전문 인력을 양성하는 것을 목표로 합니다. 교육과정은 유기화학, 세포생물학, 분자생물학, 생화학 등 다양한 과목으로 구성되어 있으며, 학생들은 생명과학의 이론과 실습을 균형 있게 습득하여 생명공학 분야에서 연구와 산업의 발전을 이끌어 갈 수 있도록 교육받습니다.  생명과학부는 생명과학 연구 및 응용을 통해 건강, 식량, 환경 등 다양한 문제 해결을 위한 혁신적인 기술을 개발하며, 생명과학 및 생명공학 산업의 핵심 인재 양성을 목표로 합니다.  교육과정 생명과학부의 교육과정은 생명과학의 기초 이론, 응용 생명공학, 실험 및 연구 중심 교육으로 구성되어 있으며, 학생들이 생명과학의 다양한 분야에서 실질적인 연구 역량을 갖출 수 있도록 합니다.  1. 기초 생명과학 과정 일반생물학 (General Biology): 생명과학의 기본 개념 및 원리 학습 유기화학 (Organic Chemistry): 생체 분자의 화학적 구조 및 반응 원리 연구 세포생물학 (Cell Biology): 세포의 구조, 기능 및 신호전달 기작 이해 분자생물학 (Molecular Biology): 유전자 및 단백질의 조절 기작 연구 생화학 (Biochemistry): 생체 내 화학적 반응과 대사과정 학습 유전학 (Genetics): 유전자 발현 및 유전적 질병 연구 2. 응용 생명공학 및 바이오산업 연구 미생물학 (Microbiology): 미생물의 특성과 생명공학적 응용 연구 바이러스학 (Virology): 바이러스의 구조 및 감염 기작 분석 면역학 (Immunology): 면역체계 및 질병 예방 연구 생명정보학 (Bioinformatics): 유전체 분석 및 생물 데이터 분석 연구 합성생물학 (Synthetic Biology): 유전자 편집 및 세포 공학 연구 바이오의약품개론 (Biopharmaceuticals): 신약 개발 및 항체 치료제 연구 3. 생태 및 환경 생명과학 연구 생태학 (Ecology): 생물과 환경 간의 상호작용 연구 환경미생물학 (Environmental Microbiology): 환경 정화 및 생태 복원 연구 식물생명공학 (Plant Biotechnology): 유전자 변형 작물 및 식물 기능 연구 바이오에너지 및 친환경 기술 (Bioenergy & Green Technology): 미생물을 활용한 바이오연료 개발 독성학 (Toxicology): 환경 오염 물질이 생명체에 미치는 영향 연구 4. 실험 및 연구 중심 교육 분자생물학 실험 (Molecular Biology Lab): 유전자 조작 및 단백질 분석 실습 생화학 실험 (Biochemistry Lab): 효소 반응 및 생체 분자 연구 세포배양 및 조직공학 (Cell Culture & Tissue Engineering): 세포 및 조직 배양 기술 연구 유전체학 실험 (Genomics & Proteomics Lab): DNA 및 단백질 분석 기술 학습 캡스톤디자인프로젝트 (Capstone Design Project in Life Science): 연구 중심 프로젝트 수행 연구 분야 생명과학부는 의생명과학, 유전공학, 생물환경공학, 바이오의약, 생태보존 및 식물생명공학 등 다양한 산업 및 연구 분야에서 최신 기술을 탐구하고 혁신적인 연구를 수행합니다.  의생명과학 및 질병 연구  암, 감염병, 신경질환 등 주요 질병 기작 연구 백신 및 바이오의약품 개발 줄기세포 및 조직공학을 활용한 재생의학 연구 생명정보학 및 유전체 연구  인간 유전체 분석 및 유전자 치료 연구 단백질 상호작용 및 대사 네트워크 연구 AI 및 빅데이터 기반 바이오 정보 분석 식물 및 농업 생명공학 연구  유전자 변형 작물 개발 및 기능 연구 기후변화 대응 식물 생명공학 연구 농작물 생리 및 유전자 조절 연구 환경 생명과학 및 지속가능성 연구  생물정화 및 환경오염 복원 연구 바이오매스를 이용한 친환경 에너지 연구 미생물 기반 지속 가능한 산업 기술 개발 졸업 후 진로 생명과학부 졸업생들은 제약·바이오산업, 연구개발, 공공기관, 환경생명공학, 식품 및 농업생명과학 등 다양한 분야에서 전문가로 활동할 수 있습니다.  바이오제약 및 신약개발 산업  제약 및 바이오 기업 (삼성바이오로직스, 셀트리온, 한미약품 등) 유전자 치료 및 백신 개발 연구소 바이오의약품 연구 및 개발 환경 생명공학 및 지속 가능한 기술 연구  환경 정화 및 생물복원 기술 연구 수질 및 대기 환경 관련 연구소 바이오매스를 활용한 친환경 에너지 개발 식품 및 농업 생명공학 분야  기능성 식품 및 건강보조제 개발 농업 생명공학 및 유전자 변형 작물 연구 발효식품 및 미생물 활용 식품 개발 연구 및 학술 분야  국내외 대학원 진학 및 연구소 연구원 생명과학 및 생명공학 연구기관 바이오 및 환경 관련 공공 연구기관 학과의 비전 생명과학부는 생명과학 및 생명공학을 기반으로 미래 산업을 선도할 글로벌 인재를 양성하고, 생명과학의 원리를 활용하여 인류의 건강과 환경 문제 해결에 기여하는 연구를 수행하는 것을 목표로 합니다.  의생명과학 및 신약개발 연구를 통한 질병 치료 기술 혁신 환경 생명공학을 활용한 지속 가능한 생태 복원 및 친환경 기술 개발 식량 문제 해결을 위한 농업 생명공학 및 유전자 변형 연구 AI 및 빅데이터를 활용한 바이오 정보 분석 연구 본 학부는 생명과학의 기본 원리부터 응용까지 폭넓은 교육을 제공하여, 글로벌 바이오산업 및 학계에서 경쟁력을 갖춘 전문 인재를 양성하며, 학생들이 다양한 연구 및 산업 분야에서 창의적이고 실용적인 역량을 발휘할 수 있도록 지원합니다."
    },
    {
        "department_id": 40,
        "학과": "생명자원융합학과",
        "학과설명": "생명자원융합학과는 생명과학과 농업자원을 융합하여 지속 가능한 생명자원 활용 기술을 연구하고 실무 중심의 교육을 제공하는 학문입니다. 현대 사회에서 생명자원의 가치와 역할이 점점 더 중요해짐에 따라, 바이오산업, 농업생명공학, 환경복원, 치유농업, 동물매개치유 등의 다양한 분야에서 과학적 접근과 기술 개발을 통해 생산성과 부가가치를 극대화하는 전문가를 양성합니다.  특히, 본 학과는 치유정원, 치유농업, 원예치유 및 동물매개치유 등 자연 기반 치유 기술을 연구하며, 스마트팜, 친환경 농업, 바이오소재 개발, 생명자원 가공 등의 최신 기술을 접목한 융합적 학문 교육을 제공합니다. 조경기사, 화훼장식기사, 식물보호기사 등의 국가 자격증 취득을 지원하며, 야간 및 주말 강의를 운영하여 직장인과 재직자도 학업을 병행할 수 있도록 교육과정을 구성하고 있습니다.  졸업생들은 생명자원 관련 산업체, 조경 및 환경 복원 연구소, 치유농업 기관, 동물매개치료센터, 농업 및 바이오 관련 기업 등 다양한 분야에서 핵심 전문가로 활동할 수 있습니다.  생명자원융합학과의 비전 및 목표 생명자원융합학과는 지속 가능한 생명자원 기술을 연구하고, 산업 현장에서 실무 중심의 융합 교육을 통해 글로벌 바이오 및 생명자원 산업을 선도할 인재를 양성하는 것을 목표로 합니다.  1. 실무 중심 교육 강화 및 산업 연계 산업체 연계 실습 및 현장 교육 확대 실험 및 프로젝트 기반 학습(Problem-Based Learning) 적용 스마트팜, 치유농업, 바이오소재 개발 관련 실무 과정 운영 2. 생명자원 활용 기술 및 치유농업 특화 교육 치유정원, 치유농업, 원예치유 및 동물매개치유 연구 식물 및 동물 기반 치유 프로그램 개발 및 실습 적용 정원 설계를 통한 치유 공간 구축 연구 및 실무 적용 3. 자격증 취득 지원 및 취업 연계 교육 조경기사, 화훼장식기사, 식물보호기사 취득 지원 생명자원 산업체 맞춤형 실무 교육 제공 정부 및 공공기관 연계 인턴십 및 취업 프로그램 운영 4. 재직자 및 특성화고 졸업생을 위한 맞춤형 교육 야간 및 주말 강의 운영으로 직장인 및 재직자의 학업 병행 지원 성인 학습자를 위한 맞춤형 커리큘럼 제공 맞춤형 심화 교육을 통한 전문성 강화 교육과정 1~2학년: 생명자원 기초 및 핵심 이론 학습 생명자원과학 개론: 생명자원의 기본 개념과 활용 원예 및 조경학: 원예 및 조경 기초 기술 학습 식물생리학: 식물의 생리적 기능과 생장 메커니즘 연구 농업생명공학: 생명공학 기술을 활용한 농업 응용 환경생태학: 생물다양성과 생태계 보호 기술 연구 3학년: 융합 기술 및 치유자원 연구 치유정원 및 조경설계: 치유정원 조성 및 설계 기술 학습 치유농업 및 원예치유: 원예 및 치유농업 이론과 실습 적용 동물매개치유: 반려동물 및 동물매개치유의 심리적 효과 연구 농업생태 및 환경복원: 지속 가능한 농업과 생태 복원 기술 연구 스마트팜 및 바이오소재 연구: 생명자원의 데이터 분석 및 활용 기술 학습 4학년: 실무 중심의 심화 과정 산업체 실습 및 프로젝트: 현장 실습 및 기업 연계 프로젝트 수행 스마트팜 및 생명자원 빅데이터 분석: 정밀농업 및 데이터 기반 연구 기후변화와 지속가능 농업: 기후변화 대응 및 지속 가능한 농업 기술 연구 캡스톤 디자인 및 연구 프로젝트: 실무 중심 연구 프로젝트 수행 및 발표 연구 분야 1. 생명자원 및 농업자원 연구 지속 가능한 농업 및 스마트팜 기술 개발 농업 생명공학을 활용한 기능성 작물 연구 생명자원의 산업적 활용 및 가공 기술 연구 2. 치유농업 및 원예치유 연구 치유농업 프로그램 개발 및 심리적 효과 연구 원예치유를 활용한 정신 건강 및 복지 연구 정원 설계를 통한 치유 공간 구축 및 환경 연구 3. 동물매개치유 연구 반려동물을 활용한 정신 건강 증진 연구 동물매개치유의 정서적·생리적 효과 분석 반려동물 및 축산동물의 복지 및 행동 연구 4. 환경복원 및 지속가능한 생명자원 연구 생태계 복원 및 환경 재생 기술 개발 기후변화 대응 및 지속 가능한 생명자원 관리 친환경 바이오 기술 및 생태농업 연구 졸업 후 진로 1. 생명자원 및 농업 관련 산업 스마트팜 및 생명자원 관련 기업 농업 기술 및 바이오벤처 스타트업 창업 기능성 작물 및 농산물 가공 산업 연구원 2. 치유농업 및 원예치유 분야 치유농업 연구기관 및 치료센터 사회복지시설 및 치유농업 프로그램 운영 전문가 병원 및 요양시설의 치유정원 설계 및 관리 전문가 3. 조경 및 환경복원 산업 조경 및 환경설계 회사 (공공기관 및 민간 조경기업) 생태계 복원 및 환경 재생 기술 연구소 국립공원공단, 산림청 등 환경 및 산림 복원 관련 공공기관 4. 동물매개치유 및 반려동물 산업 동물매개치료 및 반려동물 행동 연구소 반려동물 관련 산업 (사료 개발, 동물복지 컨설팅 등) 동물 복지 및 치료 관련 NGO 및 연구기관 5. 연구 및 공공기관 국립농업과학원, 국립산림과학원 등 연구소 연구원 농촌진흥청 및 환경 관련 공공기관 공무원 국립 및 사립 연구소에서 생명자원 연구 전문가 학과의 역할과 목표 생명자원융합학과는 바이오 및 생명자원 기술을 연구하고, 실무 중심의 교육을 통해 지속 가능한 미래 농업과 생명과학을 선도하는 전문가를 양성합니다.  치유농업, 원예치유, 동물매개치유를 통한 건강 및 복지 향상 연구 스마트팜, 기능성 작물, 환경 복원 기술 개발을 통한 지속가능한 미래 농업 연구 산업체 맞춤형 실무 교육을 통해 취업 및 창업 연계 지원 생명자원융합학과는 지속 가능한 미래를 이끌어 갈 융합형 전문가를 양성하는 데 앞장서겠습니다."
    },
    {
        "department_id": 41,
        "학과": "생물산업기계공학과",
        "학과설명": "생물산업기계공학과는 농업, 임업, 축산업, 수산업 등 생물산업 분야에서 생산성과 효율성을 극대화하기 위해 공학적 기술을 적용하는 학문입니다. 본 학과는 기계공학, 전기·전자공학, 컴퓨터 공학, 로봇공학 등의 기술을 융합하여 스마트 농업, 자동화 기계, 정밀농업, 생물자원 활용 기술을 연구하고 개발하는 것을 목표로 합니다.  특히, 농업기계 자동화, 로봇기술, 드론 및 IoT 기반 스마트팜, 바이오에너지 및 지속 가능한 생물산업 기술 등을 연구하여 미래 농업과 식품 산업을 혁신하고, 지속 가능한 생명과학 공학을 실현하는 데 주력합니다.  학생들은 농업기계 설계 및 제작, 자동화 및 로봇 시스템 개발, 정밀농업 기술, 스마트팜 및 데이터 분석, 생물자원 가공 및 에너지 기술 등의 분야에서 공학적 해결책을 제시하는 첨단 농업기술 전문가로 성장할 수 있습니다.  교육과정 1. 기초 공학 및 필수 과목 기계공학개론: 기계공학의 기본 원리 및 농업기계 적용 전기전자공학: 센서, 제어시스템, 전자회로 활용 컴퓨터프로그래밍: 파이썬, C++ 등을 활용한 자동화 시스템 설계 공학수학: 기계 및 시스템 분석을 위한 수학적 모델링 열역학 및 유체역학: 농업 에너지 변환 및 유체 흐름 원리 연구 2. 농업기계 및 자동화 기술 농업기계학: 농업용 트랙터, 경운기, 수확기 등 농업기계 설계 및 유지보수 스마트 농업 및 정밀농업: GPS 및 드론을 활용한 정밀 농업 기술 농업용 로봇공학: 무인 로봇 및 자동화 기계 개발 농업기계 설계 및 제작: CAD/CAM을 활용한 농업기계 설계 및 가공 실습 에너지 및 동력학: 농업용 엔진, 전기동력 시스템 연구 3. 생물산업 자동화 및 스마트 팜 스마트 팜 기술: IoT 기반 정밀농업 및 자동화 온실 시스템 개발 농업용 센서 및 데이터 분석: 농업 환경 데이터 수집 및 분석 연구 제어시스템 및 자동화: PLC 및 마이크로컨트롤러를 활용한 자동화 기술 드론 및 무인 농기계: 자율주행 농기계 및 드론 기술 연구 4. 식품 가공 및 환경 공학 식품공학개론: 식품 가공, 저장, 보존 기술 연구 바이오매스 및 신재생에너지: 생물자원을 활용한 지속 가능한 에너지 개발 환경 및 지속가능한 농업기술: 친환경 농업 및 자원 재활용 기술 연구 포장 및 물류공학: 생물산업 제품의 효율적 유통 및 보관 시스템 연구 5. 실험 및 연구 중심 교육 기계설계 및 실습: 농업기계 설계 및 제조 실습 자동화 및 로봇 실험: 자동화 기계 및 로봇 설계·제작 실습 스마트 농업 시스템 실험: IoT 기반 스마트팜 기술 적용 실습 캡스톤디자인 프로젝트: 연구 중심 프로젝트 수행 및 실무 적용 연구 분야 1. 스마트 농업 및 정밀농업 연구 GPS 및 AI 기반 정밀농업 기술 개발 스마트팜 및 IoT 데이터 분석 시스템 연구 드론을 활용한 작물 모니터링 및 자동 방제 기술 연구 2. 농업기계 및 자동화 기술 연구 농업용 로봇 및 무인 시스템 개발 자동 수확 및 자율주행 농기계 연구 데이터 기반 농업 생산 최적화 연구 3. 식품 가공 및 생물자원 활용 연구 자동화 식품 가공 기술 연구 및 개발 생물자원을 활용한 친환경 바이오 소재 개발 식품 품질 관리 및 안전성 평가 연구 4. 바이오매스 및 친환경 에너지 연구 농업 폐기물을 활용한 신재생에너지 개발 지속가능한 농업을 위한 친환경 기술 연구 생물산업 환경 영향 저감 기술 연구 졸업 후 진로 1. 농업기계 및 자동화 산업 농업기계 설계 및 제조 엔지니어 스마트 농업 및 정밀농업 기술 개발자 농업용 로봇 및 무인 시스템 개발자 2. 스마트 팜 및 정밀농업 분야 IoT 기반 농업 데이터 분석 및 최적화 전문가 드론 및 AI 활용 농업 기술 개발자 스마트 팜 및 자동화 시스템 엔지니어 3. 식품 및 생명공학 산업 식품 가공 및 품질 관리 전문가 자동화 식품 생산 시스템 개발자 생물자원을 활용한 친환경 소재 연구자 4. 환경 및 에너지 산업 바이오매스를 활용한 친환경 에너지 개발 전문가 농업 환경 보호 및 지속 가능한 기술 연구자 수질 및 토양 오염 방지 기술 개발자 5. 연구 및 공공기관 진출 농업기계 연구소 및 정부기관 연구직 (농업진흥청, 국립농업과학원 등) 대학 및 연구기관에서의 농업 기계 및 환경 기술 연구 농업 정책 및 기술 보급 관련 공공기관 및 국제기구 (FAO, UN 등) 학과의 비전 생물산업기계공학과는 미래 농업 및 생물산업의 지속 가능성과 생산성을 높이기 위해 첨단 기술을 개발하고 연구하는 글로벌 인재를 양성하는 것을 목표로 합니다.  1. 스마트 농업 및 정밀농업을 위한 첨단 기술 개발 IoT 기반 스마트 팜 시스템 연구 및 개발 AI 및 빅데이터 활용 정밀농업 연구 2. 자동화 및 로봇 공학을 활용한 농업 생산성 향상 농업용 로봇 및 자율주행 농기계 연구 드론 및 자동화 기술을 활용한 농업 혁신 연구 3. 바이오에너지 및 친환경 농업 기술 연구 강화 농업 폐기물을 활용한 신재생에너지 개발 친환경 농업 및 지속 가능한 기술 연구 4. 생물자원 활용을 통한 지속 가능한 산업 개발 식품 및 생물자원 가공 자동화 연구 지속가능한 바이오산업을 위한 환경 친화적 기술 개발 본 학과는 4차 산업혁명 시대에 맞는 혁신적인 생물산업 공학 전문가를 양성하며, 농업과 생명과학 기술의 발전을 선도합니다."
    },
    {
        "department_id": 42,
        "학과": "생물환경화학과",
        "학과설명": "생물환경화학과는 농업생명과학의 한 분야로, 생명현상의 기본적 이해를 바탕으로 생물을 둘러싼 환경 문제를 생물학적·화학적 지식을 통해 통합적으로 해결하는 학문입니다. 이를 통해 농업 생산성과 가치를 높이고, 지속 가능한 농업 및 생물산업 발전에 기여할 전문 인재를 양성하는 것을 목표로 합니다.  학생들은 환경학, 생물유기화학, 미생물학, 농업유전공학, 농업환경화학 등 다양한 교과목을 통해 이론과 실습을 병행하며, 국가 전문자격증 취득을 지원받을 수 있습니다. 이를 바탕으로, 졸업생들은 농업 연구기관, 환경관리 기관, 농약 및 생물소재 기업, 교육 및 연구기관 등 다양한 분야로 진출하고 있습니다.  학과 비전 생물환경화학과는 생물과 환경, 화학의 융합적 연구를 통해 지속 가능한 농업 및 생명과학 산업을 선도할 전문가를 양성하는 것을 목표로 합니다.  1. 지속 가능한 농업 및 환경 관리 연구 생태 친화적 농업 기술 개발 지속 가능한 식량 생산 및 농업환경 관리 연구 2. 생물 및 화학 기반의 농업 혁신 기술 개발 유기농업 및 친환경 비료·농약 연구 생물농약 및 생물제제 개발을 통한 병해충 방제 연구 3. 실무 중심의 교육 및 자격증 취득 지원 식물보호기사, 종자기사, 토양환경기사, 유기농업기사, 환경기사, 중등학교 2급 정교사 등의 자격증 취득 지원 산업체 및 연구소 연계를 통한 현장 실습 및 인턴십 강화 4. 융합적 연구를 통한 글로벌 경쟁력 확보 생물환경과학 및 농업화학의 융합적 연구 지속 가능한 농업과 생물산업 발전을 위한 글로벌 협력 연구 추진 교육과정 생물환경화학과의 교육과정은 생명과학, 환경과학, 농업화학 등의 기초부터 응용 연구까지 체계적으로 학습할 수 있도록 구성되어 있습니다.  1~2학년: 기초 및 핵심 이론 학습 환경학개론 (Introduction to Environmental Science) 환경과 생물의 상호작용 개념 이해 생물유기화학 (Biological Organic Chemistry) 생명체 내 화학 반응 및 유기화학 기초 연구 미생물학 (Microbiology) 미생물의 구조, 기능 및 환경 내 역할 학습 농업유전공학 (Agricultural Genetic Engineering) 유전자 조작 및 분자유전학을 활용한 농업 연구 3학년: 융합 기술 및 응용 연구 농업환경화학 (Agricultural Environmental Chemistry) 농업 환경 내 화학적 변화 및 토양 화학 연구 생물농약 및 생물제제 연구 (Biopesticides & Bioformulations) 친환경 농약 및 생물제제 개발 연구 유기농업 및 친환경 농업기술 (Organic & Sustainable Agriculture) 친환경 농업 기술 및 지속 가능한 농업 연구 환경 독성학 (Environmental Toxicology) 환경 오염물질 및 독성 물질의 영향 연구 4학년: 실무 중심의 심화 과정 산업체 실습 및 연구 프로젝트 (Industry Internship & Research Project) 기업 및 연구소 실무 경험 제공 토양환경 및 농업생태계 복원 (Soil Environment & Agricultural Ecosystem Restoration) 토양 보전 및 농업 생태계 복원 연구 기후변화 대응 농업 기술 (Climate Change & Agricultural Technology) 기후변화 적응 농업 기술 연구 캡스톤 디자인 및 연구 프로젝트 (Capstone Design & Research Project) 실무 프로젝트 수행 및 연구 발표 연구 분야 생물환경화학과는 생명과학과 환경과학, 농업화학을 융합하여 지속 가능한 농업과 생태계를 연구하는 다양한 프로젝트를 수행합니다.  1. 생물자원 및 농업환경 연구 농업 생태계 내 생물자원의 활용 기술 연구 지속 가능한 농업 및 스마트 농업 기술 개발 농업 유전학 및 기능성 식물 연구 2. 생물농약 및 친환경 비료 개발 친환경 농약 및 생물제제 개발 연구 생물자원을 활용한 지속 가능한 농업 화학 연구 3. 환경보전 및 지속가능한 자원 관리 환경 독성 및 오염물질 제거 기술 연구 지속 가능한 유기농업 및 친환경 농업 연구 4. 식물보호 및 병해충 방제 연구 기후변화에 대응한 식물 보호 기술 연구 생물학적 방제를 활용한 병해충 관리 연구 졸업 후 진로 생물환경화학과 졸업생들은 농업 연구기관, 환경관리 기관, 농약 및 생물소재 기업, 교육 및 연구기관 등 다양한 분야에서 전문가로 활동할 수 있습니다.  1. 연구 및 공공기관 농촌진흥청, 국립농업과학원, 국립환경과학원 등 연구기관 도 농업기술원, 시·군 농업기술센터 연구원 환경부 및 농업 관련 공공기관 공무원 2. 농약 및 생물소재 산업 농약회사 및 생물제제 연구소 비료회사 및 농업생명공학 관련 기업 친환경 유기농업 및 농업 컨설팅 회사 3. 환경 및 생태계 관리 분야 환경 관리 및 환경복원 연구소 기후변화 대응 및 지속 가능한 농업 연구소 토양환경 및 수질 관리 관련 기업 및 공공기관 4. 교육 및 학술 분야 대학원 진학 후 연구 및 강의 중등학교 2급 정교사 자격 취득 후 교사로 활동 농업기술 및 환경 교육 관련 기관 강사 학과의 역할과 목표 생물환경화학과는 생명과학과 환경과학, 농업화학을 융합하여 지속 가능한 농업 및 생명자원 관리를 연구하고, 산업 현장에서 즉시 적용할 수 있는 실무형 전문가를 양성하는 것을 목표로 합니다.  친환경 농업 및 지속 가능한 농업화학 연구 활성화 기후변화 대응 및 농업 환경 보호 연구 강화 스마트팜 및 생물농약 개발을 통한 농업 생산성 향상 국제 협력 및 글로벌 경쟁력을 갖춘 바이오 전문가 양성 생물환경화학과는 미래 농업과 환경 문제 해결을 위한 창의적이고 실용적인 연구를 수행하며, 지속 가능한 농업과 생명과학 분야에서 국제적 경쟁력을 갖춘 전문가를 양성하는 것을 목표로 합니다."
    },
    {
        "department_id": 103,
        "학과": "생태조경디자인학과",
        "학과설명": "생태조경디자인학과는 자연 생태계를 기반으로 조경을 설계하고 조성하는 학문으로, 생태적 가치와 경관미를 반영한 지속 가능한 조경 디자인을 연구합니다. 생태환경의 원리를 조경 설계에 적용하여 자연과 인간이 조화롭게 공존할 수 있는 공간을 창출하며, 기후변화와 환경 훼손 문제를 해결하는 친환경 조경 기술과 생태복원 기법을 개발하는 데 초점을 맞추고 있습니다.  학생들은 생태조경계획, 생태조경설계, 생태환경디자인, 생태조경시공관리 등의 전문 지식을 습득하며, 다양한 환경에서 자연 친화적인 조경 공간을 조성하고 관리하는 방법을 연구합니다.  교육과정 1. 기초 이론 및 생태 조경 개론 생태학 개론: 생태계의 구조와 기능, 생물과 환경의 상호작용 연구 조경학 개론: 조경 설계의 원리 및 역사적 배경 이해 도시생태학: 도시 환경 내 생태 시스템 분석 및 조경 적용 환경복원론: 훼손된 생태계를 복원하기 위한 이론 및 기법 연구 지속가능한 환경디자인: 친환경적 공간 설계를 위한 기후변화 대응 방안 연구 2. 생태조경 계획 및 설계 생태조경계획: 생태적 요소를 고려한 조경 공간 계획 기법 연구 공원 및 녹지 계획: 생태적 원리에 기반한 도시 공원 및 녹지 조성 전략 환경디자인 및 경관계획: 경관의 생태적 가치와 미적 요소를 결합한 조경 설계 생태하천 및 수변공간 설계: 생태적 복원력을 고려한 하천 및 수변 공간 조성 기술 국토이용계획: 생태적 지속가능성을 고려한 토지 이용 및 조경 계획 3. 생태조경 시공 및 관리 조경재료학: 친환경 조경 재료 및 지속 가능한 시공 기법 연구 조경시공 및 관리: 생태조경 설계의 실무적 시공 및 유지 관리 방법 식물 및 녹지 관리: 생태조경에서 활용되는 식물의 기능과 유지 관리 기법 연구 스마트 조경 및 환경기술: 생태적 조경 설계에 적용되는 첨단 기술 연구 4. 생태조경 디자인 실습 및 응용 조경CAD 및 GIS 활용: 생태조경 설계 및 분석을 위한 디지털 도구 활용 조경멀티미디어: 생태공간의 시각적 표현 및 설계 기법 연구 캡스톤디자인 프로젝트: 생태조경 설계를 실제 환경에 적용하는 프로젝트 수행 연구 분야 생태복원 및 환경재생 연구  생태하천 복원 및 수변공간 설계 훼손된 녹지 및 자연환경 복원 생물 서식처 보호 및 생태계 복원 자연친화적 조경 설계 연구  자연 지형과 생태계를 활용한 조경 디자인 지역 생태 특성을 반영한 조경 공간 설계 기후변화 대응을 위한 녹지 및 그린 인프라 조성 생태환경과 조경의 통합 관리 연구  도시 녹화 및 생태적 환경 개선 기술 개발 지속가능한 조경 유지 및 관리 기법 연구 생태적 가치를 고려한 경관 관리 및 복원 졸업 후 진로 생태조경디자인학과 졸업생들은 생태조경 설계, 생태 복원, 환경 디자인, 조경 시공 및 관리 등의 분야에서 전문가로 활동할 수 있습니다.  생태조경 설계 및 시공 분야  생태공원 및 자연형 정원 설계 전문가 생태조경 및 환경복원 설계사 공공기관 및 민간 기업의 생태조경 설계 및 시공 담당 환경복원 및 생태조경 연구 분야  생태하천 및 습지 복원 전문가 생물 서식처 및 생태계 복원 연구원 국립공원, 자연보호구역 조성 및 관리 전문가 도시 및 국토 생태조경 분야  친환경 도시 및 녹지 공간 기획 전문가 생태조경 중심의 국토이용 및 환경정책 연구원 공공 환경디자인 및 경관 조성 담당 학과의 비전 생태조경디자인학과는 자연과 인간이 조화롭게 공존하는 환경을 조성하기 위해 생태적 원리를 기반으로 한 조경 설계 및 복원 기술을 연구하며, 지속 가능한 환경 조성을 위한 생태조경 전문가를 양성합니다.  기후변화 대응을 고려한 생태조경 기술 개발 생태적 가치와 미적 요소를 반영한 지속 가능한 조경 설계 훼손된 환경을 복원하고 자연 친화적인 조경 공간 조성 생물 다양성 보전 및 생태적 균형을 고려한 경관 관리 본 학과는 자연환경의 지속가능성을 높이고, 생태적 조경을 통한 친환경 공간 조성 및 환경 복원 기술 발전을 선도합니다."
    },
    {
        "department_id": 15,
        "학과": "소프트웨어공학과",
        "학과설명": "소프트웨어공학과는 소프트웨어의 개발, 운용, 유지보수에 체계적이고 정량화된 접근법을 적용하여 전문 엔지니어를 양성하는 학문입니다. 컴퓨터과학 지식을 기반으로 애플리케이션 소프트웨어와 임베디드 소프트웨어 관련 교육과정을 운영하며, 소프트웨어 프로젝트의 대형화, 복잡화, 다양화에 따른 문제를 해결할 수 있는 전문 소프트웨어공학자를 목표로 합니다.  학생들은 소프트웨어공학개론, 자료구조, JAVA 프로그래밍, 리눅스 시스템 등 다양한 전공과목을 통해 이론과 실습을 병행하며, 졸업 후에는 소프트웨어 개발, 유지보수, 품질 관리 등 다양한 분야에서 활약할 수 있습니다.  학과 비전 소프트웨어공학과는 소프트웨어의 설계, 개발, 검증 및 유지보수를 위한 체계적인 기법을 연구하고, 이를 통해 산업과 사회의 요구를 충족하는 창의적이고 실무 중심의 소프트웨어 엔지니어를 양성하는 것을 목표로 합니다.  1. 소프트웨어 개발 및 엔지니어링 역량 강화 객체지향 프로그래밍 및 알고리즘 설계 능력 배양 대규모 소프트웨어 개발 및 유지보수 실무 교육 2. 최신 기술 및 트렌드 반영 클라우드, AI, 빅데이터, 블록체인 등 최신 IT 기술 반영 DevOps, CI/CD, 애자일 개발 등 현대적인 개발 방법론 교육 3. 실무 중심의 프로젝트 및 인턴십 기회 제공 기업 협력 프로젝트 및 산학 협력 프로그램 운영 캡스톤 디자인 및 해커톤 참여를 통한 실무 경험 제공 4. 국제적 경쟁력을 갖춘 글로벌 소프트웨어 인재 양성 글로벌 IT 트렌드 학습 및 영어 기반 기술 문서 작성 교육 국제 소프트웨어 인증 및 글로벌 IT 기업 취업 지원 교육과정 소프트웨어공학과의 교육과정은 소프트웨어 개발과 유지보수를 위한 핵심 개념을 학습하고, 최신 기술을 실무에 적용할 수 있도록 설계되어 있습니다.  1~2학년: 기초 및 핵심 이론 학습 소프트웨어공학개론 (Introduction to Software Engineering) 소프트웨어 개발 프로세스 및 품질 관리 개념 이해 자료구조 및 알고리즘 (Data Structures & Algorithms) 효율적인 알고리즘 설계 및 구현 프로그래밍 기초 및 JAVA 프로그래밍 (Introduction to Programming & Java Programming) 프로그래밍의 기초 및 객체지향 개념 학습 리눅스 시스템 및 운영체제 (Linux System & Operating Systems) 시스템 프로그래밍 및 운영체제 개념 학습 3학년: 응용 기술 및 프로젝트 기반 학습 데이터베이스 시스템 (Database Systems) 관계형 데이터베이스 및 SQL 활용 웹 프로그래밍 및 프론트엔드 개발 (Web Programming & Frontend Development) HTML, CSS, JavaScript 및 React, Vue.js 학습 백엔드 개발 및 서버 프로그래밍 (Backend Development & Server Programming) Node.js, Django, Spring Framework 활용 소프트웨어 테스트 및 품질 보증 (Software Testing & Quality Assurance) 소프트웨어 결함 분석 및 품질 향상 방법론 4학년: 실무 프로젝트 및 최신 기술 학습 캡스톤 디자인 및 프로젝트 개발 (Capstone Design & Software Project Development) 팀 프로젝트를 통한 실전 소프트웨어 개발 경험 AI 및 머신러닝 응용 (Artificial Intelligence & Machine Learning Applications) TensorFlow, PyTorch를 활용한 AI 모델 개발 클라우드 컴퓨팅 및 DevOps (Cloud Computing & DevOps) AWS, Azure, GCP 활용 및 CI/CD 자동화 사이버보안 및 블록체인 기술 (Cybersecurity & Blockchain Technology) 보안 취약점 분석 및 블록체인 개발 연구 분야 소프트웨어공학과는 소프트웨어 개발, 품질 관리, 인공지능, 데이터 분석 등 다양한 연구를 수행하며, 최신 IT 기술과 실무를 접목한 연구를 진행합니다.  1. 소프트웨어 개발 및 유지보수 연구 소프트웨어 개발 방법론 (애자일, DevOps) 연구 대규모 시스템의 소프트웨어 아키텍처 및 설계 연구 2. 인공지능 및 데이터 분석 연구 딥러닝 및 머신러닝 모델 개발 빅데이터 분석 및 데이터 시각화 연구 3. 웹 및 모바일 애플리케이션 연구 반응형 웹 개발 및 사용자 경험(UX/UI) 디자인 연구 모바일 앱 개발 및 크로스플랫폼 개발 연구 4. 소프트웨어 보안 및 블록체인 연구 보안 취약점 분석 및 네트워크 보안 연구 블록체인 기반 스마트 계약 및 분산 원장 기술 연구 졸업 후 진로 소프트웨어공학과 졸업생들은 IT 산업 전반에서 소프트웨어 개발, 유지보수, 품질 관리, 데이터 분석, 인공지능, 보안 등 다양한 분야에서 전문가로 활동할 수 있습니다.  1. 소프트웨어 개발 및 엔지니어링 분야 프론트엔드 개발자 (Frontend Developer) 백엔드 개발자 (Backend Developer) 풀스택 개발자 (Full-Stack Developer) 모바일 앱 개발자 (iOS, Android Developer) 2. 인공지능 및 데이터 분석 분야 AI 엔지니어 및 데이터 사이언티스트 머신러닝 엔지니어 및 추천 시스템 개발자 3. 클라우드 및 DevOps 엔지니어링 분야 클라우드 아키텍트 및 DevOps 엔지니어 AWS, Azure, GCP 기반 시스템 엔지니어 4. 정보보안 및 네트워크 분야 보안 엔지니어 및 화이트 해커 네트워크 보안 분석가 및 시스템 보안 전문가 5. IT 컨설팅 및 스타트업 창업 IT 컨설턴트 및 솔루션 아키텍트 스타트업 창업 및 기술 리더 학과의 역할과 목표 소프트웨어공학과는 소프트웨어 개발 및 엔지니어링 역량을 강화하고, 최신 IT 기술을 실무에 적용할 수 있는 전문가를 양성하는 것을 목표로 합니다.  소프트웨어 개발 방법론 및 품질 관리 역량 강화 AI, 빅데이터, 클라우드 등 최신 IT 기술 반영한 교육 제공 실무 중심의 프로젝트 및 기업 연계 인턴십 제공 국제 IT 산업에서 경쟁력을 갖춘 글로벌 인재 양성 소프트웨어공학과는 미래 소프트웨어 산업을 선도할 창의적이고 실용적인 소프트웨어 엔지니어를 양성하며, 혁신적인 소프트웨어 기술 개발과 IT 산업 발전에 기여하는 전문가를 배출하는 것을 목표로 합니다."
    },
    {
        "department_id": 96,
        "학과": "수학과",
        "학과설명": "수학과는 수학의 기본 이론을 깊이 있게 이해하고, 사물의 구조와 관계를 밝히는 교육을 통해 전문 연구 인력을 양성하는 것을 목표로 합니다.  수학은 자연과학, 공학, 경제학, 데이터 과학 등 다양한 분야에서 활용되는 핵심 학문으로, 본 학과에서는 추상의 과정을 통해 본질적이고 공통적인 특징을 추출하여 현대사회의 복잡한 문제를 해결할 수 있는 능력을 배양합니다.  수학적 전문 지식을 기반으로 수학 연구 및 응용 분야에서 활약할 인재를 양성하며, 논리적이고 창의적인 사고력을 바탕으로 교육, 금융, 산업, IT 및 연구 기관 등 다양한 직업군에서 사회에 기여할 수 있도록 교육합니다.  교육과정 수학과의 교육과정은 대수학, 해석학, 기하학, 확률 및 통계, 응용수학 등 다양한 전공 과목을 포함하여 이론과 실습을 병행하며, 논리적 사고력과 문제 해결 능력을 배양할 수 있도록 구성되어 있습니다.  1. 기초 수학 과정 미적분학 (Calculus I, II): 함수의 극한, 미분 및 적분 개념 학습 선형대수학 (Linear Algebra I, II): 행렬, 벡터공간, 고유값 및 고유벡터 연구 이산수학 (Discrete Mathematics): 그래프 이론, 논리 연산 및 조합론 기초 학습 수학적 논리 및 증명 (Mathematical Logic & Proofs): 논리학 및 수학적 증명 기법 학습 2. 핵심 수학 전공 과정 대수학 (Algebra I, II): 군론, 환론, 체론 연구 해석학 (Real Analysis I, II): 함수의 연속성, 미분 및 적분의 엄밀한 정의 연구 복소해석학 (Complex Analysis): 복소함수 이론 및 응용 연구 위상수학 (Topology): 위상 공간 및 연속 함수의 성질 연구 기하학 (Geometry): 유클리드 및 비유클리드 기하학 연구 3. 확률, 통계 및 응용수학 과정 확률 및 통계학 (Probability & Statistics): 확률론 및 통계 분석 방법 학습 편미분방정식 (Partial Differential Equations): 물리 및 공학적 모델링 연구 수치해석학 (Numerical Analysis): 수학적 문제의 컴퓨터 기반 수치 해법 연구 응용수학 (Applied Mathematics): 물리학, 공학, 생명과학, 경제학 등에서의 수학적 모델링 연구 데이터 과학 및 머신러닝 (Data Science & Machine Learning): AI 및 빅데이터 분석을 위한 수학적 기초 학습 4. 연구 및 실무 과정 수학 연구 세미나 (Mathematics Research Seminar): 최신 수학 연구 동향 학습 및 발표 수리금융 및 경제수학 (Mathematical Finance & Economics): 금융 공학 및 수리 모델링 연구 암호학 및 정보보안 (Cryptography & Information Security): 암호 이론 및 보안 기술 연구 캡스톤디자인 프로젝트 (Capstone Design in Mathematics): 실무 중심 프로젝트 수행 연구 분야 수학과는 순수수학과 응용수학을 아우르는 다양한 연구 분야에서 이론 연구 및 실질적인 응용 연구를 수행하고 있습니다.  대수학 및 정수론 연구  군론, 환론 및 체론 연구 수론 및 암호학 응용 연구 암호화 알고리즘 및 블록체인 기술 연구 해석학 및 편미분방정식 연구  실해석학 및 함수 공간 연구 편미분방정식 및 수치해석 연구 물리학 및 공학에서의 응용 수학 연구 확률 및 통계 연구  확률 과정 및 통계 모델 연구 머신러닝 및 AI 기반 데이터 분석 연구 금융공학 및 위험관리 모델 연구 기하학 및 위상수학 연구  리만 기하학 및 미분기하 연구 위상수학 및 수학적 물리학 연구 컴퓨터 그래픽 및 기하 모델링 연구 응용수학 및 산업수학 연구  금융 및 경제 수학 모델 연구 생물수학 및 의료 데이터 분석 연구 데이터 사이언스 및 AI 알고리즘 연구 졸업 후 진로 수학과 졸업생들은 교육, 금융, IT, 데이터 분석, 연구 및 산업 응용 분야 등 다양한 분야에서 전문가로 활동할 수 있습니다.  교육 및 연구 분야  중·고등학교 수학 교사 대학원 진학 후 수학 연구 및 교수직 수학 및 컴퓨터 과학 연구소 연구원 금융 및 보험 산업  금융공학 및 리스크 분석 전문가 은행 및 투자사 금융 모델링 연구원 보험계리사 및 재무 분석가 IT 및 데이터 분석 산업  데이터 사이언티스트 및 머신러닝 엔지니어 AI 및 빅데이터 분석 전문가 블록체인 및 암호 보안 전문가 공학 및 응용수학 분야  항공 및 기계 산업의 수학적 모델링 전문가 바이오 및 의료 데이터 분석 연구원 수리 물리학 및 과학 컴퓨팅 전문가 정부 및 공공기관  국방 및 정보 보안 연구 기관 (국방과학연구소, 암호연구소 등) 통계청, 한국은행 및 경제연구소 연구원 기상청 및 환경 데이터 분석 연구원 학과의 비전 수학과는 기본 이론을 바탕으로 논리적 사고력을 배양하고, 현대 사회의 다양한 문제를 해결할 수 있는 창의적이고 실용적인 수학 전문가를 양성하는 것을 목표로 합니다.  수학 이론 연구 및 첨단 기술 응용을 통한 문제 해결 능력 배양 데이터 과학, 금융, AI, 블록체인 등 현대 산업과 연계한 수학 응용 연구 국내외 연구기관 및 산업과 협력하여 수학적 모델링 및 시뮬레이션 연구 강화 교육 및 연구 역량 강화를 통해 미래 수학 교육 및 연구 발전에 기여 본 학과는 논리적 사고와 문제 해결 능력을 기반으로, 현대 사회의 다양한 분야에서 핵심적인 역할을 수행할 수 있는 글로벌 수학 전문가를 양성하며, 학생들이 다양한 연구 및 산업 분야에서 창의적이고 실용적인 역량을 발휘할 수 있도록 지원합니다."
    },
    {
        "department_id": 49,
        "학과": "스마트팜학과",
        "학과설명": "스마트팜학과는 국내 최초로 스마트팜을 전공하는 학과로, 미래 농업과 ICT(정보통신기술), 사물인터넷(IoT), 빅데이터, AI(인공지능) 기술이 융합된 스마트팜을 연구·교육하는 학문입니다. 본 학과는 스마트빌리지, W-E-F(물-에너지-식량) 넥서스, 빅데이터 분석 등 미래 농업을 위한 필수 기술을 제공하며, 지속 가능한 농업 혁신과 스마트 농업 생태계를 구축할 수 있는 전문가 양성을 목표로 합니다.  학생들은 스마트팜 구축 및 운영, 정밀농업, 데이터 기반 농업 분석, 농업 자동화 시스템, 환경제어, 스마트 육종 등의 핵심 분야를 학습하며, 미래 농업과 4차 산업혁명을 연결하는 융합형 인재로 성장할 수 있습니다.  학과 비전 스마트팜학과는 ICT 융합형 미래 농업을 연구하고, 스마트팜 기술을 실용화하여 지속 가능한 농업 발전을 선도할 전문 인력을 양성하는 것을 목표로 합니다.  1. 디지털 농업 및 스마트팜 전문 기술 역량 강화 빅데이터, AI, IoT 기반의 정밀농업 연구 스마트팜 자동화 및 원격 관리 기술 습득 2. 미래형 농업 시스템 구축 및 연구 W-E-F(물-에너지-식량) 넥서스 연구 환경 친화적 스마트 농업 시스템 개발 3. 실무 중심의 교육 및 현장 실습 강화 스마트팜 실습 농장 및 기업 연계 프로그램 운영 스마트팜 경영 및 유통 관련 현장 교육 4. 글로벌 경쟁력을 갖춘 스마트 농업 인재 양성 해외 스마트팜 기업 및 연구소와 협력 연구 국제 스마트 농업 기술 트렌드 반영 교육과정 스마트팜학과의 교육과정은 스마트 농업 기술과 데이터 과학, 생명과학, 환경 공학을 융합한 실무 중심의 학습 과정으로 구성되어 있습니다.  1~2학년: 기초 및 핵심 기술 학습 스마트팜 개론 (Introduction to Smart Farming) 스마트팜의 개념 및 적용 사례 학습 작물생산 및 생리학 (Crop Production & Physiology) 작물 생육 원리 및 환경 요인 연구 스마트팜을 위한 ICT 기술 (ICT Technologies for Smart Farming) 사물인터넷, 센서, 빅데이터의 농업 활용 데이터 기반 정밀농업 (Data-driven Precision Agriculture) 데이터 수집 및 분석을 통한 정밀농업 기법 3학년: 스마트팜 실무 및 응용 기술 학습 농업 자동화 및 로봇공학 (Agricultural Automation & Robotics) 로봇 기술을 활용한 스마트팜 시스템 구축 스마트팜 환경제어 공학 (Smart Farm Environmental Control Engineering) 온실, 수경재배, 스마트 온도 및 습도 조절 기술 스마트 육종 및 유전자 분석 (Smart Breeding & Genetic Analysis) 데이터 기반 육종 기술 및 유전자 편집 연구 스마트팜 에너지 시스템 (Smart Farm Energy Systems) 태양광, 수소에너지 등을 활용한 스마트팜 운영 4학년: 실무 프로젝트 및 창업 연구 캡스톤 디자인 및 프로젝트 (Capstone Design & Smart Farm Project) 실전 프로젝트를 통한 스마트팜 설계 및 운영 스마트팜 창업 및 경영 (Smart Farm Startups & Management) 농업 스타트업 및 스마트팜 사업화 전략 연구 W-E-F 넥서스 및 지속가능 농업 연구 (W-E-F Nexus & Sustainable Agriculture) 물-에너지-식량 연결 기술 연구 및 개발 스마트 농업 빅데이터 분석 (Smart Agriculture Big Data Analysis) AI 및 데이터 기반 농업 분석 및 의사 결정 연구 분야 스마트팜학과는 농업과 IT를 융합하여 지속 가능한 농업 혁신을 실현하고, 생산성 향상 및 자동화를 위한 다양한 연구를 수행합니다.  1. 디지털 농업 및 스마트팜 연구 IoT 및 빅데이터 기반 스마트팜 운영 클라우드 및 원격 제어 농업 시스템 개발 2. 정밀농업 및 환경제어 연구 작물 생육 최적화를 위한 AI 기반 데이터 분석 온실 및 스마트팜 환경 조절 기술 연구 3. 스마트 육종 및 바이오 농업 연구 유전자 분석 및 데이터 기반 스마트 육종 기술 개발 생물정보학을 활용한 작물 개량 연구 4. W-E-F 넥서스 및 지속 가능한 농업 연구 물-에너지-식량 융합형 스마트 농업 모델 개발 지속 가능한 자원 활용을 위한 친환경 농업 연구 졸업 후 진로 스마트팜학과 졸업생들은 스마트 농업 연구기관, 농업기술센터, 스마트팜 관련 기업, 데이터 기반 농업 컨설팅, 정밀농업 스타트업, 공공기관 및 연구소 등 다양한 분야에서 전문가로 활동할 수 있습니다.  1. 농업 연구소 및 공공기관 농촌진흥청 및 산하 연구원 농식품부 및 농업기술센터 공무원 한국식품연구원, 국립농업과학원 연구원 2. 스마트팜 관련 기업 및 산업체 스마트팜 솔루션 개발 기업 (농업 자동화, IoT, AI 활용) 농업 빅데이터 분석 및 컨설팅 기업 스마트팜 운영 및 시설 관리 전문가 3. 정밀농업 및 바이오 농업 기업 식물공장 및 스마트 농업 관련 기업 스마트 육종 및 유전자 개량 연구소 친환경 농업 및 W-E-F 넥서스 관련 기업 4. 스마트팜 창업 및 경영 컨설팅 스마트팜 스타트업 창업 정밀농업 컨설팅 및 스마트 농업 비즈니스 전문가 스마트팜 유통 및 공급망 관리 기업 5. 대학원 진학 및 학술 연구 스마트 농업, 환경공학, 데이터과학 관련 대학원 진학 스마트팜 기술 및 지속 가능한 농업 연구 학과의 역할과 목표 스마트팜학과는 미래 농업과 ICT 기술을 융합하여 지속 가능한 농업 혁신을 선도하는 전문가를 양성하는 것을 목표로 합니다.  AI, IoT, 빅데이터 기반 스마트팜 기술 개발 및 연구 스마트 농업 자동화 및 정밀농업 연구 활성화 W-E-F 넥서스 및 지속 가능한 농업 기술 개발 스마트팜 창업 및 경영 역량 강화를 통한 산업 연계 지원 스마트팜학과는 첨단 기술을 활용한 미래형 농업을 연구하고, 디지털 농업 생태계를 구축하여 글로벌 농업 혁신을 이끌어갈 인재를 양성하는 것을 목표로 합니다."
    },
    {
        "department_id": 85,
        "학과": "스페인.중남미학과",
        "학과설명": "스페인·중남미(라틴)학과는 국립대학 중 유일하게 스페인어권 국가의 언어, 문학, 문화, 정치, 경제, 사회를 종합적으로 연구하는 학과로, 스페인어를 체계적으로 학습하고, 스페인과 중남미(라틴) 지역의 역사·문화·경제·정치적 배경을 이해하는 것을 목표로 합니다.  본 학과에서는 스페인어의 기초부터 고급 회화, 문법, 문학, 지역 연구, 스페인어 교수법, 번역 및 통역 등을 체계적으로 학습합니다. 또한, 스페인 및 중남미(라틴) 국가들과의 국제 협력, 무역, 외교, 문화 교류 등 다양한 분야에서 활동할 수 있도록 실무적 역량을 배양하는 데 중점을 둡니다.  학생들은 바르셀로나 자치대학(Universitat Autònoma de Barcelona) 및 알칼라 대학(Universidad de Alcalá)과의 교환학생 프로그램을 통해 현지에서 언어 습득과 문화 체험을 할 수 있으며, 중남미(라틴) 주요 국가(아르헨티나, 멕시코, 콜롬비아, 브라질 등)에서의 국제 연수 및 인턴십 기회를 가질 수 있습니다.  학과 비전 스페인·중남미(라틴)학과는 글로벌 시대에 필요한 다문화적 감각과 전문성을 갖춘 인재를 양성하여, 한국과 스페인·중남미(라틴) 국가 간의 다양한 교류 및 협력을 주도하는 전문가를 배출하는 것을 목표로 합니다.  1. 글로벌 스페인어 전문가 양성 스페인어 회화, 문법, 작문, 번역, 통역 역량 강화 스페인어를 활용한 국제 교류 및 실무 능력 배양 2. 지역학 및 정치·경제 연구 중남미(라틴) 국가들의 정치·경제·사회 구조 분석 스페인 및 중남미(라틴) 국가들과의 무역 및 외교 정책 연구 3. 실무 중심 교육 및 국제적 협력 강화 스페인 및 중남미(라틴) 주요 대학과 교환학생 및 해외 연수 운영 글로벌 기업, 국제기구, 외교부, 문화 교류 기관과 협력 4. 다양한 진로 선택을 위한 맞춤형 커리큘럼 제공 교육, 외교, 무역, 관광, 번역·통역 등 다양한 분야에서 실무 역량 강화 스페인 및 중남미(라틴) 관련 스타트업 및 창업 지원 교육과정 스페인·중남미(라틴)학과의 교육과정은 스페인어 능력 향상, 스페인·중남미(라틴) 문학과 문화 이해, 경제·정치·사회 연구 등으로 구성되어 있으며, 학생들이 언어적·문화적 전문성과 실무적 역량을 균형 있게 갖출 수 있도록 체계적인 학습 기회를 제공합니다.  1~2학년: 기초 및 핵심 언어 학습 스페인어 기초 문법 (Spanish Grammar Basics) 스페인어 문법의 기본 구조 이해 및 연습 스페인어 회화 1·2 (Spanish Conversation I & II) 원어민 교수와 함께하는 실용 회화 수업 스페인어 작문 (Spanish Composition) 글쓰기 기법 및 공식 서류 작성 연습 중남미(라틴) 역사 개론 (Introduction to Latin American History) 아즈텍, 마야, 잉카 문명부터 현대 중남미(라틴) 역사 개관 3학년: 심화 연구 및 지역학 탐구 스페인 문학과 예술 (Spanish Literature & Art) 세르반테스, 가르시아 마르케스 등 주요 문학 작품 분석 중남미(라틴) 정치와 사회 (Latin American Politics & Society) 현대 중남미(라틴) 국가들의 정치 체제 및 사회 변화 연구 중남미(라틴) 경제와 무역 (Latin American Economy & Trade) FTA, 경제협력, 다국적 기업과의 교류 분석 스페인어 통번역 연습 (Spanish Translation & Interpretation Practice) 실무 중심의 번역 및 통역 기술 습득 4학년: 실무 프로젝트 및 글로벌 연수 캡스톤 디자인 및 프로젝트 (Capstone Design & Research Project) 국제 협력, 외교, 무역, 문화 교류 관련 프로젝트 수행 스페인 및 중남미(라틴) 국제 연수 (Spanish & Latin American International Training) 현지 대학 및 기업 연계 실습 및 연구 스페인어 교수법 (Spanish Teaching Methods) 스페인어 교사 자격증 취득을 위한 교수법 연구 국제 무역 및 외교 실습 (International Trade & Diplomacy Internship) 무역·외교 관련 실무 경험 제공 연구 분야 스페인·중남미(라틴)학과는 스페인어 및 지역 연구를 바탕으로 다양한 분야에서 연구를 수행하며, 글로벌 협력과 실용적 연구를 지향합니다.  1. 스페인어학 및 번역·통역 연구 스페인어 문법 및 언어학 연구 실무 중심 번역 및 통역 기술 연구 2. 스페인·중남미(라틴) 문학 및 문화 연구 중남미(라틴) 문학 및 예술 연구 스페인·중남미(라틴) 대중문화 및 영화 연구 3. 중남미(라틴) 정치·경제 및 사회 연구 중남미(라틴) 국가들의 정치 및 사회적 변화 분석 글로벌 경제 협력 및 무역 연구 4. 국제 협력 및 외교 연구 한-스페인·중남미(라틴) 외교 및 국제 관계 연구 글로벌 문화 교류 및 국제 협력 연구 졸업 후 진로 스페인·중남미(라틴)학과 졸업생들은 다양한 글로벌 분야에서 활동할 수 있으며, 국제적 감각과 언어 능력을 바탕으로 전문성을 갖춘 전문가로 성장할 수 있습니다.  1. 교육 및 연구 분야 중등학교 스페인어 교사 (교원 자격증 취득 후) 국내외 대학원 진학 및 연구 활동 한국 및 해외 연구소 (스페인·중남미(라틴) 지역 연구소, 국립외교원 등) 2. 국제 무역 및 경제 분야 중남미(라틴) 및 스페인과의 무역 관련 기업 (삼성, 현대, 포스코 등 글로벌 기업) 국제 금융 및 경제 관련 기관 (세계은행, IMF, KOTRA 등) 3. 외교 및 국제기구 외교부 및 대사관, 영사관 근무 UN, UNESCO, KOICA 등 국제기구 활동 4. 관광 및 문화 콘텐츠 산업 스페인 및 중남미(라틴) 관련 관광 산업 및 여행사 출판, 영화, 문화 콘텐츠 기획 및 제작 5. 번역 및 통역 전문가 국제회의 및 외교 행사 통·번역 전문가 출판 및 방송사 스페인어 번역가 스페인·중남미(라틴)학과는 국제 무대에서 활동할 글로벌 인재를 양성하며, 스페인어권 국가들과의 문화·경제·외교적 협력을 주도할 전문가 배출을 목표로 합니다."
    },
    {
        "department_id": 97,
        "학과": "스포츠과학과",
        "학과설명": "스포츠과학과는 운동과 신체활동에 대한 과학적 원리를 연구하고, 스포츠 수행 능력을 향상시키며, 건강 증진을 위한 체계적인 지식을 습득하는 학문입니다.  본 학과는 스포츠과학의 지식과 원리를 바탕으로 신체활동 및 스포츠를 수행하는 사람들의 운동 능력을 향상시키고, 건강을 증진시킬 수 있는 리더십을 갖춘 스포츠 전문 인력을 양성하는 것을 목표로 합니다. 학생들은 레저 스포츠 및 전문 스포츠 기술을 배우고, 스포츠 생리학, 운동처방, 트레이닝 이론 등을 학습하여 운동 전문 지도자로서의 역량을 키우며, 인체의 적응 반응에 대한 깊이 있는 이해를 통해 건강 전문 지도자로서의 전문성을 함양합니다.  교육과정 스포츠과학과의 교육과정은 기초 스포츠과학, 운동생리학, 스포츠의학, 운동처방, 스포츠 경영 및 지도법 등 다양한 분야를 포함하여 이론과 실습을 균형 있게 학습할 수 있도록 구성되어 있습니다.  1. 기초 스포츠과학 및 운동 생리학 과정 스포츠과학개론 (Introduction to Sports Science): 스포츠과학의 기본 개념과 원리 학습 운동생리학 (Exercise Physiology): 신체의 생리적 반응과 운동 효과 연구 운동역학 (Biomechanics of Exercise): 운동 중 신체 움직임의 물리적 원리 분석 운동 영양학 (Sports Nutrition): 운동과 영양의 관계 및 스포츠 선수 영양 관리 운동 심리학 (Exercise Psychology): 운동이 정신 건강 및 심리에 미치는 영향 연구 2. 운동 처방 및 트레이닝 과정 운동처방론 (Exercise Prescription & Training): 개인별 맞춤 운동 프로그램 설계 체력 및 컨디셔닝 트레이닝 (Strength & Conditioning Training): 근력, 지구력, 유연성 향상 트레이닝 기법 스포츠 손상 및 재활 (Sports Injury & Rehabilitation): 스포츠 손상의 원인과 예방 및 재활 치료 특수체육 및 장애인 스포츠 (Adaptive Physical Education & Paralympic Sports): 장애인 스포츠 및 재활 운동 연구 3. 스포츠 경영 및 지도법 과정 스포츠 지도법 (Coaching & Sports Leadership): 스포츠 코칭 이론 및 현장 실습 스포츠 마케팅 및 경영 (Sports Marketing & Management): 스포츠 산업과 비즈니스 모델 연구 스포츠 심판 및 경기 운영 (Sports Officiating & Event Management): 경기 규칙 및 운영 방식 학습 스포츠 정책 및 법률 (Sports Policy & Law): 체육 정책과 스포츠 관련 법률 연구 4. 건강 및 레저 스포츠 과정 레저 스포츠 개론 (Introduction to Leisure Sports): 레저 스포츠의 개념 및 운영 생활체육 및 건강관리 (Public Health & Wellness Management): 생활체육 프로그램 기획 및 운영 노인체육 및 건강증진 (Elderly Sports & Health Promotion): 노년층의 건강 유지 및 운동 프로그램 연구 스포츠와 사회 (Sports & Society): 스포츠가 사회 및 문화에 미치는 영향 분석 5. 연구 및 실습 과정 운동 생리학 실험 (Exercise Physiology Lab): 신체 반응 분석 및 실험 운동처방 실습 (Exercise Prescription Practicum): 운동 프로그램 설계 및 평가 스포츠 현장 실습 (Sports Field Internship): 스포츠 기관 및 산업 현장에서 실무 경험 캡스톤디자인 프로젝트 (Capstone Design in Sports Science): 연구 중심 프로젝트 수행 연구 분야 스포츠과학과는 스포츠 퍼포먼스 향상, 건강 증진, 스포츠 재활, 스포츠 경영 및 산업화 연구 등 다양한 연구를 수행합니다.  운동 생리학 및 퍼포먼스 향상 연구  고강도 인터벌 트레이닝(HIIT) 및 지구력 향상 연구 스포츠 영양 및 피로 회복 메커니즘 연구 근력 및 컨디셔닝 최적화 연구 스포츠 재활 및 손상 예방 연구  스포츠 손상의 원인 분석 및 재활 방법 연구 물리치료 및 기능 회복을 위한 운동 프로그램 개발 장애인 스포츠 및 재활운동 연구 건강 증진 및 생활체육 연구  노인 및 만성질환자의 운동 프로그램 연구 비만 및 대사증후군 예방을 위한 운동 개입 연구 유소년 체력 증진 및 성장 발달 연구 스포츠 심리학 및 멘탈 트레이닝 연구  운동선수의 심리적 스트레스 및 멘탈 트레이닝 기법 연구 스포츠와 정신 건강의 관계 연구 동기부여 및 경기력 향상을 위한 심리적 요인 연구 스포츠 산업 및 경영 연구  스포츠 이벤트 및 마케팅 전략 연구 스포츠 산업의 디지털화 및 e스포츠 연구 스포츠 브랜드 및 팬덤 문화 연구 졸업 후 진로 스포츠과학과 졸업생들은 운동처방, 스포츠 트레이닝, 스포츠 경영 및 마케팅, 건강 증진 및 체육 교육 분야 등 다양한 영역에서 전문가로 활동할 수 있습니다.  운동처방 및 트레이닝 분야  퍼스널 트레이너 및 피트니스 전문가 프로 스포츠팀 트레이너 및 스포츠 컨디셔닝 코치 물리치료 및 운동재활 전문가 스포츠 경영 및 마케팅 분야  스포츠 이벤트 및 경기 운영 전문가 스포츠 브랜드 마케팅 및 스포츠 에이전트 스포츠 미디어 및 방송 관련 직무 건강 증진 및 공공기관 분야  생활체육 지도사 및 체육 시설 관리자 공공 건강 프로그램 기획 및 운영 전문가 노인체육 및 장애인 체육 지도사 체육 교육 및 연구 분야  중·고등학교 체육 교사 스포츠 과학 연구소 및 대학원 진학 스포츠 심리학 및 퍼포먼스 연구원 스포츠 산업 및 창업 분야  피트니스 센터 및 스포츠 관련 창업 스포츠 용품 개발 및 유통 e스포츠 및 디지털 스포츠 콘텐츠 개발 학과의 비전 스포츠과학과는 운동과 건강 증진을 위한 과학적 연구 및 실용적 교육을 통해 스포츠 및 체육 분야의 전문가를 양성하는 것을 목표로 합니다.  운동 수행 능력 향상을 위한 과학적 연구 및 실험 진행 건강 증진 및 스포츠 재활을 위한 맞춤형 운동 프로그램 개발 스포츠 산업 및 체육 경영 분야의 경쟁력 있는 전문가 양성 사회적 요구에 부합하는 체육 교육 및 공공 건강 정책 연구 본 학과는 스포츠과학 및 건강 증진 분야에서 창의적이고 실무 능력을 갖춘 인재를 양성하며, 학생들이 다양한 스포츠 및 건강 산업에서 전문적인 역량을 발휘할 수 있도록 지원합니다."
    },
    {
        "department_id": 43,
        "학과": "식품공학과",
        "학과설명": "식품공학과는 농업, 축산, 수산 원재료의 처리와 저장성 개선, 기호도 향상 및 안전성 보장을 위한 과학적 접근을 통해 인간 생존에 필요한 필수 식품을 생산하는 기술을 연구하는 학문입니다.  본 학과는 식품의 물리적·화학적·생물학적 특성을 이해하고, 식품 가공, 품질 관리, 안전성 보장 및 기능성 식품 개발을 통해 건강한 식생활을 지원하는 과학적 기반을 제공합니다. 학생들은 식품화학, 식품미생물학, 식품가공학, 발효식품학 등 다양한 전공 과목을 통해 이론과 실습을 병행하며, 최신 식품 기술과 연구 방법을 익혀 글로벌 식품 산업에서 전문성을 갖춘 인재로 성장합니다.  교육과정 식품공학과의 교육과정은 식품의 성분 분석, 가공 기술, 저장 및 품질 관리, 위생 및 안전성, 기능성 식품 개발 등 다양한 전공 분야를 포함하여 실무 중심의 교육을 제공합니다.  1. 기초 식품과학 및 공학 과정 식품화학 (Food Chemistry): 탄수화물, 단백질, 지질 등의 식품 성분 연구 식품미생물학 (Food Microbiology): 식품 관련 미생물 및 안전성 연구 식품물리학 (Food Physics): 식품의 물리적 특성과 가공 과정에서의 변화 연구 식품분석학 (Food Analysis): 식품 성분 분석 기법 및 실험 실습 식품공학개론 (Introduction to Food Engineering): 식품 가공 및 보존 원리 개론 2. 식품 가공 및 저장 기술 과정 식품가공학 (Food Processing Technology): 식품 원재료의 가공 및 품질 유지 기술 저온공학 및 냉장보관 (Refrigeration & Cold Storage Engineering): 식품의 저장성 향상을 위한 기술 연구 식품포장학 (Food Packaging Science): 식품 포장의 재료 및 환경적 영향 연구 발효식품학 (Fermented Food Science): 발효식품의 미생물학적 원리 및 산업적 응용 3. 식품 안전 및 품질 관리 과정 식품위생 및 안전성 (Food Hygiene & Safety): 식품 위생 관리 및 식품 중독 예방 연구 HACCP 및 식품법규 (HACCP & Food Regulations): 식품 안전 관리 시스템 및 법적 규제 연구 식품독성학 (Food Toxicology): 식품 내 유해 물질 및 독성 분석 연구 식품품질관리학 (Food Quality Control & Assurance): 품질 유지 및 소비자 신뢰 확보 기술 4. 기능성 식품 및 바이오식품 연구 과정 기능성 식품학 (Functional Foods & Nutraceuticals): 건강 증진을 위한 기능성 식품 연구 바이오식품공학 (Biotechnology in Food Science): 바이오 기술을 활용한 신소재 개발 천연물 식품화학 (Natural Products in Food Science): 천연 생리활성 물질의 식품 응용 연구 건강기능식품 개발 (Health-promoting Food Development): 항산화, 면역 강화 등의 기능성 식품 연구 5. 실험 및 연구 중심 교육 식품가공 실험 (Food Processing Laboratory): 식품 가공 기술 실습 식품분석 실험 (Food Analysis Laboratory): 최신 분석 장비를 활용한 실험 교육 캡스톤디자인 프로젝트 (Capstone Design in Food Science): 산업 맞춤형 프로젝트 수행 산학협력 및 인턴십 (Industry Collaboration & Internship): 식품 기업 및 연구소 현장 실습 연구 분야 식품공학과는 식품 성분 분석, 가공 및 저장 기술 개발, 식품 안전 및 품질 관리, 기능성 식품 및 바이오 기술 연구 등 다양한 분야에서 연구를 수행하고 있습니다.  식품 성분 분석 및 품질 연구  식품 내 주요 성분 및 기능성 성분 분석 식품 품질 유지 및 유통기한 연장 기술 개발 오염 물질 및 식품 안전성 평가 연구 식품 가공 및 저장 기술 연구  고온·고압 가공 및 초고압 처리 기술 연구 저온 보존 및 스마트 패키징 기술 연구 식품의 미생물적 안정성을 향상시키는 기술 연구 기능성 식품 및 바이오식품 연구  건강 기능성 소재 개발 (프로바이오틱스, 항산화제 등) 천연물 기반 기능성 식품 연구 바이오식품 및 대체 단백질 기술 연구 식품 안전 및 위생 관리 연구  식품 내 유해물질 제거 및 검출 기술 연구 HACCP 및 식품 위생 관리 시스템 연구 식중독 예방 및 위해 요소 관리 연구 식품 산업 혁신 및 지속가능성 연구  친환경 식품 가공 및 포장 기술 개발 대체 단백질(배양육, 식물성 단백질) 연구 푸드테크(FoodTech) 및 스마트 푸드 시스템 연구 졸업 후 진로 식품공학과 졸업생들은 식품 제조 및 가공 산업, 연구소 및 공공기관, 품질관리 및 안전성 검사, 기능성 식품 및 바이오 기술 연구 등 다양한 분야에서 전문가로 활동할 수 있습니다.  식품 산업 및 제조 분야  식품 기업(농심, 오뚜기, CJ제일제당, 롯데푸드, 풀무원 등) 발효식품 및 건강기능식품 제조 기업 유제품, 제과·제빵, 음료 산업 관련 기업 식품 연구 및 개발(R&D) 분야  식품 연구소(한국식품연구원, 기업 R&D 센터) 기능성 식품 및 바이오식품 개발 연구원 대체 식품 및 친환경 식품 개발 전문가 식품 품질관리 및 안전성 검사 분야  정부 및 공공기관(식품의약품안전처, 농림축산식품부, 환경부) 식품 품질 검사 및 HACCP 인증 관리 전문가 국제 식품 규제 및 수출입 관리 전문가 바이오 식품 및 지속가능 식품 분야  대체 단백질 및 배양육 개발 연구원 식물성 식품 및 비건 식품 연구원 푸드테크(FoodTech) 및 스마트푸드 산업 전문가 식품 마케팅 및 컨설팅 분야  식품 브랜드 마케팅 및 소비자 조사 전문가 식품 정책 및 트렌드 분석 컨설턴트 글로벌 식품 시장 및 무역 전문가 학과의 비전 식품공학과는 과학적 원리를 바탕으로 식품 가공 및 품질 향상, 안전성 확보 및 기능성 식품 개발을 통해 인류의 건강과 지속가능한 식품 산업 발전에 기여하는 전문 인력을 양성하는 것을 목표로 합니다.  첨단 식품 가공 및 보존 기술 개발을 통한 식품 산업 혁신 기능성 식품 및 바이오식품 연구를 통한 건강 증진 기여 HACCP 및 글로벌 식품 안전 기준 준수를 통한 안전한 식품 생산 친환경 및 지속가능한 식품 기술 개발을 통한 미래 식품 산업 선도 본 학과는 미래 식품 산업을 이끌어 갈 창의적이고 실무 능력을 갖춘 전문가를 양성하며, 학생들이 다양한 산업 및 연구 분야에서 전문적인 역량을 발휘할 수 있도록 지원합니다."
    },
    {
        "department_id": 68,
        "학과": "식품영양학과",
        "학과설명": "식품영양학과는 식품, 영양, 보건, 건강의 상호 관계를 연구하여 올바른 식생활을 영위하고 건강 유지에 필요한 효율적인 영양 관리를 목표로 하는 학문입니다. 본 학과는 과학적 접근을 기반으로 영양소의 생리적 역할을 이해하고, 식품의 안전성 및 기능성을 연구하여 건강 증진과 질병 예방을 위한 최적의 식생활을 설계할 수 있는 전문가 양성을 목표로 합니다.  학생들은 영양생화학, 영양생리학, 단체급식, 기능성식품분자생물학, 식품영양분석학, 감각공학 및 향미화학 등 다양한 과목을 학습하며, 과학적 이론과 실습을 병행하여 식품 및 영양 분야의 전문 역량을 갖춘 인재로 성장할 수 있습니다.  학과 비전 식품영양학과는 현대 사회에서 증가하는 만성질환 예방 및 건강 증진을 위한 영양 관리와 식품 연구를 통해, 국민 건강 증진과 식품산업 발전에 기여하는 전문가를 양성하는 것을 목표로 합니다.  1. 영양학 및 건강 증진 연구 강화 영양소의 생리적 기능 및 질병 예방 연구 공공보건 및 임상영양 관리 역량 배양 2. 식품의 품질 및 기능성 연구 기능성 식품 및 건강기능식품 개발 연구 식품 안전성 및 위생 관리 연구 3. 실무 중심의 교육 및 현장 실습 강화 병원, 급식업체, 식품산업체 등과 연계한 실습 프로그램 운영 식품 및 영양 관련 전문 자격증 취득 지원 4. 지속 가능한 식품 및 영양 연구 환경 친화적인 식품 개발 및 지속 가능한 영양 정책 연구 개인 맞춤형 영양 관리 및 식이요법 연구 교육과정 식품영양학과의 교육과정은 기초과학, 영양학, 식품과학, 실무 및 응용 연구 등 단계별 학습을 통해 식품 및 영양 전문가로 성장할 수 있도록 구성되어 있습니다.  1~2학년: 기초 및 핵심 이론 학습 기초 영양학 (Basic Nutrition) 필수 영양소 및 생리적 기능 학습 식품학 개론 (Introduction to Food Science) 식품의 조성과 기능성 분석 영양생화학 (Nutritional Biochemistry) 영양소의 대사 과정 연구 식품위생학 및 법규 (Food Hygiene & Regulations) 식품 안전 및 위생 관련 법규 학습 3학년: 심화 연구 및 응용 기술 학습 영양생리학 (Nutritional Physiology) 신체 내 영양소 대사 및 생리적 역할 연구 기능성 식품학 (Functional Foods Science) 기능성 성분 및 건강기능식품 개발 연구 식품영양분석학 (Food & Nutrition Analysis) 식품 성분 분석 및 품질 관리 연구 단체급식 및 경영관리 (Institutional Foodservice & Management) 급식 관리 및 식단 설계 실습 4학년: 실무 프로젝트 및 현장 실습 캡스톤 디자인 및 연구 프로젝트 (Capstone Design & Research Project) 식품 및 영양 관련 연구 프로젝트 수행 임상영양 및 질환별 식이요법 (Clinical Nutrition & Therapeutic Diets) 병원 및 의료기관에서의 영양 관리 연구 공공보건 및 영양 정책 (Public Health & Nutrition Policy) 공공기관 및 보건소의 영양 정책 연구 식품 품질 관리 및 감각 평가 (Food Quality Control & Sensory Evaluation) 식품의 품질 및 소비자 감각 평가 연구 연구 분야 식품영양학과는 영양학, 식품과학, 보건 및 공공영양 연구를 바탕으로 다양한 분야에서 연구를 수행하며, 건강한 식생활을 위한 과학적 기반을 제공합니다.  1. 임상영양 및 질병 예방 연구 영양소의 대사 과정 및 질병 예방 연구 암, 당뇨병, 심혈관 질환 등의 영양 치료 연구 2. 기능성 식품 및 건강기능식품 연구 항산화, 항염증 기능을 가진 기능성 식품 연구 식물성 기능성 성분 및 천연물 활용 연구 3. 식품 안전 및 품질 관리 연구 식품 미생물학 및 위생 관리 연구 식품 품질 유지 및 저장 기술 연구 4. 공공보건 및 맞춤형 영양 연구 국민 건강 증진을 위한 영양 정책 연구 유전자 맞춤형 영양 관리 및 식이요법 연구 졸업 후 진로 식품영양학과 졸업생들은 병원, 보건소, 학교, 식품산업체, 연구소 등 다양한 분야에서 활동하며, 국민 건강과 식품 안전을 책임지는 전문가로 성장할 수 있습니다.  1. 임상영양 및 보건 분야 병원 및 보건소 영양사 (Registered Dietitian) 임상영양사 및 질환별 식이요법 전문가 공공보건 및 식생활 정책 연구원 2. 식품산업 및 품질 관리 분야 식품기업 연구원 (기능성 식품 개발 및 품질 관리) 위탁급식 및 단체급식 업체 (급식 관리 및 경영) 식품위생 및 품질 관리 전문가 (HACCP 및 ISO 관리) 3. 교육 및 연구 분야 중·고등학교 영양교사 (교원 자격증 취득 후) 국내외 대학원 진학 및 연구소 연구원 식품 및 영양 관련 연구기관 (농촌진흥청, 식품의약품안전처 등) 4. 공공기관 및 행정 분야 농림축산식품부, 식품의약품안전처, 환경부 등 공공기관 식품 및 보건 관련 NGO 및 국제기구 (WHO, FAO, UNICEF 등) 영양 정책 개발 및 공공 영양 관리 전문가 학과의 역할과 목표 식품영양학과는 국민 건강 증진과 식품산업 발전을 위한 식품·영양 연구를 수행하고, 실무 중심의 교육을 통해 건강한 식생활을 설계할 수 있는 전문가를 양성하는 것을 목표로 합니다.  임상영양 및 질병 예방을 위한 연구 강화 기능성 식품 및 건강기능식품 개발 역량 강화 공공보건 및 지속 가능한 영양 정책 연구 활성화 식품 안전 및 품질 관리 전문가 양성 식품영양학과는 과학적 연구와 실무 경험을 바탕으로 국민 건강 증진과 지속 가능한 식품 산업 발전에 기여할 인재를 배출하는 것을 목표로 합니다."
    },
    {
        "department_id": 16,
        "학과": "신소재공학부(금속시스템공학)",
        "학과설명": "금속시스템공학과는 금속재료의 설계, 가공, 평가 및 응용 기술을 연구하여 첨단 산업에 필요한 금속소재 전문가를 양성하는 학과입니다. 본 학과에서는 철강, 비철금속, 반도체소재, 기능성 부품소재, 나노소재, 에너지소재 등 다양한 금속 소재를 연구하며, 이를 바탕으로 자동차, 항공, 반도체, 조선, 전자, 에너지 산업 등 폭넓은 분야에서 활용 가능한 기술을 개발합니다.  학생들은 물리야금학, 금속조직학, 열역학, 금속가공학, 주조공학, 표면공학, 비철재료학 등 금속재료의 물리·화학적 특성을 심층적으로 학습하며, 다양한 실험 및 프로젝트를 통해 실무 역량을 갖춘 엔지니어로 성장합니다. 또한, 금속소재의 제조부터 가공, 응용 및 품질 평가까지 전반적인 공정을 다루는 실무 중심 교육과정을 운영하여, 졸업 후 다양한 산업 분야에서 즉시 활용 가능한 기술력을 배양합니다.  학과 목표 및 비전 금속시스템공학과는 첨단 산업에 필수적인 금속소재 기술을 연구·개발하여, 미래 산업을 선도할 창의적이고 실무 중심의 금속공학 전문가를 양성하는 것을 목표로 합니다.  첨단 금속소재 연구 및 응용 기술 강화  철강 및 비철금속, 나노소재, 반도체소재, 에너지소재 연구 신소재 개발 및 첨단 제조 공정 연구 실무 중심 교육 및 산업 연계 강화  실험 및 프로젝트 기반 학습(PBL, Problem-Based Learning) 적용 기업 및 연구소와의 협력을 통한 인턴십 및 현장실습 운영 다양한 산업 분야에 적합한 금속공학 전문가 양성  금속재료 설계 및 분석, 가공 및 응용 기술 교육 신소재 개발 및 지속가능한 금속소재 연구 미래 친환경·스마트 소재 개발 연구  친환경 금속소재 및 지속가능한 자원 활용 연구 스마트금속소재 및 AI 기반 금속소재 개발  금속시스템공학과는 금속재료의 설계, 가공, 평가 및 응용 기술을 연구하여 첨단 산업에 필요한 금속소재 전문가를 양성하는 학과입니다. 본 학과에서는 철강, 비철금속, 반도체소재, 기능성 부품소재, 나노소재, 에너지소재 등 다양한 금속 소재를 연구하며, 이를 바탕으로 자동차, 항공, 반도체, 조선, 전자, 에너지 산업 등 폭넓은 분야에서 활용 가능한 기술을 개발합니다.  학생들은 물리야금학, 금속조직학, 열역학, 금속가공학, 주조공학, 표면공학, 비철재료학 등 금속재료의 물리·화학적 특성을 심층적으로 학습하며, 다양한 실험 및 프로젝트를 통해 실무 역량을 갖춘 엔지니어로 성장합니다. 또한, 금속소재의 제조부터 가공, 응용 및 품질 평가까지 전반적인 공정을 다루는 실무 중심 교육과정을 운영하여, 졸업 후 다양한 산업 분야에서 즉시 활용 가능한 기술력을 배양합니다.  학과 목표 및 비전 금속시스템공학과는 첨단 산업에 필수적인 금속소재 기술을 연구·개발하여, 미래 산업을 선도할 창의적이고 실무 중심의 금속공학 전문가를 양성하는 것을 목표로 합니다.  첨단 금속소재 연구 및 응용 기술 강화  철강 및 비철금속, 나노소재, 반도체소재, 에너지소재 연구 신소재 개발 및 첨단 제조 공정 연구 실무 중심 교육 및 산업 연계 강화  실험 및 프로젝트 기반 학습(PBL, Problem-Based Learning) 적용 기업 및 연구소와의 협력을 통한 인턴십 및 현장실습 운영 다양한 산업 분야에 적합한 금속공학 전문가 양성  금속재료 설계 및 분석, 가공 및 응용 기술 교육 신소재 개발 및 지속가능한 금속소재 연구 미래 친환경·스마트 소재 개발 연구  친환경 금속소재 및 지속가능한 자원 활용 연구 스마트금속소재 및 AI 기반 금속소재 개발 배우는 내용 금속시스템공학과에서는 금속재료의 제조, 가공, 응용 및 품질 평가를 중심으로 한 교육과정을 운영하며, 주요 학습 과정은 다음과 같습니다.  1~2학년: 기초 및 핵심 이론 학습 물리야금학(Physical Metallurgy): 금속의 물리적 성질과 미세구조 분석 금속조직학(Metallography): 금속 미세구조와 조직 관찰 및 분석 재료과학(Materials Science): 금속 및 신소재의 기본 특성 이해 제선제강공학(Iron & Steelmaking Engineering): 철강재료의 제조 공정 연구 결정구조학(Crystal Structure): 금속재료의 결정 구조 및 성질 연구 3학년: 심화 연구 및 응용 기술 학습 금속열역학(Thermodynamics of Metals): 금속의 열역학적 특성 및 반응 연구 금속가공학(Metal Forming): 금속의 성형 및 가공 공정 연구 주조공학(Foundry Engineering): 금속 주조 및 소재 제조 기술 표면공학(Surface Engineering): 금속 표면처리 및 코팅 기술 비철제련공학(Non-ferrous Metallurgy): 비철금속의 제조 및 정제 기술 4학년: 실무 프로젝트 및 연구 심화 과정 캡스톤 디자인(Capstone Design): 실무 기반 금속소재 연구 프로젝트 수행 금속박막공학(Materials Science of Metal Thin Films): 박막 소재 개발 및 응용 첨단소재공학(Advanced Materials Engineering): 신소재 및 기능성 금속 연구 현장실습(Field Practice): 기업 및 연구소 인턴십을 통한 실무 경험 연구 분야 금속시스템공학과에서는 금속공학의 핵심 분야부터 첨단 응용 기술까지 다양한 연구를 수행하고 있으며, 주요 연구 분야는 다음과 같습니다.  첨단 금속소재 연구  초고강도 합금 및 신소재 개발 나노소재 및 스마트금속 연구 반도체 및 전자재료 연구  금속박막 및 나노구조 소재 연구 반도체 및 전자소재 제조 공정 연구 에너지 및 친환경 소재 연구  연료전지 및 배터리용 금속소재 연구 친환경 금속소재 및 재활용 기술 연구 자동차·항공·조선산업용 금속소재 연구  경량 합금 및 고성능 금속소재 개발 극한 환경에서의 금속소재 내구성 연구 금속가공 및 제조 공정 연구  금속 가공 및 3D 프린팅 기술 연구 AI 및 빅데이터 기반 금속소재 최적화 연구 졸업 후 진로 금속시스템공학과 졸업생들은 금속소재, 반도체, 자동차, 항공, 에너지, 조선 등 다양한 첨단 산업에서 연구개발, 품질관리, 생산공정, 신소재 설계 및 응용 등의 전문가로 활동할 수 있습니다.  1. 금속 및 신소재 산업 철강 및 비철금속 기업 (포스코, 현대제철, 고려아연 등) 반도체 및 전자소재 기업 (삼성전자, SK하이닉스, LG디스플레이 등) 2. 자동차·항공·조선 산업 자동차 및 항공우주 기업 (현대자동차, 보잉, 한화에어로스페이스 등) 조선 및 해양플랜트 기업 (현대중공업, 대우조선해양 등) 3. 에너지 및 환경 산업 배터리 및 연료전지 관련 기업 (LG에너지솔루션, SK이노베이션 등) 친환경 금속소재 연구소 및 기업 4. 연구 및 학술 분야 국내외 대학원 진학 및 연구소 연구원 금속소재 및 신소재 연구기관 (KIST, 한국재료연구원 등) 5. 공공기관 및 국책 연구소 한국철강협회, 한국에너지기술연구원 국방과학연구소, 한국원자력연구원 학과의 역할과 목표 금속시스템공학과는 미래 산업을 선도할 첨단 금속소재 기술 개발을 목표로, 창의적이고 실무 중심의 전문가를 양성합니다.  첨단 신소재 및 친환경 금속소재 개발 연구 금속 가공 및 제조 공정 최적화 연구 산업체 연계 교육 및 현장 중심 학습 강화 4차 산업혁명 시대의 스마트 금속소재 연구 금속시스템공학과는 국내외 금속소재 산업을 선도할 글로벌 인재를 양성하며, 다양한 첨단 산업과 연계한 실무 중심의 교육을 통해 미래 금속소재 기술 혁신을 주도할 전문가 배출을 목표로 합니다."
    },
    {
        "department_id": 17,
        "학과": "신소재공학부(정보소재공학)",
        "학과설명": "전자재료공학 전공은 반도체, 유전체, 압전체 및 신·재생에너지 재료와 관련된 첨단 기술을 연구하고, 전자산업의 핵심인 전자재료의 설계, 제조, 가공, 특성 평가 및 응용을 학습하는 학문입니다.  전자재료는 현대 산업의 핵심이며, 반도체, 디스플레이, 배터리, 광통신, 신재생에너지 등의 첨단 산업에서 필수적인 요소입니다. 본 전공에서는 소재의 기본 물성부터 전자소자 및 차세대 반도체 기술, 에너지 변환 소재 및 바이오일렉트로닉스 등 다양한 응용 분야까지 연구하고 가르치며, 창의적인 사고 역량을 갖춘 전문 인력을 양성합니다.  산업의 고도화에 따라 전자재료의 수요는 더욱 다양화되고 증가할 것으로 예상되며, 반도체, 태양광, 수소연료전지, 디스플레이, 배터리 및 정보통신 산업에서 연구 및 실무 인력 수요가 지속적으로 증가하고 있습니다. 따라서, 전자재료공학 전공을 이수한 학생들은 졸업 후 반도체, 신재생에너지, 전자부품 및 차세대 디바이스 관련 기업 및 연구소에서 높은 취업 경쟁력을 갖출 수 있습니다.  교육과정 전자재료공학 전공의 교육과정은 전자재료의 기초 물성, 제조 공정, 소자 응용 및 신재생에너지 분야까지 폭넓게 구성되어 있으며, 이론과 실험을 병행하여 실무 중심의 교육을 제공합니다.  1. 기초 전자재료 및 공학 과정 재료과학 1, 2 (Materials Science 1, 2): 재료의 구조와 물성에 대한 기본 개념 학습 현대물리학 (Modern Physics): 전자재료의 물리적 원리 연구 결정학 (Crystallography): 결정 구조 및 재료의 특성 연구 전자공학개론 (Introduction to Electronic Engineering): 전자소자의 기본 원리 이해 2. 전자재료 및 소자 공학 과정 반도체재료 및 소자 1, 2 (Semiconductor Materials & Devices 1, 2): 반도체 재료의 특성과 소자 응용 연구 고체물리학 (Solid State Physics): 반도체 및 전자재료의 물리적 특성 이해 재료강도학 (Strength of Materials): 전자재료의 기계적 특성 분석 재료전기화학 (Electrochemistry of Materials): 전자재료의 전기화학적 성질 연구 3. 신재생에너지 및 차세대 전자소재 과정 신·재생에너지 개론 (Introduction to Renewable Energy): 태양광, 수소연료전지 등 에너지 변환 기술 연구 신·재생에너지 실험 (New & Renewable Energy Lab.): 신재생에너지 관련 실험 및 실습 자성전자재료 (Electro Magnetic Materials): 자기적 특성을 활용한 소재 연구 에너지 저장 및 변환 소재 (Energy Storage and Conversion Materials): 배터리 및 에너지 저장 소자의 재료 연구 4. 첨단 전자소재 및 응용 과정 나노소재 및 소자 분석 (Nanomaterials and Device Characterization): 나노소재의 특성 분석 기법 연구 나노박막공정 (Thin Film Nanotechnology): 나노스케일 박막 공정 및 응용 연구 세라믹재료공학 (Ceramic Materials Engineering): 전자세라믹 소재 연구 및 응용 전자세라믹 소재 (Electroceramics): 유전체 및 압전체 소재 연구 포토닉스 및 광전자 소자 (Photonic and Optoelectronic Devices): 광전자 소자의 원리 및 응용 연구 차세대 메모리 소자 (Next-Generation Memory Devices): 차세대 메모리 기술 연구 5. 실험 및 연구 프로젝트 과정 반도체 공정 (Semiconductor Processing): 반도체 소자의 제조 공정 실습 소재 시뮬레이션 개론 (Computational Materials Science): 전자재료 시뮬레이션 및 예측 연구 캡스톤디자인 (Capstone Design): 산업 및 연구소 연계 프로젝트 수행 바이오일렉트로닉스 개론 (Bioelectronics): 바이오 센서 및 전자소자의 융합 연구 연구 분야 전자재료공학 전공에서는 반도체, 디스플레이, 신재생에너지, 차세대 배터리 및 나노소재 기술을 연구합니다.  반도체 및 전자소재 연구  초저전력 및 고성능 반도체 소자 개발 차세대 반도체 소재 (SiC, GaN, 2D Materials) 연구 반도체 제조 공정 최적화 및 나노스케일 공정 연구 디스플레이 및 광전자 소재 연구  OLED, QLED, 마이크로 LED 디스플레이 연구 광통신 및 포토닉스 소재 연구 유기 전자재료 및 투명 전극 소재 연구 신재생에너지 및 배터리 소재 연구  태양전지 및 연료전지 소재 연구 배터리 및 에너지 저장 시스템 연구 친환경 및 지속가능한 전자소재 연구 바이오일렉트로닉스 및 차세대 센서 연구  바이오 센서 및 의료용 전자소자 연구 웨어러블 디바이스 및 스마트 센서 개발 전자세라믹 및 기능성 나노소재 연구 졸업 후 진로 전자재료공학 전공 졸업생들은 반도체, 디스플레이, 신재생에너지, 배터리, 광전자소자 및 첨단 소재 산업에서 핵심 기술 인력으로 활약할 수 있습니다.  반도체 및 전자소재 산업  삼성전자, SK하이닉스, 인텔, TSMC 등 반도체 기업 반도체 공정 및 장비 업체 (ASML, 램리서치, TEL 등) 반도체 소재 및 부품 제조 기업 디스플레이 및 광전자 소재 산업  삼성디스플레이, LG디스플레이, BOE 등 디스플레이 기업 OLED, QLED, 마이크로 LED 관련 연구소 및 기업 광전자소자 및 광통신 소재 기업 신재생에너지 및 배터리 산업  태양광 및 연료전지 소재 연구소 및 기업 배터리 및 에너지 저장 시스템 제조업체 친환경 소재 및 스마트 소재 개발 기업 연구소 및 공공기관  한국과학기술연구원(KIST), 한국전자통신연구원(ETRI) 삼성종합기술원, LG화학 연구소 등 기업 부설 연구소 국내외 대학원 진학 후 연구직 및 교수직 학과의 비전 전자재료공학 전공은 반도체, 디스플레이, 신재생에너지 및 차세대 나노소재 산업을 선도할 글로벌 인재를 양성하는 것을 목표로 합니다.  첨단 전자소재 및 소자 개발을 통한 기술 혁신 선도 AI 및 빅데이터 기반 신소재 설계 연구 활성화 지속가능한 전자소재 개발을 통한 친환경 산업 기여 본 전공은 창의적이고 실무 능력을 갖춘 전문 엔지니어를 양성하며, 학생들이 다양한 산업 및 연구 분야에서 전문적인 역량을 발휘할 수 있도록 지원합니다."
    },
    {
        "department_id": 18,
        "학과": "신소재공학부(정보소재공학)",
        "학과설명": "정보소재공학 전공은 정보통신기술(ICT)과 소재공학을 융합하여 차세대 정보기기에 필요한 고기능성 소재를 연구하고 개발하는 학문입니다. 스마트폰, 웨어러블 디바이스, 사물인터넷(IoT) 등의 첨단 전자기기에 필수적인 초박막 소재, 반도체 소재, 디스플레이 소재, 전자파 차폐소재 등을 연구하며, 고성능, 경량화, 유연성, 투명성 등의 특성을 갖춘 첨단 정보소재 개발을 목표로 합니다.  이 전공에서는 나노소재, 유연전자소재, 광학소재, 디스플레이 소재, 전자기파 응용소재 등의 연구를 통해 전자부품 및 정보기기의 성능을 극대화하는 차세대 정보소재를 설계 및 응용합니다.  정보소재공학 전공의 특성 1. 차세대 디스플레이 및 광학소재 연구 OLED, QLED, 마이크로 LED 디스플레이용 소재 연구 투명 디스플레이 및 플렉서블 디스플레이 소재 개발 레이저 및 광학 응용 소재 연구 2. 웨어러블 및 유연 전자소재 연구 웨어러블 기기 및 유연 전자회로용 소재 개발 초박막 박막소재 및 나노소재 연구 자기장 기반 센서 및 투명 전극 소재 연구 3. 정보저장 및 고속 통신소재 연구 초고속 메모리 및 저장장치용 소재 개발 5G 및 차세대 통신기술을 위한 전자기파 응용소재 연구 전기·전자파 차폐 및 노이즈 제거 소재 연구 4. 나노소재 및 신기능 소재 개발 전도성 고분자 및 신소재 기반 정보소재 연구 에너지 절감형 전자소재 및 친환경 정보소재 개발 나노구조 및 초고감도 센서 소재 연구 교육과정 1~2학년: 기초 및 핵심 이론 학습 정보소재개론: 정보소재의 개념 및 응용 분야 소개 나노소재 및 나노구조학: 초미세 소재의 물리적 특성 연구 고분자소재공학: 전자기기용 고분자 소재 연구 물리화학 및 재료열역학: 소재의 열역학적 안정성 분석 3~4학년: 심화 연구 및 실무 적용 차세대 디스플레이 소재: OLED, QLED, 마이크로 LED 연구 웨어러블 및 유연소재 기술: 플렉서블 디스플레이 및 센서 개발 광학 및 레이저 소재 연구: 초고감도 센서 및 광학소재 연구 전자기파 차폐 및 정보소재 응용: 5G 및 통신소재 연구 실험 및 프로젝트 기반 학습 정보소재 분석 및 특성 평가 실험 나노소재 및 초박막 박막 응용 연구 정보소재공학 캡스톤디자인 프로젝트 산업체 연계 인턴십 및 실무 프로젝트 수행 연구 분야 1. 차세대 디스플레이 및 광학소재 연구 OLED, QLED, 마이크로 LED 소재 연구 투명 및 플렉서블 디스플레이 소재 개발 광학 및 레이저 응용 소재 연구 2. 웨어러블 디바이스 및 유연소재 연구 전도성 고분자 및 유연 전극 소재 연구 초박막 필름 및 전자소재 개발 스마트 의류 및 생체 모니터링 소재 연구 3. 정보저장 및 고속 통신소재 연구 반도체 메모리 및 초고속 정보저장 소재 연구 전자기파 차폐 및 신호처리용 소재 개발 5G 및 광통신소재 연구 4. 친환경 및 신기능 정보소재 연구 전자폐기물 재활용 및 친환경 소재 연구 에너지 절감형 반도체 및 정보소재 개발 나노소재 기반 고감도 센서 및 바이오센서 연구 졸업 후 진로 1. 디스플레이 및 전자소재 산업 삼성디스플레이, LG디스플레이, BOE 등 디스플레이 기업 OLED, QLED, 마이크로 LED 관련 연구소 및 소재 개발 기업 2. 웨어러블 및 유연소재 관련 기업 웨어러블 디바이스 제조 및 소재 개발 기업 스마트 의류 및 바이오센서 연구소 3. 반도체 및 정보저장 소재 산업 반도체 및 고속 정보저장장치 제조 기업 전자기파 차폐 및 통신소재 개발 기업 4. 연구 및 공공기관 한국재료연구원, KIST, 전자통신연구원(ETRI) 등 연구기관 대학원 진학 후 신소재 및 정보소재 연구 활동 정보소재공학 전공의 역할과 목표 정보소재공학 전공은 차세대 정보기술을 선도할 첨단 소재를 연구하며, 전자기기 및 정보통신 소재의 혁신을 주도하는 전문가를 양성하는 것을 목표로 합니다.  초박막, 유연소재, 나노소재 등 정보기기용 첨단소재 연구 차세대 디스플레이 및 반도체 정보소재 개발 전자파 차폐 및 초고속 통신소재 연구 산업 현장에서 필요로 하는 실무형 연구 및 개발 교육 강화 정보소재공학 전공은 전자 및 정보통신 산업의 발전을 견인할 핵심 분야로서, 첨단 정보소재 기술을 바탕으로 미래 산업 혁신을 선도하는 글로벌 인재를 양성하는 학문입니다."
    },
    {
        "department_id": 63,
        "학과": "심리학과",
        "학과설명": "심리학과는 인간의 의식과 행동을 과학적으로 연구하는 학문으로, 관찰법, 실험법, 조사법 등을 통해 인간 행동을 폭넓고 심도 있게 이해하는 것을 목표로 합니다. 본 학과에서는 인지, 정서, 성격, 발달, 사회, 임상, 상담, 산업 및 조직심리 등 다양한 심리학 분야를 다루며, 학생들이 심리학적 연구 방법과 실무적 적용 능력을 갖출 수 있도록 교육합니다.  학생들은 심리학 연구에 필요한 통계학의 기본 개념과 이론을 학습하고, 실제 연구 자료를 처리하는 데 필요한 데이터 분석 및 실험 설계 능력을 배양합니다. 또한, 심리 평가 및 상담 기술을 익혀, 다양한 심리적 문제를 해결하고 인간의 정신 건강을 증진하는 전문가로 성장할 수 있도록 돕습니다.  학과 목표 및 비전 심리학과는 과학적 연구를 통해 인간 행동과 심리를 이해하고, 이를 바탕으로 다양한 분야에서 심리학적 지식을 실용적으로 적용할 수 있는 전문가를 양성하는 것을 목표로 합니다.  과학적 연구 역량 강화  심리학 연구 방법론 및 데이터 분석 능력 배양 실험 및 조사 연구 수행을 통한 과학적 사고력 함양 실무 중심의 심리학 교육 제공  임상 및 상담심리, 산업 및 조직심리, 교육심리 등 실용적 심리학 교육 심리검사 및 평가 기법 학습을 통한 실무 능력 강화 사회적 문제 해결을 위한 심리학적 접근  정신 건강, 조직 관리, 교육 개선 등 다양한 심리학적 개입 연구 인간관계 및 의사소통 기술을 바탕으로 실생활 적용 능력 배양 글로벌 역량을 갖춘 심리학 전문가 양성  해외 심리학 연구 동향 학습 및 국제 심리학 학술 교류 다양한 심리치료 기법 및 상담 모델 연구 배우는 내용 심리학과에서는 기초 심리학부터 응용 심리학까지 폭넓은 교육과정을 운영하며, 연구 및 실습을 통해 과학적 분석력과 실무 역량을 배양합니다.  1~2학년: 기초 및 핵심 이론 학습 심리학개론 (Introduction to Psychology): 심리학의 기본 개념 및 역사 발달심리학 (Developmental Psychology): 인간의 성장과 발달 과정 연구 인지심리학 (Cognitive Psychology): 기억, 학습, 문제 해결, 의사결정 연구 사회심리학 (Social Psychology): 사회적 상호작용과 집단 행동 연구 심리통계 및 연구방법론 (Psychological Statistics & Research Methods): 심리학 연구를 위한 데이터 분석 및 실험 설계 3학년: 심화 연구 및 실무 적용 학습 임상심리학 (Clinical Psychology): 심리적 장애 및 치료 방법 연구 상담심리학 (Counseling Psychology): 상담 이론 및 심리치료 기법 학습 산업 및 조직심리학 (Industrial & Organizational Psychology): 직무 성과, 동기부여, 조직 행동 연구 건강심리학 (Health Psychology): 스트레스, 정신 건강 및 심리적 개입 연구 심리검사 및 평가 (Psychological Assessment & Testing): 성격, 지능, 정서 평가 기술 학습 4학년: 실무 프로젝트 및 현장 실습 캡스톤 디자인 및 연구 프로젝트 (Capstone Design & Research Project): 심리학 연구 프로젝트 수행 심리학 실습 및 사례 연구 (Psychology Practicum & Case Study): 심리 상담 및 평가 실습 법심리학 (Forensic Psychology): 법적 맥락에서의 심리학적 평가 및 개입 연구 정신건강 및 위기 개입 (Mental Health & Crisis Intervention): 위기 상황에서의 심리적 지원 연구 연구 분야 심리학과에서는 다양한 심리학 분야에서 연구를 수행하며, 과학적 방법론을 바탕으로 인간 행동과 정신 건강을 탐구합니다.  임상 및 상담심리 연구  심리 장애 진단 및 치료 기법 연구 심리치료 및 상담 이론 개발 사회 및 조직심리 연구  사회적 관계 및 갈등 해결 연구 기업 내 조직문화 및 리더십 연구 인지 및 신경심리 연구  뇌와 행동의 관계 연구 인공지능(AI)과 인간 인지과학 연구 교육 및 발달심리 연구  학습 및 동기부여 이론 연구 유아 및 청소년 발달 과정 분석 건강 및 법심리 연구  스트레스 및 정신 건강 연구 법적 심리평가 및 범죄 심리 연구 졸업 후 진로 심리학과 졸업생들은 임상 및 상담, 교육, 연구, 기업 및 공공기관 등 다양한 분야에서 활동할 수 있습니다.  1. 임상 및 상담 분야 임상심리사 (병원 및 정신건강센터) 상담심리사 (학교, 기업, 상담센터) 청소년 상담사 (보건소, 복지기관, 교육청) 2. 연구 및 학술 분야 대학원 진학 및 연구소 연구원 국내외 심리학 연구기관 및 국책연구소 3. 산업 및 조직심리 분야 기업 인사 및 조직 컨설팅 (HR, 조직개발, 리더십 교육) 소비자 및 광고심리 전문가 (마케팅 및 브랜드 전략) 4. 공공기관 및 행정 분야 공공 심리 상담 및 복지기관 근무 법심리 및 범죄심리 전문가 5. 교육 및 학습심리 분야 교육심리학자 및 학습컨설턴트 학교 및 교육기관 심리 전문가 학과의 역할과 목표 심리학과는 인간의 행동과 정신을 과학적으로 분석하고, 이를 바탕으로 실용적인 해결책을 제공할 수 있는 심리학 전문가를 양성하는 것을 목표로 합니다.  과학적 심리 연구 역량 강화  심리학 연구 방법 및 통계 분석 능력 배양 실험심리학 및 행동 데이터 분석 연구 실무 중심의 교육과정 운영  심리 상담 및 치료 기법 학습 기업 및 공공기관 연계 실습 강화 사회적 문제 해결을 위한 심리학적 접근  정신 건강 증진 및 스트레스 관리 연구 법심리 및 조직심리 응용 연구 국제적 심리학 연구 협력 강화  해외 심리학 연구기관 및 학술 교류 활성화 최신 심리치료 기법 및 연구 방법론 습득 심리학과는 과학적 연구와 실무 경험을 바탕으로, 개인과 사회의 심리적 문제를 해결하고 인간의 삶의 질을 향상시키는 데 기여할 인재를 양성하는 것을 목표로 합니다."
    },
    {
        "department_id": 69,
        "학과": "아동학과",
        "학과설명": "아동학과는 영유아부터 아동, 청소년까지의 발달을 가족 및 사회 환경과의 상호작용 맥락에서 연구하며, 아동의 건강한 성장과 발달을 지원하는 전문 인재를 양성하는 학문입니다. 본 학과에서는 영유아 보육, 아동복지, 아동상담, 가족 관계 및 부모 교육 등 다양한 분야의 전문 지식을 교육하여, 아동 관련 프로그램의 개발과 실제 적용 능력을 함양하는 데 중점을 둡니다.  학생들은 아동의 신체, 인지, 정서, 사회적 발달에 대한 이론을 학습하고, 보육 및 상담 기술, 아동 복지 정책, 가족 및 지역사회 지원 프로그램을 연구하며, 실무 중심의 교육을 통해 다양한 기관에서 즉시 활용 가능한 역량을 기르게 됩니다.  학과 목표 및 비전 아동학과는 아동 및 가족의 삶의 질 향상과 건강한 사회를 구축하는 데 기여할 전문가를 양성하는 것을 목표로 합니다.  아동 발달 및 복지 전문가 양성  영유아 보육 및 아동 복지, 상담, 교육 전문가 양성 가족 및 지역사회 중심의 아동 지원 서비스 연구 실무 중심 교육 강화  아동 발달 평가 및 심리 상담 실습 강화 아동 프로그램 개발 및 보육 실습 교육 제공 아동 및 가족 연구 활성화  아동 및 가족의 생애주기별 발달 연구 아동 복지 및 정책 연구를 통한 사회적 기여 다양한 자격증 취득 지원  보육교사, 건강가정사, 아동상담사, 청소년상담사 등의 자격증 취득 지원 공공기관 및 아동 관련 산업체와 협력하여 취업 연계 강화 배우는 내용 아동학과에서는 아동의 발달과 복지를 중심으로 다양한 교육과 연구를 진행하며, 이론과 실습을 병행하여 실무 역량을 강화합니다.  1~2학년: 기초 및 핵심 이론 학습 아동발달 (Child Development): 영유아 및 아동의 신체, 인지, 정서, 사회적 발달 과정 연구 아동심리학 (Child Psychology): 아동의 정서 조절, 애착, 자아 개념 형성 연구 영유아보육론 (Infant & Toddler Care): 보육 이론과 영유아 보육 프로그램 연구 가족학 (Family Studies): 가족 관계 및 가족의 역할과 기능 연구 보육교사론 (Early Childhood Education & Teaching Methods): 영유아 교육과 보육 실무 연구 3학년: 심화 연구 및 응용 학습 아동상담 (Child Counseling): 아동 및 청소년 상담 이론 및 실습 아동복지론 (Child Welfare): 아동 보호 정책 및 복지 서비스 연구 아동건강 및 영양 (Child Health & Nutrition): 아동의 성장 발달과 건강 관리 연구 아동권리와 법 (Children's Rights & Law): 아동 권리 보호 및 관련 법률 이해 놀이치료 및 활동치료 (Play Therapy & Activity Therapy): 놀이를 활용한 아동 치료 기법 학습 4학년: 실무 프로젝트 및 현장 실습 아동 및 가족상담 실습 (Child & Family Counseling Practicum): 심리상담 및 가족 상담 실습 보육 실습 (Childcare Practicum): 어린이집 및 보육 기관에서 실습 수행 청소년 상담 및 지도 (Youth Counseling & Guidance): 청소년 심리 및 상담 연구 아동복지 프로그램 개발 (Child Welfare Program Development): 아동 지원 프로그램 기획 및 평가 연구 분야 아동학과에서는 아동과 가족을 중심으로 다양한 연구를 수행하며, 아동 발달 및 복지 증진을 위한 실용적인 해결책을 모색합니다.  아동 발달 연구  영유아 및 아동의 인지·정서·사회성 발달 연구 부모 양육 방식과 아동의 성장 발달 관계 연구 아동 상담 및 심리 연구  아동 및 청소년의 정서 및 행동 문제 연구 놀이치료 및 인지행동치료 연구 아동 복지 및 정책 연구  아동 보호 및 복지 정책 연구 건강가정 및 다문화 가정 지원 연구 보육 및 교육 연구  영유아 보육 및 교육 프로그램 개발 연구 부모 교육 및 가족지원 프로그램 연구 졸업 후 진로 아동학과 졸업생들은 보육, 교육, 상담, 복지, 연구 등 다양한 분야에서 활동할 수 있으며, 아동과 가족을 위한 전문 서비스를 제공하는 전문가로 성장할 수 있습니다.  1. 보육 및 교육 분야 보육교사 (어린이집 및 유아교육기관) 유아교육 컨설턴트 (교육 프로그램 개발 및 지도) 가족생활교육사 (가족 지원 및 부모 교육 프로그램 운영) 2. 상담 및 심리치료 분야 아동상담사 (아동 및 청소년 심리 상담 기관) 청소년상담사 (학교 및 청소년 보호기관) 놀이치료사 및 미술치료사 (아동 발달센터 및 치료기관) 3. 복지 및 공공기관 분야 건강가정사 (건강가정지원센터 및 다문화가족지원센터) 아동복지 전문가 (아동복지시설 및 사회복지기관) 아동·청소년 정책 연구원 (정부 및 국책 연구기관) 4. 연구 및 학술 분야 대학원 진학 및 연구소 연구원 아동 및 가족 연구기관 연구원 5. 아동 관련 산업 및 기업 아동 콘텐츠 개발 전문가 (출판, 교육 프로그램, 미디어 산업) 아동용품 및 교구 개발 (완구 및 교육 프로그램 기획) 학과의 역할과 목표 아동학과는 아동의 건강한 성장과 발달을 지원하고, 아동 및 가족의 복지를 증진하는 전문가를 양성하는 것을 목표로 합니다.  과학적 연구 기반의 아동 발달 전문가 양성  아동 및 청소년 심리, 발달, 복지 연구 강화 부모 교육 및 가족 지원 프로그램 연구 실무 중심의 교육과정 운영  보육 및 상담 실습 기회 확대 아동 및 가족 복지 관련 기관과 협력하여 현장 실습 강화 사회적 문제 해결을 위한 아동 복지 연구  아동 보호 및 아동 학대 예방 연구 건강한 가족 및 양육 환경 조성을 위한 정책 연구 아동 및 가족 중심의 종합적 지원 서비스 제공  지역사회와 연계한 아동 지원 프로그램 운영 심리 상담 및 정서적 지원을 위한 전문 교육 제공 아동학과는 미래 사회에서 아동과 가족의 복지 및 심리적 건강을 책임질 전문가를 양성하며, 아동 발달 및 복지를 위한 과학적 연구와 실무적 적용을 강화하여, 건강한 사회 형성에 기여하는 것을 목표로 합니다."
    },
    {
        "department_id": 19,
        "학과": "양자시스템공학과",
        "학과설명": "양자시스템공학과는 전자, 이온, 원자, 빛의 성질을 기반으로 첨단 시스템을 설계하고 연구하는 학문입니다. 양자역학의 원리를 바탕으로 원자력, 방사선, 플라즈마 공학 등 현대 산업의 핵심 기술을 연구하며, 양자기술을 응용한 차세대 공학 기술 및 산업 혁신을 선도할 전문 인력을 양성하는 것을 목표로 합니다.  본 학과에서는 핵융합공학, 가속기 및 양자빔 공학, 방사선 및 의료영상공학, 반도체/디스플레이 제조 공정, 태양전지 소자 제작 등의 다양한 연구 분야를 포함하여 양자 시스템의 이론과 실무를 균형 있게 학습할 수 있도록 구성되어 있습니다. 특히, 플라즈마 공학을 기반으로 핵융합 반응, 반도체 제조 공정 및 차세대 디스플레이 공정 기술 등 다양한 산업 응용 분야에 대해 심층적으로 연구합니다.  교육과정 양자시스템공학과의 교육과정은 기초 양자역학, 플라즈마 공학, 방사선 기술, 반도체 및 디스플레이 공정, 핵융합 및 가속기 기술 등 다양한 분야를 아우르며, 산업 및 연구 환경에서 요구되는 실무 능력을 갖출 수 있도록 체계적으로 구성되어 있습니다.  1. 기초 물리 및 양자공학 과정 양자역학 개론 (Introduction to Quantum Mechanics): 양자 현상의 기본 원리 학습 전자기학 (Electromagnetics): 전자기 파동 및 전자기 시스템 연구 고체물리학 (Solid State Physics): 고체 내에서의 전자 및 원자의 거동 이해 양자광학 (Quantum Optics): 빛과 물질 간의 양자적 상호작용 연구 2. 플라즈마 및 핵융합 공학 과정 플라즈마 물리학 (Plasma Physics): 플라즈마 상태의 기본 물리 법칙 연구 핵융합 공학 (Fusion Engineering): 핵융합 반응 및 차세대 에너지 기술 연구 플라즈마 응용공학 (Applied Plasma Engineering): 반도체 및 디스플레이 공정에서의 플라즈마 활용 기술 연구 고온 플라즈마 및 자기 가둠 (High-Temperature Plasma & Magnetic Confinement): 핵융합 발전을 위한 플라즈마 제어 연구 3. 가속기 및 양자빔 공학 과정 가속기 물리학 (Accelerator Physics): 입자가속기의 기본 원리 및 응용 기술 연구 양자빔 및 방사선 공학 (Quantum Beam & Radiation Engineering): 방사선 및 양자빔의 물리적 특성과 응용 연구 방사선 계측 및 탐지 (Radiation Detection & Measurement): 방사선 탐지 및 안전 관리 기술 학습 양자빔 응용공학 (Applied Quantum Beam Engineering): 의료 영상 및 재료 분석을 위한 양자빔 기술 연구 4. 방사선 및 의료영상공학 과정 방사선 물리 및 안전공학 (Radiation Physics & Safety Engineering): 방사선의 원리 및 안전 기술 연구 의료영상 및 방사선 치료기술 (Medical Imaging & Radiation Therapy): CT, MRI, PET 등의 영상 기술 및 방사선 치료 기술 연구 나노바이오 및 방사선 응용 (Nanobio & Radiation Applications): 방사선을 활용한 나노바이오 기술 연구 5. 반도체 및 디스플레이 공정 과정 반도체 공정 및 소자 물리 (Semiconductor Processing & Device Physics): 반도체 제조 공정 및 소자 연구 디스플레이 및 태양전지 재료공학 (Display & Solar Cell Materials Engineering): 차세대 디스플레이 및 태양전지 공정 연구 플라즈마 에칭 및 증착 기술 (Plasma Etching & Deposition Technology): 반도체 및 전자소자 제조 공정 연구 6. 연구 및 실험 과정 양자공학 실험 (Quantum Engineering Lab): 양자 현상을 실험적으로 검증 및 응용 연구 플라즈마 공학 실험 (Plasma Engineering Lab): 플라즈마 기반 공정 실험 및 분석 방사선 및 가속기 실험 (Radiation & Accelerator Lab): 방사선 및 입자가속기 기술 실험 캡스톤 디자인 프로젝트 (Capstone Design in Quantum Systems Engineering): 산업 및 연구소 연계 프로젝트 수행 연구 분야 양자시스템공학과에서는 양자역학을 기반으로 반도체, 디스플레이, 에너지, 의료영상 및 플라즈마 공정 기술을 연구합니다.  핵융합 및 플라즈마 공학 연구  자기 가둠 및 레이저 가둠 핵융합 기술 연구 플라즈마 기반 차세대 반도체 및 디스플레이 공정 연구 플라즈마 기반 환경 및 에너지 응용 기술 연구 가속기 및 양자빔 기술 연구  입자가속기 및 고에너지 물리 연구 방사선 치료 및 의료영상 기술 연구 나노 및 재료과학을 위한 양자빔 기술 연구 반도체 및 디스플레이 공정 연구  차세대 반도체 소자 및 공정 기술 연구 플라즈마 기반 디스플레이 및 태양전지 제조 기술 연구 신재생에너지 및 광전자 공학 연구 방사선 및 의료영상 기술 연구  AI 기반 의료 영상 분석 및 진단 기술 연구 방사선 치료 및 암 치료 기술 개발 바이오 및 나노 재료 기반 방사선 응용 기술 연구 졸업 후 진로 양자시스템공학과 졸업생들은 핵융합, 방사선, 가속기, 반도체 및 디스플레이 산업, 신재생에너지, 의료영상 및 방사선 기술 등 다양한 분야에서 전문가로 활동할 수 있습니다.  원자력 및 플라즈마 공학 분야  한국핵융합연구소(KSTAR), 한국원자력연구원(KAERI) 핵융합 발전소 및 원자력 발전소 연구원 가속기 및 양자빔 기술 연구소  한국가속기연구소, CERN, SLAC 등 입자가속기 연구소 방사선 물리 및 입자물리 연구소 반도체 및 디스플레이 산업  삼성전자, SK하이닉스, LG디스플레이, TSMC 등 반도체 기업 OLED, QLED, 마이크로 LED 및 플라즈마 기반 공정 연구소 의료영상 및 방사선 치료 분야  GE Healthcare, Siemens Healthineers, Varian Medical Systems 등 의료기기 회사 병원 및 연구소의 방사선 치료 및 영상 분석 전문가 신재생에너지 및 스마트 에너지 산업  태양광 및 수소연료전지 기업 플라즈마 기반 친환경 기술 연구소 학과의 비전 양자시스템공학과는 양자기술 및 플라즈마 공학을 기반으로 4차 산업혁명 시대의 핵심 기술을 선도하는 글로벌 인재 양성을 목표로 합니다.  양자기술 및 첨단 공학 연구를 통한 혁신적 산업 발전 기여 핵융합 및 신재생에너지 연구 활성화 방사선 및 가속기 기반 차세대 기술 개발 반도체 및 디스플레이 산업을 위한 플라즈마 공정 기술 혁신 본 전공은 미래 산업을 이끌 창의적이고 실무 능력을 갖춘 엔지니어 및 연구자를 양성합니다."
    },
    {
        "department_id": 83,
        "학과": "영어영문학과",
        "학과설명": "영어영문학과는 영미 문학과 영어학, 실용 영어 교육을 통해 글로벌 역량을 갖춘 전문가를 양성하는 학문입니다. 1953년 설립 이후 영어권 문학과 언어 연구를 선도해 왔으며, 학생들이 영어의 문학적, 언어학적, 실용적 측면을 균형 있게 학습할 수 있도록 체계적인 교육과정을 제공합니다.  본 학과에서는 **영미 및 제3세계 문학 연구, 영어학(통사론, 음운론, 의미론, 영어 교수법 등), 그리고 실용 영어 교육(회화, 작문, 영화 분석 등)**을 중심으로 교육하며, 모든 전공 강좌는 100% 영어로 진행됩니다. 학생들은 외국인 교수진과 함께 실질적인 영어 구사 능력을 배양하며, 학문적 연구뿐만 아니라 실용적인 영어 능력도 함께 향상시킬 수 있습니다.  학과 목표 및 비전 영어영문학과는 영어권 문학과 영어학을 체계적으로 연구하고, 실용 영어 능력을 갖춘 글로벌 인재를 양성하는 것을 목표로 합니다.  영미 문학 및 비평 연구를 통한 인문학적 사고력 강화  다양한 시대와 장르의 영미 문학 작품을 분석하여 비판적 사고력 배양 문학과 역사, 문화, 철학의 연계 연구를 통한 폭넓은 인문학적 이해 제공 영어학 연구를 통한 언어 분석 및 교육 역량 강화  영어의 구조와 사용법을 과학적으로 분석하는 영어학적 접근 교육 영어 교수법 및 언어 습득 이론을 통해 교육자로서의 역량 배양 실용 영어 교육을 통한 국제적 소통 능력 함양  영어 회화, 작문, 토론, 영화 및 매체 분석 등을 통해 영어 실력 향상 글로벌 사회에서 효과적으로 의사소통할 수 있는 영어 능력 배양 다양한 진로 기회 제공 및 취업 연계 강화  교육, 번역·통역, 출판·미디어, 외교, 무역 등 다양한 분야에서 활약할 수 있도록 취업 지원 해외 대학 교환학생 프로그램 및 글로벌 기업과의 협력 강화 배우는 내용 영어영문학과에서는 영미 문학, 영어학, 실용 영어를 중심으로 균형 잡힌 교육과정을 운영하며, 주요 학습 내용은 다음과 같습니다.  1~2학년: 기초 및 핵심 이론 학습 영미문학개론 (Introduction to English & American Literature): 영미 문학의 주요 개념과 흐름 연구 영어학개론 (Introduction to Linguistics): 영어의 구조와 언어학적 특성 이해 영작문 (English Composition): 기본적인 영문 작문 및 글쓰기 연습 영어회화 (English Conversation): 외국인 교수와의 실용 영어 회화 실습 영어발음 및 음운론 (Phonetics & Phonology): 영어 음운 체계와 발음 분석 3학년: 심화 연구 및 응용 학습 영미소설 (English & American Fiction): 영미 문학 작품 분석 및 비평 영어통사론 (Syntax & Grammar): 영어 문장 구조 및 문법 연구 영미희곡 및 시 (English Drama & Poetry): 영미 희곡 및 시의 문학적 분석 영어교수법 (Teaching English as a Foreign Language, TEFL): 효과적인 영어 교육 방법 연구 미디어영어 및 번역 (Media English & Translation): 영화, 뉴스, 문학 번역 실습 4학년: 실무 프로젝트 및 심화 연구 영어 비평 및 문학 이론 (Literary Criticism & Theory): 문학 비평 이론 및 분석 기법 연구 사회언어학 (Sociolinguistics): 영어 사용과 사회적 요인 연구 세계영어 및 다문화 연구 (World Englishes & Multicultural Studies): 글로벌 영어 및 문화 다양성 연구 캡스톤 프로젝트 (Capstone Project in English Studies): 영어 연구 논문 작성 및 발표 출판 및 저널리즘 영어 (Publishing & Journalism English): 미디어 및 저널리즘 분야의 실용 영어 학습 연구 분야 영어영문학과에서는 문학, 언어학, 실용 영어 등 다양한 연구를 수행하며, 문학과 언어를 통한 문화적, 사회적 탐구를 진행합니다.  영미 문학 연구  영미 소설, 희곡, 시, 비평 이론 연구 제3세계 문학 및 탈식민주의 연구 문학과 미디어(영화, 드라마)의 상호작용 연구 영어학 연구  통사론, 음운론, 의미론 연구 사회언어학 및 다중언어 환경 연구 영어 교수법 및 언어 습득 연구 실용 영어 및 번역 연구  영어 미디어 및 출판 연구 번역 및 통역 이론과 실습 연구 영어를 활용한 글로벌 커뮤니케이션 연구 졸업 후 진로 영어영문학과 졸업생들은 교육, 번역 및 통역, 출판·미디어, 외교·무역, IT 및 글로벌 기업 등 다양한 분야에서 전문가로 활동할 수 있습니다.  1. 교육 및 학술 분야 영어 교사 (중·고등학교 교사, 사립학교 및 어학원 강사) 영어교육 전문가 (영어 교수법 연구 및 교육 컨설팅) 대학원 진학 및 연구원 (국내외 영어영문학 및 언어학 연구) 2. 번역 및 통역 분야 번역가 및 통역사 (문학, 영화, 법률, 비즈니스 번역 및 통역) 국제회의 및 외교 행사 통역사 3. 출판 및 미디어 분야 출판 및 저널리즘 전문가 (출판 기획, 편집, 영어 뉴스 및 잡지 기자) 콘텐츠 크리에이터 및 마케팅 전문가 (영어 콘텐츠 제작, SNS 마케팅) 4. 외교 및 무역 분야 외교 및 공공기관 (외교부, 국제기구, 대사관, KOTRA) 국제무역 및 글로벌 마케팅 (외국계 기업 및 글로벌 기업 근무) 5. IT 및 글로벌 기업 분야 테크니컬 라이터 (IT 및 소프트웨어 매뉴얼 및 기술문서 작성) AI 및 데이터 분석 관련 연구 (자연어처리, AI 기반 언어 연구) 학과의 역할과 목표 영어영문학과는 문학적 사고력과 언어적 전문성을 갖춘 글로벌 인재를 양성하며, 국제 사회에서 활약할 수 있도록 실용적이고 창의적인 영어 교육을 제공합니다.  영미 문학 및 문화 연구 활성화  다양한 시대와 장르의 영미 문학을 연구하여 비판적 사고력 배양 문학과 역사, 철학, 문화의 융합 연구 강화 영어학 및 언어 연구 역량 강화  영어의 구조적, 기능적, 사회적 측면 연구 영어 교수법 및 언어 교육 연구 실용 영어 및 글로벌 역량 배양  영어 회화, 작문, 미디어 및 번역 교육 강화 글로벌 기업 및 국제기구 취업을 위한 실용 영어 교육 제공 영어영문학과는 문학, 언어학, 실용 영어 교육을 통해 학생들이 다양한 분야에서 전문성을 갖춘 글로벌 리더로 성장할 수 있도록 지원합니다."
    },
    {
        "department_id": 44,
        "학과": "원예학과",
        "학과설명": "원예학과는 채소, 과수, 화훼 등 다양한 원예작물의 육종, 생산, 품질 관리 및 마케팅 등의 전반적인 원예 산업을 연구하고 교육하는 학문입니다. 원예작물의 효율적인 생산과 품질 향상을 위한 최신 기술을 학습하며, 농업과학자 및 전문 농업경영인을 양성하는 것을 목표로 합니다.  원예학은 단순한 작물 재배를 넘어 식물의 생리적 과정, 생명공학적 개량, 환경과의 상호작용, 스마트팜 및 디지털 농업 기술을 활용한 농업 혁신, 원예 작물의 가공 및 유통 전략까지 폭넓은 영역을 포함하고 있습니다.  본 학과에서는 기초 원예학부터 스마트 농업, 유전자 편집 기술, 지속 가능한 농업 기술 개발 등 미래 농업을 위한 혁신적인 연구를 수행하며, 실험 및 실습 중심의 교육을 통해 현장 실무 능력을 배양할 수 있도록 구성되어 있습니다.  교육과정 원예학과의 교육과정은 채소, 과수, 화훼 등 주요 원예작물의 생리학적 원리, 재배 기술, 생명공학적 연구, 품질 관리 및 유통 전략 등을 학습할 수 있도록 체계적으로 구성되어 있습니다.  1. 원예학 기초 및 필수 과목 원예학개론 (Introduction to Horticulture): 원예작물의 기본 개념과 재배 이론 학습 식물생리학 (Plant Physiology): 식물의 생장과 발달, 환경 적응 과정 연구 토양 및 비료학 (Soil and Fertilizers in Horticulture): 작물 재배를 위한 토양과 비료의 특성 분석 원예작물유전학 (Genetics of Horticultural Crops): 유전학을 활용한 원예작물 육종 연구 2. 채소원예학 과정 채소재배학 (Vegetable Crop Production): 채소 작물의 생장 특성과 재배 기술 연구 스마트팜 채소학 (Smart Farming for Vegetables): 자동화 및 IoT 기술을 활용한 채소 재배 시스템 연구 채소 생리 및 병리학 (Vegetable Physiology and Pathology): 채소 작물의 생리적 특징과 병해충 관리 연구 3. 과수원예학 과정 과수재배학 (Fruit Crop Production): 과수 작물의 생리적 특징 및 재배 기술 연구 과수 품질관리 및 저장 (Fruit Quality Control and Storage): 수확 후 관리 및 저장 기술 연구 과수 유전육종학 (Fruit Genetics and Breeding): 과수 품종 개량 및 유전자 연구 4. 화훼 및 원예조경 과정 화훼원예학 (Floriculture and Ornamental Plants): 화훼 작물의 생육 및 관리 기술 연구 조경 및 도시농업 (Landscape Horticulture and Urban Farming): 조경 디자인 및 도시농업 기술 연구 관상식물 생리학 (Ornamental Plant Physiology): 관상식물의 성장 원리 및 환경 적응 연구 5. 원예생명공학 및 유전 육종 과정 원예생명공학 (Horticultural Biotechnology): 유전자 조작 및 생명공학을 활용한 작물 개량 연구 원예작물 육종학 (Breeding of Horticultural Crops): 새로운 품종 개발을 위한 육종 연구 분자생물학 및 조직배양 (Molecular Biology and Plant Tissue Culture): 유전자 편집 및 식물 조직 배양 기술 연구 6. 스마트 농업 및 지속가능한 농업 과정 스마트팜 기술 (Smart Farm Technology): 빅데이터, IoT, 인공지능(AI) 기반 농업 혁신 연구 친환경 및 유기농 농업 (Sustainable and Organic Farming): 지속 가능한 농업 기술 및 유기농 재배 기법 연구 식물 보호 및 병충해 관리 (Plant Protection and Pest Management): 작물의 병해충 및 환경 스트레스 대응 연구 7. 유통 및 농업경영 과정 농산물 유통 및 마케팅 (Agricultural Distribution and Marketing): 원예작물의 유통 및 글로벌 시장 전략 연구 농업경제학 (Agricultural Economics): 농업경영 및 경제적 분석 기법 학습 농산물 가공 및 품질 관리 (Food Processing and Quality Control): 수확 후 가공 및 상품화 연구 8. 연구 및 실험 과정 원예작물 실험 및 분석 (Horticultural Crop Analysis Lab): 작물의 생리 및 품질 분석 실험 스마트팜 실습 (Smart Farm Experimentation): 첨단 기술을 활용한 농업 실습 캡스톤디자인 프로젝트 (Capstone Design in Horticulture Science): 산업 및 연구소 연계 프로젝트 수행 연구 분야 및 연구실 원예학과는 다양한 원예작물의 생리, 재배, 육종 및 생명공학 연구를 수행하며, 전문 교수진과 함께 심화 연구를 진행할 수 있는 연구실을 운영하고 있습니다.  과수원예학 연구실  과수 작물의 생장 및 환경 적응 연구 수확 후 저장 및 품질 관리 기술 개발 식물생리학 연구실  식물의 생리적 반응 및 환경 적응 연구 스트레스 저항성 작물 개발 연구 원예생명공학 연구실  유전자 조작 및 신품종 개발 연구 조직배양 및 분자생물학적 기법 연구 원예육종학 연구실  원예작물의 유전적 다양성 연구 병충해 저항성 및 고품질 품종 개발 연구 채소원예학 연구실  채소 작물의 생장 환경 최적화 연구 스마트팜 기술을 활용한 고효율 농업 연구 화훼원예학 연구실  화훼작물의 생장 및 개화 조절 연구 관상식물 및 도시농업 응용 연구 졸업 후 진로 원예학과 졸업생들은 농업, 원예, 생명공학, 스마트팜, 유통 및 경영 등 다양한 분야에서 전문가로 활동할 수 있습니다.  농업 및 원예 산업 분야  스마트팜 및 친환경 농업 기업 종묘 및 원예작물 연구소 농산물 유통 및 가공 기업 생명공학 및 육종 연구 분야  작물 육종 및 유전자 연구소 생명공학 및 농업 바이오 기업 농업 및 원예 연구기관 (농촌진흥청, 국립원예특작과학원) 스마트팜 및 첨단 농업 기술 분야  스마트팜 및 정밀농업 연구소 AI 및 빅데이터 기반 농업 기술 개발 공공기관 및 연구소  농림축산식품부 및 지방자치단체 농업 부서 국립농업과학원, 국립산림과학원 학계 및 교육 분야  대학원 진학 후 연구원 및 교수직 농업 교육기관 및 컨설팅 전문가 학과의 비전 원예학과는 첨단 기술과 지속 가능한 농업 연구를 결합하여 미래 농업을 선도하는 글로벌 인재를 양성하는 것을 목표로 합니다.  친환경 및 스마트 농업 기술 연구 활성화 생명공학을 활용한 작물 개량 및 품종 개발 지속 가능한 농업 발전을 위한 혁신적인 연구 수행 본 학과는 첨단 농업 기술과 융합하여 고부가가치 농업을 실현할 인재를 양성합니다."
    },
    {
        "department_id": 8,
        "학과": "유기소재섬유공학과",
        "학과설명": "유기소재섬유공학과는 첨단 유기소재 및 섬유소재의 연구·개발을 통해 다양한 산업 분야에서 활용될 수 있는 고성능 소재를 설계하고 응용하는 학문입니다. 1962년 섬유공학과로 설립된 이후, 2006년 섬유소재시스템공학과, 2011년 유기소재파이버공학과를 거쳐 현재의 학과명으로 개편되었으며, 전통적인 섬유공학뿐만 아니라 첨단 유기소재 분야까지 포함하는 융합적 연구와 교육을 제공하고 있습니다.  본 학과에서는 고분자 소재, 스마트 섬유, 기능성 섬유, 친환경 소재 등 첨단 산업에서 요구하는 고기능성 소재를 개발하는 기술을 학습하며, 스포츠 레저, 에너지, 전기전자, 정보통신, 의료, 군사, 환경, 우주항공 등의 다양한 산업 분야에서 활용할 수 있는 응용력을 갖춘 전문가 양성을 목표로 합니다.  학과 목표 및 비전 유기소재섬유공학과는 차세대 첨단 유기소재 및 섬유소재 개발을 선도하는 전문가를 양성하는 것을 목표로 합니다.  첨단 유기소재 및 섬유소재 연구 역량 강화  고성능 섬유소재 및 기능성 고분자 연구 나노섬유 및 스마트 텍스타일 개발 산업체 연계 및 실무 중심 교육 강화  소재 설계 및 응용 연구를 위한 산업체 연계 실습 제공 융합 기술 교육을 통해 신소재 산업과 연계 지속 가능한 소재 및 친환경 기술 연구  친환경 바이오섬유 및 재생 소재 연구 탄소중립을 위한 지속 가능한 소재 개발 다양한 산업 분야에서 활용 가능한 실용적 기술 교육  전기전자, 의료, 항공우주, 국방 산업 등 다양한 산업과의 연계 연구 기능성 섬유 및 첨단 산업 소재 기술 교육 배우는 내용 유기소재섬유공학과에서는 섬유공학, 고분자소재, 기능성 소재, 친환경 섬유 및 나노소재 등 첨단 섬유 및 유기소재 분야를 아우르는 폭넓은 교육과정을 운영하고 있습니다.  1~2학년: 기초 및 핵심 이론 학습 고분자화학 (Polymer Chemistry): 고분자의 구조 및 합성 원리 학습 섬유재료학 (Textile Materials Science): 섬유의 물리·화학적 특성 및 응용 연구 유기소재개론 (Introduction to Organic Materials): 유기소재의 특성과 산업적 활용 이해 섬유가공공학 (Textile Processing Engineering): 섬유소재의 물리적 가공 방법 및 기술 학습 3학년: 심화 연구 및 응용 학습 고분자 및 복합재료 (Polymers & Composite Materials): 기능성 고분자 및 복합소재 연구 섬유기능성공학 (Functional Textile Engineering): 방수, 난연, 항균 섬유 등 기능성 섬유 연구 스마트섬유 및 나노소재 (Smart Textiles & Nanomaterials): 웨어러블 기술 및 나노섬유 연구 섬유물리 및 기계적 성질 (Physical & Mechanical Properties of Textiles): 섬유소재의 강도 및 내구성 분석 4학년: 실무 프로젝트 및 연구 개발 첨단 섬유 및 복합소재 (Advanced Textiles & Composite Materials): 고성능 섬유 및 신소재 개발 연구 환경친화적 섬유 및 지속가능한 소재 (Eco-Friendly & Sustainable Materials): 친환경 바이오섬유 및 지속 가능한 섬유 연구 캡스톤디자인 및 연구 프로젝트 (Capstone Design & Research Project): 신소재 설계 및 연구 프로젝트 수행 소재 분석 및 품질 평가 (Materials Analysis & Quality Assessment): 섬유소재의 품질 평가 및 실험 실습 연구 분야 유기소재섬유공학과에서는 첨단 소재 연구를 바탕으로 다양한 산업에 적용할 수 있는 신소재 기술을 개발하며, 주요 연구 분야는 다음과 같습니다.  첨단 기능성 섬유 연구  방수, 난연, 항균 등 기능성 섬유 개발 스포츠 및 아웃도어용 고기능성 섬유 연구 스마트 섬유 및 웨어러블 기술 연구  전자섬유 및 웨어러블 디바이스 연구 센서 기능을 가진 스마트 텍스타일 개발 고분자 및 나노소재 연구  고성능 고분자 소재 및 복합재료 연구 나노섬유 및 나노기술을 활용한 소재 개발 친환경 및 지속가능 소재 연구  바이오 기반 친환경 섬유 개발 재생 소재 및 탄소중립 기술 연구 의료 및 국방용 섬유 연구  의료용 섬유 및 생체적합성 소재 연구 군사용 방탄섬유 및 보호용 기능성 소재 개발 졸업 후 진로 유기소재섬유공학과 졸업생들은 첨단 소재 산업, 연구개발, 품질관리, 제품 설계, 환경 및 친환경 소재 분야 등 다양한 산업에서 활동할 수 있습니다.  1. 첨단 소재 및 섬유 산업 고기능성 섬유 및 스마트 텍스타일 개발 스포츠, 아웃도어, 의료용 섬유소재 연구 나노섬유 및 고분자 복합소재 연구 2. 연구 및 학술 분야 신소재 연구소 및 산업체 R&D 연구원 대학원 진학 및 학술 연구 수행 3. 친환경 및 지속가능 소재 산업 바이오 기반 친환경 섬유 연구 및 생산 탄소중립 및 지속가능한 소재 개발 4. 전기·전자 및 정보통신 소재 산업 전도성 섬유 및 웨어러블 디바이스 개발 IT 및 반도체 관련 섬유소재 연구 5. 항공·국방 및 의료 소재 산업 방탄섬유 및 보호복 소재 개발 의료용 섬유 및 생체적합성 소재 연구 학과의 역할과 목표 유기소재섬유공학과는 첨단 유기소재 및 섬유소재의 연구와 실용화를 통해 미래 산업을 선도하는 전문가를 양성하는 것을 목표로 합니다.  첨단 신소재 연구 및 산업 응용 기술 강화  기능성 섬유 및 스마트 소재 연구 고분자 및 나노소재 기반 신소재 기술 개발 지속 가능한 친환경 소재 연구  바이오 기반 및 재생 섬유 연구 탄소중립 및 지속가능한 섬유 개발 산업과 연계된 실무 중심 교육 제공  기업 및 연구기관과 협력하여 실무 중심 프로젝트 수행 현장 실습 및 연구개발 기회 확대 유기소재섬유공학과는 첨단 소재 기술을 연구하고 지속 가능한 미래를 위한 친환경 신소재 개발을 선도하며, 다양한 산업 분야에서 활용될 수 있는 고기능성 소재 전문가를 양성하는 것을 목표로 합니다."
    },
    {
        "department_id": 20,
        "학과": "융합기술공학부(IT융합기전공학)",
        "학과설명": "IT융합기전공학전공은 자동차 공학과 첨단 정보기술(IT)을 융합하여 4차 산업혁명 시대에 필요한 미래형 엔지니어를 양성하는 학문입니다. 기존의 기계적 자동차 기술을 넘어 전기차(EV), 자율주행, 인공지능(AI), 사물인터넷(IoT), 클라우드 컴퓨팅, 빅데이터 분석, 스마트 모빌리티 등 혁신적인 기술을 접목하여 자동차 산업의 미래를 선도할 인재를 배출하는 것을 목표로 합니다.  학과 비전 및 목표 IT융합기전공학전공은 자동차 기술과 IT의 융합을 통해 지속가능한 미래 모빌리티 환경을 구축하고, 글로벌 자동차 산업을 혁신할 인재를 양성하는 것을 목표로 합니다.  스마트 모빌리티 및 자율주행 기술 혁신  AI 기반 자율주행 알고리즘 연구 및 실무 적용 센서 융합 기술을 활용한 실시간 차량 환경 인식 자율주행 시뮬레이션 및 실차 테스트 전기차 및 친환경 자동차 기술 연구  전기차 배터리 관리 시스템(BMS) 및 충전 인프라 개발 하이브리드 및 수소연료전지 차량의 효율성 최적화 전력전자 및 에너지 저장 시스템 연구 IT 기반 자동차 소프트웨어 및 클라우드 서비스 개발  차량용 소프트웨어 및 전자제어 유닛(ECU) 개발 클라우드 기반 차량 데이터 분석 및 원격 진단 시스템 연구 스마트 모빌리티 및 MaaS(Mobility as a Service) 플랫폼 개발 교육과정 개요 IT융합기전공학전공의 교육과정은 자동차 공학과 IT 기술을 융합하여 자동차 소프트웨어, 차량 전자제어 시스템, 자율주행 및 인공지능, 스마트 모빌리티 및 IoT를 연구할 수 있도록 체계적으로 구성되어 있습니다.  기초 전공 필수 과목  기초 전자기학, 자동차공학개론, 프로그래밍 기초(C, Python), 회로이론 및 설계 차량용 IT 기술 및 임베디드 시스템 과정  자동차 임베디드 시스템, 마이크로컨트롤러 및 IoT, 차량 네트워크 및 통신(CAN, LIN, Ethernet), 스마트 모빌리티 시스템 전기차 및 친환경 자동차 과정  전기차 및 배터리 기술, 친환경 자동차 공학, 전력전자 및 에너지 저장 시스템 자율주행 및 인공지능(AI) 과정  자율주행 알고리즘 및 센서 융합, 차량용 AI 및 딥러닝, 컴퓨터 비전 및 영상처리 자동차 소프트웨어 및 스마트 모빌리티 과정  차량용 소프트웨어 개발, 스마트 교통 시스템 및 MaaS, 자율주행 시뮬레이션 및 테스트베드 연구 분야 및 연구실 IT융합기전공학전공에서는 자동차 공학과 IT 기술이 융합된 다양한 연구를 수행하며, 전공별로 전문 연구실을 운영하고 있습니다.  자율주행 및 인공지능 연구실: 자율주행 센서 및 제어 알고리즘 연구, 딥러닝 기반 차량 인식, 자율주행 시뮬레이션 전기차 및 배터리 연구실: 전기차 동력 시스템, 배터리 관리 시스템(BMS), 충전 인프라 개발 차량 네트워크 및 스마트 모빌리티 연구실: V2X(차량 간 통신), 스마트 교통 시스템, 모빌리티 서비스 플랫폼(MaaS) 연구 차량용 소프트웨어 및 임베디드 시스템 연구실: ECU 및 차량 네트워크 소프트웨어 개발, 클라우드 기반 데이터 분석, 자율주행 보안 기술 졸업 후 진로 IT융합기전공학전공 졸업생들은 자동차 및 IT 융합 산업에서 핵심적인 역할을 수행할 전문가로서 다양한 진로를 선택할 수 있습니다.  자동차 및 모빌리티 기업: 현대자동차, 기아, 테슬라, 벤츠, BMW, 도요타 등 글로벌 자동차 제조업체 전기차 및 친환경 자동차 기업: 배터리 및 에너지 저장 시스템(LG에너지솔루션, SK온, CATL), 전기차 충전 인프라 기업 자율주행 및 스마트 교통 연구기관: 한국자동차연구원, 한국전자통신연구원(ETRI), KAIST 자율주행연구소 창업 및 스타트업: 차량용 소프트웨어 및 AI 기반 모빌리티 서비스, 전기차 및 자율주행 기술 스타트업 창업 IT융합기전공학전공은 미래 자동차 산업을 선도할 글로벌 인재를 양성하는 것을 목표로 합니"
    },
    {
        "department_id": 21,
        "학과": "융합기술공학부(IT응용시스템공학)",
        "학과설명": "IT융합기전공학전공은 자동차 공학과 첨단 정보기술(IT)을 융합하여 4차 산업혁명 시대에 필요한 미래형 엔지니어를 양성하는 학문입니다. 기존의 기계적 자동차 기술을 넘어 전기차(EV), 자율주행, 인공지능(AI), 사물인터넷(IoT), 클라우드 컴퓨팅, 빅데이터 분석, 스마트 모빌리티 등 혁신적인 기술을 접목하여 자동차 산업의 미래를 선도할 인재를 배출하는 것을 목표로 합니다.  학과 비전 및 목표 IT융합기전공학전공은 자동차 기술과 IT의 융합을 통해 지속가능한 미래 모빌리티 환경을 구축하고, 글로벌 자동차 산업을 혁신할 인재를 양성하는 것을 목표로 합니다.  스마트 모빌리티 및 자율주행 기술 혁신  AI 기반 자율주행 알고리즘 연구 및 실무 적용 센서 융합 기술을 활용한 실시간 차량 환경 인식 자율주행 시뮬레이션 및 실차 테스트 전기차 및 친환경 자동차 기술 연구  전기차 배터리 관리 시스템(BMS) 및 충전 인프라 개발 하이브리드 및 수소연료전지 차량의 효율성 최적화 전력전자 및 에너지 저장 시스템 연구 IT 기반 자동차 소프트웨어 및 클라우드 서비스 개발  차량용 소프트웨어 및 전자제어 유닛(ECU) 개발 클라우드 기반 차량 데이터 분석 및 원격 진단 시스템 연구 스마트 모빌리티 및 MaaS(Mobility as a Service) 플랫폼 개발 교육과정 개요 IT융합기전공학전공의 교육과정은 자동차 공학과 IT 기술을 융합하여 자동차 소프트웨어, 차량 전자제어 시스템, 자율주행 및 인공지능, 스마트 모빌리티 및 IoT를 연구할 수 있도록 체계적으로 구성되어 있습니다.  기초 전공 필수 과목  기초 전자기학, 자동차공학개론, 프로그래밍 기초(C, Python), 회로이론 및 설계 차량용 IT 기술 및 임베디드 시스템 과정  자동차 임베디드 시스템, 마이크로컨트롤러 및 IoT, 차량 네트워크 및 통신(CAN, LIN, Ethernet), 스마트 모빌리티 시스템 전기차 및 친환경 자동차 과정  전기차 및 배터리 기술, 친환경 자동차 공학, 전력전자 및 에너지 저장 시스템 자율주행 및 인공지능(AI) 과정  자율주행 알고리즘 및 센서 융합, 차량용 AI 및 딥러닝, 컴퓨터 비전 및 영상처리 자동차 소프트웨어 및 스마트 모빌리티 과정  차량용 소프트웨어 개발, 스마트 교통 시스템 및 MaaS, 자율주행 시뮬레이션 및 테스트베드 연구 분야 및 연구실 IT융합기전공학전공에서는 자동차 공학과 IT 기술이 융합된 다양한 연구를 수행하며, 전공별로 전문 연구실을 운영하고 있습니다.  자율주행 및 인공지능 연구실: 자율주행 센서 및 제어 알고리즘 연구, 딥러닝 기반 차량 인식, 자율주행 시뮬레이션 전기차 및 배터리 연구실: 전기차 동력 시스템, 배터리 관리 시스템(BMS), 충전 인프라 개발 차량 네트워크 및 스마트 모빌리티 연구실: V2X(차량 간 통신), 스마트 교통 시스템, 모빌리티 서비스 플랫폼(MaaS) 연구 차량용 소프트웨어 및 임베디드 시스템 연구실: ECU 및 차량 네트워크 소프트웨어 개발, 클라우드 기반 데이터 분석, 자율주행 보안 기술 졸업 후 진로 IT융합기전공학전공 졸업생들은 자동차 및 IT 융합 산업에서 핵심적인 역할을 수행할 전문가로서 다양한 진로를 선택할 수 있습니다.  자동차 및 모빌리티 기업: 현대자동차, 기아, 테슬라, 벤츠, BMW, 도요타 등 글로벌 자동차 제조업체 전기차 및 친환경 자동차 기업: 배터리 및 에너지 저장 시스템(LG에너지솔루션, SK온, CATL), 전기차 충전 인프라 기업 자율주행 및 스마트 교통 연구기관: 한국자동차연구원, 한국전자통신연구원(ETRI), KAIST 자율주행연구소 창업 및 스타트업: 차량용 소프트웨어 및 AI 기반 모빌리티 서비스, 전기차 및 자율주행 기술 스타트업 창업 IT융합기전공학전공은 미래 자동차 산업을 선도할 글로벌 인재를 양성하는 것을 목표로 합니"
    },
    {
        "department_id": 70,
        "학과": "의류학과",
        "학과설명": "의류학과는 패션 및 의류산업 전반을 연구하고, 창의적이고 실무적인 의류 전문가를 양성하는 학문입니다. 의류 디자인, 의류 제작, 텍스타일 디자인, 패션 마케팅, 의류 생산 및 유통 등 다양한 의류 관련 분야를 학습하며, 의류의 미적, 기능적, 경제적 측면을 연구하여 의류 산업을 선도할 실무 역량을 갖춘 인재를 배출하는 것을 목표로 합니다.  본 학과에서는 의류와 사회, 문화, 기술의 관계를 탐구하고, 글로벌 패션 트렌드와 디지털 기술을 접목한 의류 디자인 개발, 의류 마케팅 및 브랜드 기획을 포괄적으로 다루며, 지속 가능한 의류산업의 발전에 기여할 창의적이고 혁신적인 의류 전문가를 양성합니다.  의류학과의 목표 및 비전 의류학과는 의류 산업의 발전을 이끌어갈 창의적이고 실무적인 의류 전문가를 양성하기 위해 다음과 같은 목표를 설정하고 있습니다.  1. 의류 및 패션 산업의 기초 및 전문 지식 습득 의류의 역사 및 트렌드 분석 의류 디자인의 원리와 기법 연구 의류 소재 및 텍스타일의 특성 이해 의류 제작 및 패턴 설계 기술 학습 2. 창의적 의류 디자인 역량 및 실무 능력 배양 패션 디자인 및 의류 일러스트레이션 표현 능력 개발 입체 재단 및 패턴 제작을 통한 의류 구성 실습 디지털 패션 및 CAD를 활용한 최신 의류 기술 습득 3. 의류 산업 실무 및 비즈니스 역량 강화 패션 마케팅, 브랜드 기획 및 글로벌 의류산업 연구 패션 머천다이징 및 의류 창업 관련 실습 운영 현장 실습 및 캡스톤디자인 프로젝트를 통한 실무 경험 제공 4. 글로벌 의류 트렌드 및 디지털 기술 활용 3D 가상 의류 디자인 및 디지털 패션 연구 K-패션 및 한복 디자인을 활용한 글로벌 패션 시장 진출 친환경 의류 및 지속 가능한 의류 개발 연구 배우는 내용 의류학과에서는 의류 디자인, 의류 제작, 의류 마케팅 및 산업 실무를 중심으로 학습하며, 학년별로 기초부터 심화된 교육을 제공합니다.  1~2학년: 의류 및 패션 기초 과정 패션재료섬유: 의류 소재 및 섬유의 특성 연구 패션일러스트레이션: 의류 디자인 및 스타일링 기법 학습 인체와 의복: 의류 디자인에서 인체 구조의 중요성 연구 의복구성설계: 패턴 제작 및 의류 제작 기초 실습 서양복식문화사: 서양 복식의 역사 및 트렌드 분석 3학년: 의류 산업 및 응용 과정 글로벌패션산업: 국제 의류 비즈니스 및 브랜드 전략 연구 디지털텍스타일디자인: 디지털 도구를 활용한 텍스타일 디자인 실습 패션과 심리: 소비자의 의류 소비 행동 및 트렌드 분석 패션소재산업: 의류 제품의 소재 개발 및 응용 연구 4학년: 실무 프로젝트 및 창업 과정 어패럴디자인: 실무 중심의 의류 제품 개발 프로젝트 패션머천다이징: 의류 제품의 기획, 생산 및 유통 연구 패션디자인포트폴리오: 졸업 작품 및 의류 디자인 포트폴리오 제작 패션창업프로젝트: 창업 및 패션 브랜드 기획 실습 K-패션컬렉션 기획 및 운영: 글로벌 패션쇼 및 컬렉션 운영 실무 졸업 후 진로 의류학과 졸업생들은 의류 디자인, 텍스타일 디자인, 패션마케팅, 머천다이징, 의류 제작 및 유통 등 다양한 분야에서 활동할 수 있습니다.  1. 의류 디자인 및 의류 제작 분야 패션디자이너: 의류 및 액세서리 디자인 기획 및 제작 텍스타일디자이너: 패브릭 디자인 및 패턴 개발 니트디자이너: 니트 소재 의류 및 제품 디자인 2. 패션 마케팅 및 브랜드 관리 분야 패션마케터: 의류 브랜드 및 제품 홍보 및 마케팅 기획 패션머천다이저: 의류 제품의 기획 및 유통 관리 패션바이어: 국내외 의류 제품 소싱 및 유통 관리 3. 의류 산업 연구 및 IT 기술 활용 분야 CAD 프로그래머: 패션 CAD 및 디지털 의류 디자인 기술 개발 디지털패션디자이너: 3D 가상 패션 및 AR/VR 기반 의류 개발 패션트렌드분석가: 글로벌 패션 트렌드 연구 및 분석 4. 의류 및 패션 관련 창업 분야 패션 창업가: 독자적인 의류 브랜드 창업 및 운영 의류생산 및 테크니컬디자이너: 생산 공정 및 기술 관리 5. 교육 및 연구 분야 패션전문 교육자: 고등학교 및 대학교 패션 관련 교육 담당 박물관 의류복원 및 전시기획자: 전통 의류 복원 및 전시 기획 의류학과의 역할과 목표 의류학과는 창의적이고 실무적인 의류 전문가를 양성하여, 글로벌 의류 산업을 선도하는 것을 목표로 합니다.  의류 디자인 및 제작 기술을 심화 연구하여 실무 역량 강화 의류 마케팅 및 브랜드 기획을 통해 글로벌 시장 진출 지원 디지털 의류 기술 및 3D 패션 디자인을 활용한 혁신적인 연구 수행 친환경 의류 및 지속 가능한 패션 개발을 통한 미래 지향적 산업 구축 의류학과는 단순한 패션을 넘어 의류 디자인, 소재 연구, 의류 제작, 마케팅까지 전반을 아우르며, 패션 산업의 중심에서 창의적인 혁신을 이끄는 전문가를 양성하는 학문입니다."
    },
    {
        "department_id": 87,
        "학과": "일본학과",
        "학과설명": "일본학과는 일본어, 일본 문학, 일본 문화 및 사회에 대한 깊이 있는 학습을 통해 일본에 대한 전문적이고 실용적인 지식을 갖춘 인재를 양성하는 학문입니다.  본 학과는 일본어 구사 능력을 체계적으로 학습하는 것뿐만 아니라, 일본의 역사, 문학, 예술, 대중문화, 경제, 정치 등 다양한 분야에 대한 전문 지식을 습득하여 글로벌 시대에 걸맞은 일본 전문가를 양성하는 것을 목표로 합니다.  또한, 일본의 유수 대학과 자매결연을 맺고 있으며, 교환학생, 단기 연수 프로그램 등 학생 교류 프로그램을 운영하여 학생들이 실제 일본 문화를 경험하고 학습할 기회를 제공합니다.  졸업 후에는 일본어 교육, 통역·번역, 무역, 관광, 외교, 언론 등 다양한 분야에서 활약할 수 있습니다.  교육과정 일본학과의 교육과정은 일본어 능력 향상을 위한 어학 교육과 일본 문학, 문화, 사회 및 경제에 대한 종합적인 이해를 바탕으로 실무 능력을 배양하는 방향으로 구성되어 있습니다.  1. 일본어 교육 과정 (어학 능력 향상) 일본어 문법 및 회화 (Japanese Grammar & Conversation) 일본어 독해 및 작문 (Japanese Reading & Writing) 비즈니스 일본어 (Business Japanese) 일본어 통번역 실습 (Japanese Interpretation & Translation Practice) 일본어능력시험(JLPT) 대비반 (Preparation for JLPT & JPT) 2. 일본 문학 및 문화 연구 과정 일본문학 개론 (Introduction to Japanese Literature) 일본 근현대 문학 (Modern & Contemporary Japanese Literature) 일본 신화와 전통 문화 (Japanese Mythology & Traditional Culture) 일본 대중문화 (Japanese Pop Culture: Anime, Manga, J-POP) 일본문학 작품 분석 및 감상 (Analysis of Japanese Literary Works) 3. 일본 사회 및 경제 연구 과정 일본 사회와 정치 (Japanese Society & Politics) 일본 경제와 기업문화 (Japanese Economy & Business Culture) 일본의 미디어와 대중문화 (Japanese Media & Popular Culture) 한일 비교문화 연구 (Comparative Studies between Korea & Japan) 일본의 현대사회 문제 연구 (Contemporary Issues in Japanese Society) 4. 일본학 실무 과정 (취업 및 실전 적용) 일본어 비즈니스 커뮤니케이션 (Business Communication in Japanese) 한일 무역과 국제 비즈니스 (Korea-Japan Trade & Business Relations) 일본 기업 인턴십 및 취업 준비 (Internship & Career Preparation in Japan) 일본 관광 및 서비스 산업 연구 (Japanese Tourism & Hospitality Industry) 일본어 통번역 현장 실습 (Field Practice in Japanese Interpretation & Translation) 5. 교류 및 연수 프로그램 일본 대학 교환학생 프로그램 (Exchange Program with Japanese Universities) 일본 문화 체험 및 단기 어학연수 (Japanese Cultural Experience & Short-term Language Training) 해외 인턴십 및 현장 실습 (Overseas Internship & Field Training in Japan) 연구 분야 및 연구실 일본학과는 일본어 교육뿐만 아니라 일본의 역사, 문화, 경제, 정치, 사회, 대중문화 등의 다양한 연구를 수행하며, 전문 연구실을 운영하고 있습니다.  일본어교육 연구실  일본어 문법 및 어학 연구 효과적인 일본어 학습법 개발 일본어능력시험(JLPT) 대비 및 연구 일본문학 및 번역 연구실  일본 근현대 문학 연구 일본 문학 작품 번역 연구 한일 문학 비교 연구 일본 사회 및 경제 연구실  일본의 기업문화 및 비즈니스 연구 일본의 사회적 변화 및 현대 문제 연구 한일 경제 협력 및 무역 관계 연구 일본 대중문화 및 미디어 연구실  일본 애니메이션, 만화, J-POP 연구 일본의 미디어 산업 및 글로벌 콘텐츠 연구 일본 드라마, 영화 분석 및 트렌드 연구 졸업 후 진로 일본학과 졸업생들은 일본어 구사 능력과 일본 사회·문화에 대한 전문성을 바탕으로 다양한 산업 분야에서 활약할 수 있습니다.  일본어 교육 및 연구 분야  일본어 강사 (초·중·고등학교 및 어학원) 일본어 교육 콘텐츠 개발자 일본어 교재 및 사전 집필 연구원 통·번역 및 언론 분야  전문 일본어 통번역가 (출판, 기업, 공공기관) 일본 관련 언론인 및 기자 한일 콘텐츠 제작 및 미디어 관련 직업 무역 및 글로벌 비즈니스 분야  한일 무역회사 및 글로벌 기업 (삼성, 현대, LG, 도요타, 소니 등) 일본계 기업 및 금융기관 취업 (미쓰비시, 미즈호은행, 소프트뱅크 등) 일본 시장 마케팅 및 해외영업 전문가 관광 및 서비스 산업 분야  일본 여행사 및 관광 가이드 호텔 및 항공사 일본어 서비스 전문가 일본 문화 행사 및 전시 기획자 공공기관 및 외교 분야  외교부 및 주일한국대사관, 영사관 근무 문화체육관광부 및 한일 교류 기관 국제 NGO 및 일본 관련 공공기관 취업 창업 및 대학원 진학  일본어 관련 교육 및 출판 창업 한일 무역 및 관광 관련 창업 일본 유학 및 대학원 진학 (도쿄대, 교토대, 와세다대 등) 학과의 비전 일본학과는 글로벌 시대에 맞춰 일본어 능력뿐만 아니라 일본 사회, 문화, 경제, 정치 등에 대한 깊은 이해를 바탕으로 다양한 산업 분야에서 활약할 수 있는 인재를 양성하는 것을 목표로 합니다.  일본어 전문 인력 양성: 실용적인 일본어 구사 능력 배양 한일 문화 교류 및 연구 활성화: 한일 비교문화 연구 및 상호 교류 프로그램 운영 국제 비즈니스 및 글로벌 전문가 양성: 무역, 금융, IT, 콘텐츠 산업 등 다양한 분야로 진출 지원 다양한 취업 및 창업 기회 제공: 해외 취업 및 창업 지원 프로그램 운영 본 학과는 일본 관련 다양한 산업과 학문 분야에서 미래를 이끌어갈 글로벌 인재를 양성하는 학문적 중심이 될 것입니다."
    },
    {
        "department_id": 45,
        "학과": "작물생명과학과",
        "학과설명": "작물생명학과는 식량 안보와 지속 가능한 농업 발전을 위해 작물의 생리, 생태, 유전·육종, 재배 및 생산 기술을 연구하는 학문입니다. 친환경적이고 효율적인 작물 생산 기술을 개발하여 인류의 생존과 복지 향상에 기여할 수 있는 전문가를 양성하는 것을 목표로 합니다.  학생들은 작물의 유전·육종, 조직배양 및 유전자 조작 기술, 친환경 농업 및 재배기술, 농업생명공학 등 다양한 학문적 이론과 실용적 기술을 습득하며, 작물유전자원센터, 영농정착교육과정, 자연 체험학습, 약초특화사업단 등 특성화된 학습 프로그램을 통해 전문적인 연구 역량을 강화할 수 있습니다.  학과 목표 및 비전 작물생명학과는 지속 가능한 농업 기술과 첨단 생명공학을 접목하여, 글로벌 식량 문제 해결과 농업 혁신을 선도할 전문가를 양성하는 것을 목표로 합니다.  고부가가치 작물 및 신품종 개발 연구  기후변화 대응 작물 및 고기능성 작물 개발 유전공학 및 스마트 농업 기술을 활용한 품종 개량 연구 친환경 농업 및 지속 가능한 작물 생산 연구  생태 친화적 재배 기술 및 유기농업 연구 토양 및 비료 관리 기술을 활용한 지속 가능한 농업 개발 스마트 농업 및 정밀 농업 기술 적용  드론 및 원격 센서를 활용한 정밀 농업 연구 빅데이터 및 AI를 기반으로 한 작물 재배 최적화 기술 연구 산업체 및 연구기관과 협력한 실무 중심 교육 강화  국내외 연구기관 및 농업기업과의 산학 협력 프로젝트 진행 현장 실습 및 창업 지원을 통해 농업 산업과 연계한 실용적 교육 제공 배우는 내용 작물생명학과에서는 작물의 생리학, 유전학, 생명공학, 재배기술, 토양 및 비료학 등 다양한 농업 과학 분야를 아우르는 교육과정을 운영합니다.  1~2학년: 기초 및 핵심 이론 학습 식물생리학 (Plant Physiology): 작물의 생장 및 발달 원리 학습 식물유전학 (Plant Genetics): 유전적 특성 및 품종 개량 원리 연구 작물재배학 (Crop Cultivation Science): 주요 작물의 재배 기법 학습 농업생명공학 (Agricultural Biotechnology): 유전자 조작 및 조직배양 기술 습득 토양 및 비료학 (Soil & Fertilizer Science): 토양과 작물 영양학적 관계 연구 3학년: 심화 연구 및 응용 학습 작물유전육종학 (Crop Genetics & Breeding): 품종 개량 및 육종 기술 연구 농업환경 및 기후변화 대응기술 (Agricultural Environment & Climate Change Adaptation) 유전자원 관리 및 활용 (Genetic Resource Management & Utilization) 약용작물 및 특수작물 연구 (Medicinal & Specialty Crops Science) 작물보호학 및 병해충 관리 (Crop Protection & Pest Management) 4학년: 실무 프로젝트 및 연구 개발 스마트팜 및 정밀농업 기술 (Smart Farm & Precision Agriculture Technology) 농업생명과학 연구 프로젝트 (Capstone Research in Crop Science) 작물가공 및 유통시스템 (Crop Processing & Distribution System) 농업 창업 및 비즈니스 모델 개발 (Agricultural Startups & Business Models) 연구 분야 작물생명학과에서는 기후변화 대응, 생명공학을 활용한 품종 개량, 스마트 농업 기술 등을 중심으로 다양한 연구를 수행하고 있으며, 주요 연구 분야는 다음과 같습니다.  작물 유전 및 육종 연구  유전자 조작 및 전통 육종 기법을 활용한 고수확 품종 개발 스트레스 저항성 작물 및 기능성 작물 연구 친환경 농업 및 지속 가능한 농업 기술 연구  무농약 및 유기농 재배 기술 연구 지속 가능한 농업을 위한 토양 및 비료 관리 연구 스마트팜 및 정밀농업 연구  빅데이터 및 AI 기반 작물 생육 모니터링 연구 드론 및 IoT 센서를 활용한 자동화 재배 기술 연구 약용작물 및 기능성 작물 연구  약초 및 기능성 농산물 개발 및 활용 연구 건강식품 및 기능성 식품 원료로 활용할 수 있는 농산물 연구 졸업 후 진로 작물생명학과 졸업생들은 농업기술 연구, 작물 유전 및 육종, 스마트팜, 농업 생명공학, 농산물 유통 및 가공 등 다양한 분야에서 활동할 수 있습니다.  1. 연구 및 공공기관 농촌진흥청 및 산하기관 (작물 연구 및 육종 연구) 농림축산식품부 및 소속기관 (농업 정책 및 식량안보 연구) 국립농업과학원, 종자원, 환경연구소 (작물 재배 기술 및 유전자 연구) 2. 농업 및 바이오산업 분야 종자회사 (신품종 개발 및 육종 연구) 비료 및 농약 회사 (토양 및 작물 보호 연구) 농산물 가공 및 식품기업 (기능성 식품 및 건강식품 연구) 3. 스마트 농업 및 정밀 농업 관련 산업 스마트팜 및 정밀농업 기업 (AI 기반 농업 기술 개발) 농업기술 스타트업 창업 (친환경 농업 및 스마트팜 운영) 4. 농업 컨설팅 및 유통 분야 농업경영 및 컨설팅 기업 (농업기술 컨설팅 및 경영 분석) 농산물 유통 및 물류 기업 (농산물 유통 및 마케팅) 학과의 역할과 목표 작물생명학과는 농업의 지속 가능한 발전을 위한 첨단 생명공학 및 스마트 농업 기술을 연구하고, 식량 위기 해결을 위한 전문가를 양성하는 것을 목표로 합니다.  기후변화 대응 및 지속 가능한 농업 연구 강화  친환경 및 지속 가능한 농업기술 개발 스마트 농업 및 정밀농업 연구 유전자원 및 작물 육종 연구 활성화  고부가가치 작물 및 기능성 작물 개발 유전자 기술을 활용한 품종 개량 연구 스마트 농업 및 정밀 농업 교육 확대  드론, AI, IoT를 활용한 농업 자동화 기술 교육 데이터 기반 농업 경영 및 생산성 향상 연구 작물생명학과는 미래 농업 기술을 선도하고 지속 가능한 농업을 실현할 전문가를 양성하여, 국내외 농업 산업의 혁신을 주도하는 것을 목표로 합니다."
    },
    {
        "department_id": 22,
        "학과": "전기공학과",
        "학과설명": "전기공학은 전기에너지의 생산, 변환, 전송 및 분배를 연구하는 학문으로, 전통적으로 전력 시스템 및 전력전자 기술을 중심으로 발전해왔으며, 반도체, 신소재, MEMS, 나노 테크놀로지, 제어 및 자동화, 지능형 시스템, 컴퓨터 공학, 산업 전자 등 다양한 첨단 기술과 융합하여 새로운 혁신을 이끌어가고 있습니다.  최근에는 풍력, 태양광 등 신재생에너지 기술, 스마트 그리드 및 에너지 저장 기술, 전기자동차 및 전력변환 시스템 등의 첨단 산업 분야까지 확장되면서, 에너지 효율성 증대, 지구 환경 개선, 4차 산업혁명 시대의 전기 기술 혁신에 기여할 전문가를 양성하는 것을 목표로 합니다.  학과 목표 및 비전 전기공학과는 지속 가능한 에너지 기술과 첨단 전기 시스템을 연구하고, 미래 전기 산업을 이끌어갈 창의적이고 실무적인 역량을 갖춘 인재를 양성하는 것을 목표로 합니다.  전기에너지의 효율적 생산 및 운영 연구  발전, 송배전, 전력 변환 및 분배 시스템 연구 스마트 그리드 및 신재생에너지 기술 개발 미래 전력 시스템 및 자동화 기술 개발  전력전자, 전기기기, 산업 자동화 및 지능형 전력 시스템 연구 AI 및 IoT 기반 스마트 전력망 기술 개발 신소재 및 나노전자 기술 융합 연구  반도체, 나노전자공학 및 MEMS 기술 적용 고효율 전력변환 및 에너지 저장 시스템 연구 신재생에너지 및 친환경 에너지 기술 개발  태양광, 풍력, 수소연료전지 등 친환경 에너지 연구 지속 가능한 에너지 시스템 및 배터리 기술 연구 산업체 및 연구소와 연계한 실무 중심 교육 강화  전력회사, 반도체 기업, 전기자동차 및 전력전자 기업과 협력하여 연구 및 실습 기회 제공 산업과 연계한 프로젝트 기반 교육 제공 배우는 내용 전기공학과에서는 전력 시스템, 전력전자, 신소재 및 나노기술, 자동화 및 제어 시스템, 신재생에너지 등 다양한 학문을 융합하여 전기에너지의 생산과 활용을 연구하는 교육과정을 운영합니다.  1~2학년: 기초 및 핵심 이론 학습 기초전기전자공학 (Basic Electrical & Electronic Engineering) 회로이론 (Circuit Theory) 전자기학 (Electromagnetics) 전기기기 (Electrical Machines) 디지털논리설계 (Digital Logic Design) 전력공학 개론 (Introduction to Power Engineering) 3학년: 심화 연구 및 응용 학습 전력전자공학 (Power Electronics) 제어공학 (Control Engineering) 신재생에너지공학 (Renewable Energy Engineering) 전력계통공학 (Power System Engineering) 전기자동차 및 배터리 시스템 (Electric Vehicles & Battery Systems) 스마트그리드 및 에너지 관리 (Smart Grid & Energy Management) 4학년: 실무 프로젝트 및 연구 개발 전력변환 및 에너지 저장 시스템 (Power Conversion & Energy Storage Systems) 반도체 및 나노전자공학 (Semiconductors & Nanoelectronics) 전기설비 설계 및 실습 (Electrical Equipment Design & Practice) 산업자동화 및 지능형 전기시스템 (Industrial Automation & Intelligent Electrical Systems) 캡스톤 디자인 및 연구 프로젝트 (Capstone Design & Research Project) 연구 분야 전기공학과에서는 전력 시스템, 전력전자, 신재생에너지, 반도체 및 나노기술, 자동화 및 제어 시스템 등 다양한 연구를 수행하며, 주요 연구 분야는 다음과 같습니다.  1. 전력 시스템 및 전력전자 연구 스마트 그리드 및 전력망 최적화 연구 전력 변환 및 고효율 에너지 저장 기술 연구 전기기기 및 모터 구동 기술 연구 2. 신재생에너지 및 친환경 전력 기술 연구 태양광, 풍력, 수소 연료전지 등 친환경 에너지 기술 연구 에너지 저장 시스템(ESS) 및 배터리 관리 기술 연구 탄소 중립을 위한 에너지 절감 및 고효율 전력 변환 연구 3. 자동화 및 지능형 전력 시스템 연구 AI 및 IoT 기반의 스마트 전력망 기술 연구 산업 자동화 및 전기설비 모니터링 시스템 연구 로봇 및 자동화 기술을 활용한 지능형 전기 시스템 연구 4. 반도체 및 나노전자 기술 연구 MEMS 및 나노센서를 활용한 전력 감지 기술 연구 고성능 반도체 및 전자소자 개발 고전압 및 고주파 반도체 소자 응용 연구 졸업 후 진로 전기공학과 졸업생들은 전력 및 에너지 산업, 전자 및 반도체 산업, 자동화 및 제어 시스템, 신재생에너지 및 환경 기술 분야 등 다양한 산업에서 활동할 수 있습니다.  1. 전력 및 에너지 산업 발전 및 송배전 회사 (한국전력, 발전 공기업, 전력기기 제조업체) 스마트 그리드 및 전력 변환 기술 연구소 신재생에너지 및 에너지 저장 기술 관련 기업 2. 전자 및 반도체 산업 반도체 및 전력전자 설계 및 제조 (삼성전자, SK하이닉스, LG전자 등) 전자 및 반도체 소자 연구개발 및 공정 엔지니어 반도체 및 나노소재 기반 전자기기 개발 3. 자동화 및 지능형 시스템 분야 AI 및 IoT 기반 스마트 전력망 개발 산업 자동화 시스템 및 제어 기술 개발 로봇 및 전기 구동 시스템 연구 4. 신재생에너지 및 친환경 기술 산업 태양광, 풍력, 수소연료전지 기술 연구 및 개발 에너지 저장 시스템(ESS) 및 배터리 기술 연구 탄소 중립 및 친환경 전력 시스템 개발 5. 연구 및 공공기관 국책 연구소 및 전력 연구 기관 (KERI, ETRI, KIST 등) 전력 및 에너지 정책 연구소 및 공기업 전기 관련 정부기관 및 연구기관 학과의 역할과 목표 전기공학과는 미래 전력 시스템을 선도하고, 4차 산업혁명 시대의 핵심 기술인 전기 및 에너지 분야의 혁신을 이끌 전문가를 양성하는 것을 목표로 합니다.  지속 가능한 전력 및 에너지 시스템 연구 활성화  스마트 그리드 및 신재생에너지 기술 개발 친환경 및 에너지 절감 기술 연구 첨단 전기 기술 및 자동화 연구 확대  AI 및 IoT 기반의 지능형 전력 시스템 연구 산업 자동화 및 스마트 제조 시스템 개발 산업 및 연구기관과 협력한 실무 중심 교육 강화  기업 및 연구소와 연계한 현장 실습 및 프로젝트 진행 창업 지원 및 기술 혁신을 위한 스타트업 지원 전기공학과는 지속 가능한 미래 에너지를 연구하고, 전력 및 반도체 산업을 혁신할 인재를 양성하여 글로벌 전력 및 에너지 산업의 발전에 기여하는 것을 목표로 합니다."
    },
    {
        "department_id": 23,
        "학과": "전자공학부",
        "학과설명": "전자공학부는 차세대 반도체 기술 및 전자공학의 핵심 분야를 연구하고 교육하는 학문입니다. 반도체 및 집적회로(IC) 설계, 첨단 반도체 공정 기술, 나노소자, 전력 반도체, 인공지능(AI) 반도체, 통신 및 네트워크, 의료전자, 로보틱스, 디스플레이 및 광공학 등 다양한 첨단 기술을 연구하고 산업과 연계하여 실무 중심의 교육을 제공합니다.  반도체 및 전자소자 연구  본 학부에서는 차세대 반도체 및 나노소자 기술을 중점적으로 연구하며, 실리콘 반도체뿐만 아니라 신소재 반도체, 양자 반도체, 저전력 반도체 등의 연구를 수행합니다. 반도체 집적회로 설계, 공정 기술, 반도체 소자의 전력 및 성능 최적화, AI 기반 반도체 설계 등을 다루며, 산업체 및 연구기관과 협력하여 실질적인 반도체 기술 발전을 선도합니다.  주요 연구 분야:  반도체 회로 및 공정 설계  신소재 반도체 및 나노소자 연구  초고속 및 저전력 반도체 기술  AI 반도체 및 뉴로모픽 컴퓨팅  전력 반도체 및 에너지 효율 회로  차세대 반도체 및 집적회로 연구  반도체 집적회로(IC) 설계 및 최적화 기술을 중점적으로 연구하며, SoC(System on Chip), FPGA(Field-Programmable Gate Array), ASIC(Application-Specific Integrated Circuit) 설계 등 다양한 분야에서 활용할 수 있는 기술을 다룹니다. 특히, AI 반도체 및 뉴로모픽 반도체 연구를 통해 차세대 컴퓨팅 시스템의 기반을 구축하고 있습니다.  연구 영역:  초고밀도 집적회로 설계 및 최적화  신소재 반도체 및 차세대 공정 기술  AI 및 머신러닝 가속기 개발  고효율 전력 반도체 및 에너지 변환 기술  반도체 소자의 신뢰성 및 내구성 향상  통신 및 네트워크 최적화 연구  반도체 기술과 함께 5G/6G 및 위성통신, 광통신, IoT, 유비쿼터스 컴퓨팅 등 차세대 통신 기술을 연구합니다. 특히, AI 기반 통신 최적화 및 초고속 데이터 전송 기술 개발을 통해 미래의 네트워크 환경을 혁신하고 있습니다.  주요 연구 분야:  5G/6G 및 위성통신 최적화  유비쿼터스 컴퓨팅 및 엣지 컴퓨팅 기술  무선 네트워크 및 저전력 IoT 기술  광통신 및 초고주파 회로 설계  AI 및 로보틱스 응용 연구  반도체 기반의 AI 및 로보틱스 기술을 활용하여 자율주행, 스마트 팩토리, 산업 자동화 등의 응용 분야를 개척하고 있습니다. AI 칩 설계부터 지능형 로봇 개발까지 다양한 연구를 진행합니다.  연구 분야:  AI 기반 반도체 및 뉴로모픽 칩 설계  지능형 로봇 및 스마트 모빌리티 시스템 개발  머신러닝 기반 신호처리 및 로봇 비전 연구  산업 자동화 및 AI 기반 통신 신호 최적화  의료전자 및 스마트 센서 연구  반도체 기술을 활용한 의료전자 및 스마트 센서 개발을 통해 웨어러블 디바이스, 생체 신호 처리, 신경공학 등의 첨단 기술을 연구합니다. AI 기반 의료영상 분석 및 스마트 헬스케어 솔루션을 개발하여 의료 기술 혁신을 선도합니다.  연구 분야:  생체 신호 및 의료영상 처리  웨어러블 헬스케어 및 스마트 센서 개발  신경공학 및 의료기기 전자회로 설계  졸업 후 진로  반도체 및 집적회로(IC) 설계 엔지니어  반도체 설계 및 공정 엔지니어 (삼성전자, SK하이닉스, TSMC, Intel)  ASIC 및 SoC 설계 엔지니어 (Qualcomm, Nvidia, AMD)  차세대 메모리 및 신소재 반도체 연구원  차세대 통신 및 네트워크 엔지니어  5G/6G 통신 및 위성통신 엔지니어 (LG전자, Ericsson, Nokia)  네트워크 시스템 및 광통신 엔지니어  AI 및 로보틱스 엔지니어  AI 반도체 및 뉴로모픽 칩 설계 엔지니어  자율주행 및 로봇 비전 연구원 (Tesla, 현대자동차, Bosch)  산업 자동화 및 스마트팩토리 개발자  의료전자 및 스마트 센서 연구원  의료기기 및 생체 신호 분석 연구원 (Medtronic, GE Healthcare)  웨어러블 디바이스 및 스마트 헬스케어 연구  연구소 및 공공기관  국책 연구소 및 대학 연구원 (ETRI, KIST, KAIST)  반도체 및 나노전자 기술 연구소  창업 및 스타트업  반도체 및 AI 기반 스타트업 창업  차세대 반도체 기술 혁신 기업 설립  학과의 비전  전자공학부는 차세대 반도체 기술 및 전자공학 연구를 통해 4차 산업혁명을 주도하는 창의적이고 실무 중심의 글로벌 인재를 양성하는 것을 목표로 합니다.  반도체 설계 및 제조 기술 선도  AI 반도체 및 차세대 컴퓨팅 기술 연구 활성화  산업 연계형 반도체 및 통신 기술 실무 교육 강화  국책 사업 유치를 통한 연구 및 교육 환경 개선  전자공학부는 반도체, AI, 통신, 로보틱스, 전력전자 등 다양한 첨단 기술 연구를 통해 글로벌 시장에서 경쟁력을 갖춘 혁신적인 인재를 양성하는 중심 기관으로 자리매김할 것입니다."
    },
    {
        "department_id": 65,
        "학과": "정치외교학과",
        "학과설명": "정치외교학과는 국내 정치 및 국제 정치에 대한 깊이 있는 연구를 통해 한국과 국제 사회의 발전에 기여할 수 있는 창의적이고 윤리적인 인재를 양성하는 학문입니다.  본 학과는 정치와 사회의 다양한 현상을 분석하고, 미래지향적인 정치학 연구를 통해 실천 가능성을 탐색하는 것을 목표로 합니다. 또한, 인접 학문과의 융합적 접근을 통해 정치 현상을 통섭적으로 이해하며, 글로벌 사회의 다양한 쟁점 해결을 위한 네트워크형 거버넌스를 연구합니다.  특히, 한국의 특수한 정치 지형과 역사적 맥락을 체계적으로 탐구하고, 민족공동체의 도덕적 미래를 창조할 수 있는 통합적 사유를 모색하는 것이 학과의 핵심 교육 방향입니다.  졸업 후에는 공공기관, 외교 및 국제기구, 언론, 연구소, 기업 등 다양한 분야에서 정책 분석가, 외교관, 국제협력 전문가, 정치 컨설턴트 등으로 활약할 수 있습니다.  교육과정 정치외교학과의 교육과정은 정치학 이론, 비교 정치, 국제 정치, 외교 및 안보, 정책 연구 등 다양한 분야에서 이론과 실무를 균형 있게 학습할 수 있도록 구성되어 있습니다.  1. 정치학 기초 및 이론 과정 정치학 개론 (Introduction to Political Science) 한국정치론 (Korean Politics) 정치사상사 (History of Political Thought) 현대 정치이론 (Modern Political Theory) 정치사회학 (Political Sociology) 2. 국내 정치 및 거버넌스 연구 헌법과 정치제도 (Constitution and Political Institutions) 정당과 선거 연구 (Political Parties & Elections) 정책학 개론 (Public Policy Studies) 거버넌스와 공공행정 (Governance & Public Administration) 지방자치와 지역정치 (Local Government & Regional Politics) 3. 국제정치 및 외교 과정 국제정치학 개론 (Introduction to International Relations) 국제기구와 글로벌 거버넌스 (International Organizations & Global Governance) 국제정치경제 (International Political Economy, IPE) 외교정책론 (Foreign Policy Analysis) 한반도와 국제정세 (Korean Peninsula & International Affairs) 4. 비교정치 및 세계정세 분석 비교정치학 (Comparative Politics) 민주주의와 독재 연구 (Democracy & Authoritarianism) 유럽·미국·아시아 정치 연구 (Politics of Europe, U.S., and Asia) 국가와 개발 연구 (State & Development Studies) 5. 외교 및 안보 연구 과정 국제 안보론 (International Security Studies) 군사 전략 및 국방 정책 (Military Strategy & Defense Policy) 한미 관계 및 동북아 안보 (US-Korea Relations & Northeast Asian Security) 테러리즘과 국제 분쟁 (Terrorism & International Conflict Studies) 평화 연구 및 외교 협상 (Peace Studies & Diplomatic Negotiation) 6. 정치 데이터 분석 및 정책 연구 과정 정치조사 방법론 (Political Research Methods) 정책 분석 및 평가 (Policy Analysis & Evaluation) 여론 조사 및 데이터 분석 (Public Opinion & Data Analytics) AI 및 빅데이터 기반 정치 예측 (AI & Big Data in Political Forecasting) 7. 연구 및 실습 과정 캡스톤디자인 프로젝트 (Capstone Design in Political Science) 국제기구 및 외교 실무 연수 (Internship in International Organizations & Diplomacy) 정치 컨설팅 및 선거 캠페인 실습 (Political Consulting & Election Campaigns) 연구 분야 및 연구실 정치외교학과는 국내 정치, 국제 정치, 외교 및 안보, 정책 연구 등 다양한 연구 분야를 탐구하며, 국가 및 글로벌 이슈 해결을 위한 연구를 수행하고 있습니다.  국내 정치 및 민주주의 연구실  한국의 정치제도 및 정당 연구 선거와 여론 분석 연구 거버넌스 및 공공정책 연구 국제정치 및 외교 연구실  국제기구 및 외교정책 연구 한미 관계 및 동북아 정세 연구 글로벌 거버넌스 및 국제 협력 연구 국방 및 안보 정책 연구실  한반도 안보 및 군사 전략 연구 국제 안보 및 국방 정책 연구 사이버 안보 및 테러리즘 연구 정치 데이터 분석 연구실  정치 빅데이터 및 인공지능(AI) 연구 여론 조사 및 선거 데이터 분석 정책 예측 및 미래 정치 시나리오 연구 졸업 후 진로 정치외교학과 졸업생들은 정치, 외교, 공공기관, 연구소, 언론, 기업 등 다양한 분야에서 전문가로 활동할 수 있습니다.  공공기관 및 정부 부문  국회의원 보좌관 및 정책 분석가 정부 부처 공무원 (외교부, 통일부, 행정안전부 등) 지방자치단체 및 정책 연구원 외교 및 국제기구 분야  외교관 및 주한·주외 대사관 근무 UN, OECD, WTO 등 국제기구 전문가 국제 NGO 및 글로벌 협력 기관 근무 언론 및 미디어 분야  정치 전문 기자 및 분석가 (KBS, MBC, 조선일보, 중앙일보 등) 방송 및 신문사 정치·국제 뉴스 편집자 유튜브 및 뉴미디어 정치 콘텐츠 제작자 정책 및 컨설팅 분야  싱크탱크 및 연구소 (한국정치학회, 국립외교원, KDI 등) 기업 및 공공정책 컨설턴트 국제 분쟁 및 평화 연구 전문가 선거 및 정치 컨설팅 분야  정당 및 정치 캠페인 기획자 여론 조사 및 선거 전략 분석가 정책 기획 및 공보 담당자 기업 및 경제 연구 분야  글로벌 기업 대외협력 및 홍보 담당 다국적 기업 및 컨설팅 펌(맥킨지, BCG 등) 근무 정치 데이터 분석 및 정책 평가 연구원 학계 및 연구소  국내외 대학원 진학 및 교수·연구직 국내외 정책 연구소 연구원 글로벌 정치 및 외교 연구 전문가 학과의 비전 정치외교학과는 정치학 이론과 실무를 융합한 교육을 통해, 국내 및 국제 사회의 변화를 주도할 창의적이고 실천적인 인재를 양성하는 것을 목표로 합니다.  정치 및 외교 분야의 전문 역량 강화 국내외 공공기관 및 국제기구 진출 지원 미래 정치 및 글로벌 거버넌스 연구 활성화 데이터 기반 정치 및 정책 연구 강화 본 학과는 정치와 외교의 미래를 주도할 글로벌 리더를 양성하는 학문적 중심이 될 것입니다."
    },
    {
        "department_id": 46,
        "학과": "조경학과",
        "학과설명": "조경학과는 자연환경과 도시공간을 대상으로 공원·녹지 조성, 생태 및 경관 보전, 환경 복원 및 지속 가능한 조경 설계를 연구하는 학문입니다. 조경은 자연과 인간이 조화를 이루는 공간을 창출하는 분야로, 공원 설계, 도시 경관 조성, 생태 복원 및 환경 친화적 조경 공간 조성을 통해 더욱 쾌적하고 지속 가능한 환경을 조성하는 것을 목표로 합니다.  본 학과에서는 조경 설계, 조경 시공, 경관 관리, 생태 복원, 스마트 조경 기술 등을 학습하며, 설계부터 시공, 유지·관리까지 조경의 전반적인 과정을 이해하고 실무 능력을 배양합니다.  학과 목표 및 비전 조경학과는 조경 설계, 환경 복원, 지속 가능한 경관 관리 및 스마트 조경 기술을 연구하며, 조경 분야의 전문 인재를 양성하는 것을 목표로 합니다.  1. 조경 설계 및 도시 경관 전문가 양성 공원, 녹지, 정원 설계 및 시공 도시 경관 및 공공 공간 조성 환경 친화적 도시 조경 설계 및 지속 가능한 경관 기획 2. 생태 복원 및 환경 재생 연구 도시 생태 복원 및 환경 보호 기술 연구 녹지 공간 및 자연 경관 보전 습지 및 생태계 복원 연구 3. 스마트 조경 및 디지털 기술 활용 스마트 도시 및 디지털 조경 설계 GIS(지리정보시스템), 드론, AI 기반 경관 분석 및 조경 설계 환경 GIS 실습을 통한 정밀한 조경 데이터 분석 및 활용 4. 실무 중심 교육 강화 및 현장 경험 확대 조경 설계 및 시공 실무 프로젝트 수행 공공기관 및 기업과 협력한 인턴십 및 현장 실습 운영 실무와 연계한 캡스톤디자인 프로젝트 수행 배우는 내용 조경학과에서는 조경 설계, 조경 기술 및 환경 복원을 중심으로 이론과 실습을 병행하는 교육과정을 운영하며, 학년별로 점진적으로 심화된 학습을 진행합니다.  1~2학년: 조경 기초 및 이론 학습 조경제도 및 표현기법: 조경 설계의 기초 도면 작성 및 그래픽 표현법 학습 환경생태학: 생태계의 원리와 환경 보전 이론 연구 조경식물학 및 실습: 조경 설계에 활용되는 식물의 종류와 특성 학습 공간구성론 및 실습: 공간 디자인 및 배치 설계 실습 측량학 및 실습: 조경 설계 및 공사에서 활용되는 측량 기법 연구 서양조경사 & 동양조경사: 조경의 역사적 흐름과 주요 사례 연구 3학년: 조경 응용 및 실무 학습 조경시공 및 적산: 조경 프로젝트의 시공 과정 및 예산 계획 연구 조경식재설계론 및 실습: 조경 식재 계획 및 유지 관리 실습 현대 조경 사례 연구: 최신 조경 설계 및 시공 사례 분석 지형 설계: 지형을 활용한 공간 설계 기법 연구 지속 가능한 조경 설계: 친환경적인 조경 디자인 및 지속 가능성 연구 4학년: 실무 프로젝트 및 연구 개발 경관계획 및 관리론: 도시 경관 및 녹지 관리 전략 연구 조경수 관리학: 조경수의 특성과 유지 관리 기법 학습 졸업설계-캡스톤디자인: 실무 중심의 종합 조경 설계 프로젝트 수행 환경 GIS 실습: GIS를 활용한 조경 데이터 분석 및 공간 설계 연구 자연자원관리론: 자연 자원의 효율적인 활용과 보전 전략 연구 졸업 후 진로 조경학과 졸업생들은 조경 설계, 환경 복원, 공원 및 녹지 조성, 스마트 조경 기술 개발 등 다양한 조경 분야에서 전문가로 활동할 수 있습니다.  1. 조경 설계 및 도시 경관 관련 직업 조경설계사: 공원, 도시 경관 및 공공 공간 설계 경관디자이너: 도시 미관 및 공공 디자인 연구 정원디자이너: 개인 및 공공 정원 설계 2. 조경 시공 및 유지 관리 분야 조경 시공 엔지니어: 조경 프로젝트의 시공 및 관리 녹지 관리 전문가: 도시 녹지 및 공원 유지 관리 3. 생태 복원 및 환경 보전 분야 생태 복원 전문가: 환경 복원 및 지속 가능한 개발 연구 습지 및 자연자원 관리 전문가: 생태계 보호 및 복원 연구 4. 공공기관 및 연구소 국토교통부, 환경부 등 공공기관 조경 담당자 국립공원관리공단, 도시개발연구소 연구원 5. 스마트 조경 및 디지털 기술 활용 분야 스마트 조경 및 도시 데이터 분석 전문가 드론 및 AI 기반 환경 감시 시스템 개발자 학과의 역할과 목표 조경학과는 지속 가능한 도시 및 자연환경을 조성하기 위해 첨단 기술과 전통적인 조경 기법을 융합한 연구와 교육을 통해 실무 중심의 인재를 양성하는 것을 목표로 합니다.  1. 조경 설계 및 시공 역량 강화 공원 및 도시 경관 설계 연구 지속 가능한 녹지 공간 조성 및 환경 복원 연구 2. 스마트 조경 및 첨단 기술 연구 활성화 AI, GIS, 드론 등을 활용한 스마트 조경 기술 연구 친환경 조경 시공 및 지속 가능한 경관 관리 기술 개발 3. 산업체 및 연구기관과 협력한 실무 중심 교육 제공 공공기관 및 조경 관련 기업과 협력하여 실무 프로젝트 수행 인턴십 및 현장 실습을 통한 취업 연계 강화 조경학과는 자연과 인간이 공존하는 지속 가능한 환경을 조성하는 조경 전문가를 양성하여 현대 도시화 및 환경 문제를 해결하는 데 기여하는 것을 목표로 합니다."
    },
    {
        "department_id": 71,
        "학과": "주거환경학과",
        "학과설명": "주거환경학과는 인간과 환경이 조화롭게 공존하는 미래형 주거공간을 창출하기 위한 전문 지식을 연구하고 교육하는 학문입니다. 본 학과는 주택 및 실내공간의 디자인, 주거환경 시스템, 친환경 건축 및 인테리어 소재 개발을 중심으로, 사용자 중심의 주거환경 분석, 공간 디자인, 주택 관리 역량을 배양하는 데 초점을 맞추고 있습니다.  특히, 목재를 활용한 친환경 건축 및 인테리어 소재 개발 연구를 선도하며, 지속 가능한 주거문화 조성과 공간 디자인의 질적 향상을 목표로 합니다. 주거환경의 질을 향상시키기 위한 공간 계획, 친환경 주거재료 연구, 주거복지 정책, 가구 설계 및 주택 시공 등의 다양한 연구를 수행하며, 실무 중심의 현장 교육을 제공합니다.  주거환경학과 졸업생들은 주택 건설업, 인테리어 디자인, 가구 산업, 목재산업, 연구기관 및 공공기관 등 다양한 분야에서 전문가로 활동할 수 있습니다.  주거환경학과의 목표 및 비전 주거환경학과는 친환경적이고 지속 가능한 주거환경 조성을 위한 이론적 지식과 실무 역량을 겸비한 전문가를 양성하는 것을 목표로 합니다.  1. 사용자 중심의 공간 디자인 및 주거환경 기획 전문가 양성 공간디자인 및 사용자 중심의 실내환경 기획 디지털 공간 디자인 및 공간 심리 연구 주거복지 구현을 위한 정책 기획 및 행정 실무 담당 2. 친환경 주거 및 지속 가능한 건축 전문가 양성 녹색 주택 및 친환경 주거 시스템 개발 친환경 건축 및 인테리어 자재 연구 지속 가능한 건축 디자인 및 주택 에너지 절감 기술 연구 3. 목재 기반 친환경 건축·인테리어 소재 개발 및 주거재료 연구 목재 및 신소재 연구를 통한 친환경 인테리어 자재 개발 주택 시공 및 건축 재료의 성능 평가 연구 4. 실무 역량을 갖춘 전문 인력 양성 건축 및 주택 시장 조사 및 정책 연구 공공기관 및 기업과 협력한 인턴십 및 현장 실습 운영 주택 시공 및 건축 설계 실무 프로젝트 수행 주거환경학과의 연구 분야 1. 공간 계획 및 디자인 연구 사용자 중심의 공간 심리 및 행태 분석 단독주택 및 공동주택 설계 연구 상업 및 업무 공간 디자인 연구 주거공간과 시장조사를 통한 사용자 니즈 분석 2. 친환경 주거 및 에너지 효율 연구 녹색 주택 및 친환경 주거 시스템 개발 친환경 건축 및 인테리어 자재 연구 지속 가능한 건축 디자인 및 주택 에너지 절감 기술 연구 3. 주거복지 및 정책 연구 주거환경 개선을 위한 정책 연구 및 기획 특수 계층(고령자, 장애인, 저소득층) 주거복지 연구 주거 관리 및 공동체 커뮤니티 계획 연구 4. 인테리어 및 가구 디자인 연구 DIY 가구 제작 및 친환경 가구 설계 연구 공간별 맞춤형 인테리어 디자인 연구 조명 및 실내공간 코디네이션 연구 5. 건축 및 시공 재료 연구 목재 및 친환경 건축재료 개발 연구 접착 및 기능성 마감재 연구 주택 시공 및 건축재료의 물리적 성능 분석 졸업 후 진로 주거환경학과 졸업생들은 주거환경 설계, 친환경 건축, 실내 디자인, 주거복지 정책 개발 등 다양한 분야에서 활동할 수 있습니다.  1. 건축 및 주택건설 분야 주택건설사 및 건축 설계사무소 공동주택 및 단독주택 시공 전문가 건축 및 인테리어 디자인 사무소 2. 인테리어 디자인 및 가구 산업 인테리어 디자인 및 실내 공간 설계 전문가 DIY 가구 디자인 및 제작 전문가 가구 산업 및 맞춤형 가구 제작 전문가 3. 목재 및 친환경 건축자재 산업 목재 산업 및 신소재 연구 개발 전문가 친환경 건축자재 개발 및 시공 전문가 접착 및 마감재 연구 기업 연구원 4. 주거복지 및 공공기관 공공기관(국토교통부, LH, SH공사 등) 주거복지 담당자 주거복지 정책 연구소 및 행정기관 연구원 주택 및 부동산 컨설팅 전문가 5. 연구 및 학술 분야 주거환경 및 건축재료 연구소 연구원 대학원 진학 및 건축·환경 연구 활동 스마트 건축 및 환경 친화적 건축 연구 취득 가능한 자격증 주거환경학과 학생들은 다양한 전문 자격증을 취득하여 실무 역량을 강화할 수 있습니다.  실내건축기사 건축기사 주거복지사 가구설계 및 제작 관련 자격증 3D 모델링 및 CAD 관련 자격증 주거환경학과의 비전 주거환경학과는 미래 주거 환경 변화에 대응하는 창의적이고 혁신적인 전문 인재를 양성하는 것을 목표로 합니다.  1. 사용자 중심의 공간디자인 및 주거환경 연구 강화 공간디자인 및 인간 중심의 주거환경 연구 스마트홈 및 IoT 기반 주거공간 혁신 연구 2. 친환경 건축 및 지속 가능한 주거환경 연구 친환경 건축자재 개발 및 지속 가능한 주거환경 조성 주택 에너지 효율성 및 생태 친화적 주택 연구 3. 목재 기반 친환경 건축 및 인테리어 소재 개발 선도 목재 및 신소재 기반 친환경 주거환경 설계 친환경 건축 및 인테리어 기술 개발 연구 4. 주거복지 및 공공정책 연구 활성화 사회적 배려 계층을 위한 주거복지 연구 및 정책 개발 주거환경 개선을 위한 지속 가능한 정책 연구 주거환경학과는 미래 주거공간 창출을 위한 융합적 사고를 갖춘 전문가를 양성하여, 지속 가능한 건축 및 인테리어 산업 발전에 기여할 것입니다."
    },
    {
        "department_id": 88,
        "학과": "중어중문학과",
        "학과설명": "중어중문학과는 중국어와 중국 문화에 대한 심도 있는 이해를 바탕으로 전문성을 갖춘 글로벌 인재를 양성하는 학과입니다. 본 학과는 중국어 발음과 성조부터 한자 및 한문 교육까지 체계적인 학습을 제공하며, 중국의 언어학, 문학, 역사, 철학, 정치, 경제, 사회, 문화 등 다양한 영역을 포괄하는 학문적 탐구를 수행합니다.  체계적인 교육과정을 통해 초급부터 고급까지 단계별 중국어 교육을 제공하며, 중국 문학과 문화에 대한 심층적인 연구를 병행하여 학생들이 중국어 활용 능력과 중국에 대한 종합적인 이해력을 갖출 수 있도록 교육합니다.  본 학과는 중국의 유수 대학과 교류 프로그램을 운영하며, 중국어 실력을 향상시키고 문화적 감각을 키울 수 있는 다양한 현장 경험을 제공합니다. 이를 통해 학생들은 중국 관련 다양한 분야에서 전문성을 발휘할 수 있는 역량을 갖추게 됩니다.  학과 목표 중어중문학과는 중국어 및 중국학 연구를 통해 국제적 감각을 갖춘 전문가를 양성하는 것을 목표로 합니다. 이를 위해 다음과 같은 교육 목표를 설정하고 있습니다.  체계적인 중국어 교육을 통한 언어 능력 향상  중국어 발음 및 성조의 정확한 습득 초·중·고급 중국어 회화 및 작문 능력 배양 한자 및 한문 독해 능력 향상 중국 문학·문화·사상에 대한 심도 있는 이해  중국 고전 및 현대 문학 연구 중국의 역사 및 철학 사상 탐구 중국 대중문화 및 현대 사회 분석 중국어를 활용한 실무 역량 강화  중국어 번역 및 통역 기술 습득 중국 경제·정치·외교 관련 지식 함양 한중 무역 및 관광 산업 실무 교육 국제적 감각을 갖춘 중국 전문가 양성  중국 대학 교환학생 프로그램 운영 중국 기업 및 공공기관 인턴십 기회 제공 글로벌 무대에서 경쟁력 있는 인재 양성 연구 분야 중어중문학과는 중국어, 문학, 문화, 사회 전반에 걸친 다양한 연구를 수행하고 있습니다. 주요 연구 분야는 다음과 같습니다.  1. 중국어학 연구 중국어의 음운론, 문법 및 의미론 연구 현대 중국어와 고대 중국어의 구조 비교 중국어의 방언 연구 및 지역별 언어 차이 분석 한·중 언어 비교 및 번역학 연구 2. 중국 문학 연구 중국 고대 문학 (시경, 초사, 당·송 시, 고전소설) 연구 중국 근·현대 문학 (청대 문학, 신문화운동 이후 문학) 연구 중국 대중문학 및 현대 문학 작품 분석 중국 문학 속 사상과 철학 연구 3. 중국 역사 및 문화 연구 중국 전통 사상 및 철학 연구 (유교, 도교, 불교) 중국의 역사적 변천과 정치사 연구 중국의 문화예술 (연극, 영화, 서예, 건축 등) 연구 현대 중국 사회와 대중문화 연구 4. 중국 경제·정치 연구 중국의 현대 경제 구조 및 산업 변화 분석 중국의 외교 정책 및 한·중 관계 연구 중국 비즈니스 및 무역 환경 연구 중국 내 기업문화 및 경제 발전 연구 5. 번역 및 통역 연구 한·중 번역 및 통역 기술 연구 문학, 법률, 경제 분야 번역 연구 실무 중심의 번역 및 통역 실습 교육과정 개요 중어중문학과의 교육과정은 기초 중국어 교육부터 심화 과정까지 체계적으로 구성되어 있습니다.  1학년 (기초 과정) 초급중국어회화 (Basic Chinese Conversation) 중국어 발음과 성조 (Chinese Phonetics and Tones) 한자 및 한문 기초 (Basic Chinese Characters and Classical Chinese) 2학년 (심화 과정) 중국고대문학사 (History of Ancient Chinese Literature) 중국어문법 (Chinese Grammar) 중국 사회와 문화 (Chinese Society and Culture) 중급중국어회화 (Intermediate Chinese Conversation) 3학년 (전공 심화 과정) 중국현대문학사 (History of Modern Chinese Literature) 한·중 비교문화 연구 (Comparative Study of Korean and Chinese Cultures) 중국 정치와 경제 (Chinese Politics and Economy) 중국어 번역 연습 (Chinese Translation Practice) 4학년 (응용 및 실무 과정) 중국어학개론 (Introduction to Chinese Linguistics) 한·중 비즈니스 커뮤니케이션 (Korean-Chinese Business Communication) 중국어 통번역 실습 (Chinese Interpretation and Translation Practicum) 졸업 논문 및 프로젝트 (Graduation Thesis and Project) 졸업 후 진로 중어중문학과 졸업생들은 다양한 분야에서 중국어와 중국 문화에 대한 전문성을 바탕으로 활동할 수 있습니다.  중국어 교육 및 연구 분야  중국어 교사 (초·중·고 및 학원 강사) 대학 및 연구소 연구원 중국학 관련 학술 연구 및 대학원 진학 번역 및 통역 전문가  한·중 번역 및 통역사 국제 회의 통역 및 외교 관련 통역 출판 및 영상 콘텐츠 번역 전문가 국제 무역 및 비즈니스 분야  중국 기업 및 무역회사 근무 글로벌 기업의 중국 시장 담당자 해외 영업 및 마케팅 전문가 관광 및 외교 분야  관광 가이드 및 여행사 운영 외교부, 공공기관 및 국제기구 근무 한·중 국제 협력 프로젝트 담당 언론 및 미디어 분야  중국 관련 기자 및 언론인 방송 및 콘텐츠 제작 관련 직종 중국 SNS 및 유튜브 크리에이터 자격증 및 취득 가능 면허 학생들은 졸업 후 전문성을 높이기 위해 다양한 자격증을 취득할 수 있습니다.  HSK (한어수평고시, 중국어 능력 시험) TSC (중국어 말하기 시험) 중국어 관광통역 안내사 자격증 국제무역사 (중국 시장 관련 무역 자격증) 비즈니스 중국어 (BCT) 학과의 비전 중어중문학과는 언어, 문학, 문화, 경제, 정치 등 다양한 분야를 아우르는 종합적인 중국 연구를 수행하며, 글로벌 시대에 중국과의 교류 및 협력을 주도할 창의적이고 실무적인 전문가를 양성하는 것을 목표로 합니다.  실용적이고 체계적인 중국어 교육 강화 중국 문화 및 사회에 대한 폭넓은 이해 증진 다양한 국제 협력 및 현장 경험 제공 4차 산업혁명 시대에 맞는 중국 전문가 양성 이를 통해 한·중 관계를 이끌어갈 차세대 중국 전문가를 양성하는 중심 학과로 자리매김할 것입니다."
    },
    {
        "department_id": 98,
        "학과": "지구환경과학과",
        "학과설명": "지구환경과학과는 지구를 구성하는 지권(암석 및 지각), 수권(해양 및 담수), 대기권(기후 및 기상), 생물권(생태 및 환경)에서 발생하는 물리적, 화학적, 생물학적 변화를 연구하는 학문입니다. 이를 통해 지구 시스템의 변화와 균형을 이해하고, 지속 가능한 환경 연구 및 해결 방안을 마련하는 것을 목표로 합니다.  학생들은 지질학, 기후과학, 해양학, 환경과학 등의 핵심 개념을 바탕으로 환경 변화와 그 영향을 분석하는 연구를 수행하며, 신재생에너지, 환경 영향 평가, 지구 자원 탐사 등과 관련된 최신 기술을 익히는 실무 중심의 교육과정을 이수합니다.  학과 목표 및 비전 지구환경과학과는 기후변화, 환경오염, 지진 및 자연재해, 에너지 자원 탐사 등 지구환경 문제를 해결하기 위한 과학적 연구와 실무 능력을 갖춘 전문가를 양성하는 것을 목표로 합니다.  지구 시스템의 과학적 이해 및 응용  지질, 기후, 해양, 생태계 변화 연구 지속 가능한 환경 보전 및 자원 관리 연구 자연재해 및 환경 변화 대응 기술 개발  지진, 화산, 태풍 등 자연재해 분석 및 예측 연구 환경 오염 및 기후 변화 대응 기술 연구 지속 가능한 자원 탐사 및 신재생에너지 연구  지하수, 광물, 신재생에너지(지열, 해양에너지) 탐사 및 개발 연구 지속 가능한 에너지 자원 관리 및 활용 방안 연구 산업 및 공공기관과 협력한 실무 중심 교육 강화  지질조사, 환경평가, 기후 데이터 분석 등의 현장 실습 제공 연구소 및 공공기관과 연계한 프로젝트 수행 배우는 내용 지구환경과학과에서는 지구과학, 환경과학, 해양과학, 기후변화, 에너지 자원 탐사 등 다양한 분야를 학습하며, 실험과 연구 중심의 교육과정을 운영합니다.  1~2학년: 기초 및 핵심 이론 학습 일반지구환경과학 (Introduction to Earth & Environmental Science): 지구 시스템 및 환경 변화 기본 개념 학습 지구물리학 및 실험 (Geophysics & Lab): 지구 내부 구조 및 물리적 특성 연구 암석학 및 실험 (Petrology & Lab): 암석의 형성 및 변형 과정 연구 지구화학 (Geochemistry): 지구 내부 화학 조성과 변환 과정 학습 기후과학 (Climate Science): 지구 기후 시스템 및 변화 분석 3학년: 심화 연구 및 응용 학습 환경지질학 (Environmental Geology): 자연재해 및 지질 환경 영향 연구 환경지구화학 (Environmental Geochemistry): 오염 물질의 지구환경 내 거동 분석 해양학 및 실습 (Oceanography & Lab): 해양 환경과 해양 자원 연구 자원탐사 및 평가 (Resource Exploration & Assessment): 에너지 및 광물 자원 탐사 기법 연구 지하수 및 수문학 (Groundwater & Hydrology): 지하수 순환 및 수질 관리 연구 4학년: 실무 프로젝트 및 연구 개발 환경영향평가 (Environmental Impact Assessment, EIA): 환경 변화가 사회 및 생태계에 미치는 영향 분석 신재생에너지 자원탐사 (Renewable Energy Resource Exploration): 지열, 해양에너지, 풍력 등의 신재생에너지 개발 연구 환경 복원 및 오염 관리 (Environmental Remediation & Pollution Management): 토양 및 수질 오염 복원 기술 연구 위성 및 원격탐사 (Remote Sensing & GIS): 위성 영상 분석 및 지형 변화 감시 연구 연구 분야 지구환경과학과에서는 자연재해 예측, 환경보전, 자원 탐사, 신재생에너지 연구 등 다양한 분야에서 학제 간 융합 연구를 수행하며, 주요 연구 분야는 다음과 같습니다.  1. 지구 시스템 및 환경 변화 연구 기후 변화 및 대기 환경 분석 해양 및 해양 생태계 변화 연구 지구 자원 및 토양 오염 연구 2. 자연재해 및 환경 리스크 관리 연구 지진, 화산 활동 및 지질 재해 예측 연구 홍수, 해일, 태풍 등 기후 관련 재해 연구 환경 오염 및 복원 기술 연구 3. 지속 가능한 자원 탐사 및 신재생에너지 연구 지열, 해양에너지, 풍력 발전 등 신재생에너지 개발 연구 지하수 및 지질 자원 탐사 및 평가 연구 광물 자원 및 원소 순환 연구 4. 위성 및 원격탐사 기술 연구 GIS 및 위성 데이터 활용 지형 변화 분석 지구 온난화 및 해수면 변화 모니터링 연구 원격 탐사 기술을 이용한 환경 감시 시스템 개발 졸업 후 진로 지구환경과학과 졸업생들은 환경 연구, 자원 탐사, 기후 및 해양 연구, 공공기관 및 기업의 환경 분석 업무 등 다양한 분야에서 활동할 수 있습니다.  1. 연구소 및 공공기관 한국지질자원연구원(KIGAM) (지질 및 광물 자원 연구) 한국해양과학기술원(KIOST) (해양 환경 및 자원 연구) 기상청 및 국립기상과학원 (기후 변화 및 기상 예측 연구) 한국환경공단 및 환경부 산하기관 (환경 평가 및 복원 연구) 2. 환경 및 자원 탐사 기업 환경 컨설팅 및 환경영향평가 기업 광물 및 에너지 자원 탐사 기업 지하수 및 수질 관리 기업 3. 신재생에너지 및 에너지 기업 신재생에너지(풍력, 태양광, 지열 등) 기업 자원 및 에너지 관련 공기업 (한국석유공사, 한국가스공사) 에너지 관리 및 탄소 배출 저감 연구 기업 4. 토목 및 건설 분야 지반공학 및 토목 엔지니어링 기업 스마트 도시 및 인프라 구축 관련 기업 재해 예방 및 도시계획 연구소 5. 학계 및 연구원 국내외 대학원 진학 및 연구직 지질학, 해양학, 환경과학 분야 연구소 연구원 기후 및 대기환경 분석 연구소 학과의 역할과 목표 지구환경과학과는 지구환경 문제를 과학적으로 분석하고 지속 가능한 해결책을 연구하는 전문가를 양성하여, 기후 변화, 자연재해, 자원 탐사 및 환경 보호 등의 글로벌 이슈를 해결하는 데 기여하는 것을 목표로 합니다.  기후변화 대응 및 자연재해 예측 연구 활성화  기후 변화 및 대기 환경 분석 자연재해 예측 및 환경 리스크 관리 기술 개발 친환경 기술 및 지속 가능한 자원 탐사 연구 확대  신재생에너지 및 자원 탐사 기술 개발 지속 가능한 환경 보호 및 복원 연구 산업 및 연구기관과 협력한 실무 중심 교육 제공  연구소 및 공공기관과 연계한 현장 실습 제공 산업체와 협력한 실무 프로젝트 수행 지구환경과학과는 지속 가능한 지구환경 보전 및 혁신적인 에너지 자원 연구를 수행하여, 미래 환경 문제 해결에 기여하는 글로벌 전문가를 양성하는 것을 목표로 합니다."
    },
    {
        "department_id": 47,
        "학과": "지역건설공학과",
        "학과설명": "지역건설공학과는 농업과 농촌 지역의 지속 가능한 발전과 번영을 목표로, 농촌 기반 시설 구축, 환경 개선, 수자원 관리 및 농업 생산성 향상을 위한 공학적 해결책을 연구하는 학문입니다. 본 학과는 농업 및 농촌 지역 개발의 사회적·경제적·환경적 요구를 충족시키기 위해, 공학적 지식과 실무 능력을 갖춘 전문가를 양성하는 것을 목표로 합니다.  학생들은 농업 수리, 농업 시설, 농촌 계획, 환경 공학 등 농촌 지역 개발과 관련된 다양한 공학적 원리를 배우고, 농지 개간, 관개 및 배수 시스템 구축, 농업 기반 시설 설계 및 시공 등의 실무를 익히며 지속 가능한 농업과 농촌 발전에 기여할 수 있는 역량을 배양합니다.  학과 목표 및 비전 지역건설공학과는 농업과 농촌 지역의 인프라 구축 및 환경 보전을 위해 공학적 지식을 활용하고, 지속 가능한 발전을 위한 미래지향적인 기술을 연구하는 전문가를 양성하는 것을 목표로 합니다.  지속 가능한 농업 및 농촌 개발 전문가 양성  농업 기반 시설 설계 및 유지 관리 연구 농업 생산성 향상을 위한 스마트 농업 및 농업 기계화 연구 환경 친화적 지역 건설 및 농업 환경 관리  농촌 지역의 토양, 수질 및 생태계 보전 연구 농업 및 농촌의 친환경 에너지 활용 방안 연구 스마트 농촌 인프라 구축 및 농업 기술 혁신  농업용 수리 시설의 효율적 관리 및 개선 연구 스마트 농업 및 디지털 농촌 인프라 구축 연구 산업 및 공공기관과 협력한 실무 중심 교육 강화  공기업 및 연구기관과 연계한 실무 프로젝트 수행 국내외 농촌 개발 프로젝트 및 환경 복원 연구 참여 배우는 내용 지역건설공학과에서는 농업 기반 시설, 환경 공학, 수자원 관리, 토목 및 건설 기술 등을 체계적으로 학습하며, 실험과 현장 실습을 병행하는 실무 중심 교육과정을 운영합니다.  1~2학년: 기초 및 핵심 이론 학습 기초공업수학 (Fundamentals of Engineering Mathematics): 공학적 사고 및 수리적 분석 능력 배양 전산제도학 및 실습 (Computer-Aided Drafting & Practice): 기초 설계 도면 작성 및 컴퓨터 활용 지역측량학 및 실습 (Regional Surveying & Practice): 측량 기법 및 지형 분석 실습 공업역학 (Engineering Mechanics): 힘과 운동에 대한 기초 물리 원리 학습 재료역학 및 연습 (Strength of Materials & Practice): 건설 재료의 특성과 강도 분석 유체역학 (Fluid Mechanics): 유체의 흐름과 압력에 대한 기초 연구 3학년: 심화 연구 및 응용 학습 수문학 (Hydrology): 수자원의 순환 및 이용 연구 관개배수공학 (Irrigation & Drainage Engineering): 농업용수 공급 및 배수 기술 연구 농토목시공학 (Agricultural Civil Engineering & Construction): 농업 기반 시설 설계 및 시공 연구 토질 및 기초 (Soil Mechanics & Foundation Engineering): 토양 특성 및 기초 공학 연구 농업시설공학 (Agricultural Facility Engineering): 온실, 축사 및 농업 생산 시설 설계 4학년: 실무 프로젝트 및 연구 개발 농업수리구조공학 (Agricultural Hydraulic Structures Engineering): 수로, 댐 및 저수지 설계 연구 농촌지역계획학 (Rural Area Planning): 농촌 지역 개발 및 도시계획 연구 지역환경공학 (Regional Environmental Engineering): 농업 및 농촌 지역의 환경 보전 연구 환경영향평가 (Environmental Impact Assessment): 농업 개발이 환경에 미치는 영향 분석 스마트 농업 기술 및 자동화 (Smart Agriculture & Automation): 최신 농업 기술 및 데이터 분석 연구 연구 분야 지역건설공학과에서는 농업 인프라 구축, 친환경 농업 개발, 스마트 농업 및 지속 가능한 농촌 지역 개발을 위한 연구를 수행하며, 주요 연구 분야는 다음과 같습니다.  1. 농업 기반 시설 및 토목 공학 연구 관개 및 배수 시설 최적화 연구 농업용 저수지 및 댐 건설 기술 연구 토양 개량 및 지반 공학 연구 2. 수자원 관리 및 농업 환경 공학 연구 수자원 이용 효율 증대 및 관리 연구 지하수 및 수질 보전 연구 농업 배수 시스템 및 홍수 예방 연구 3. 스마트 농업 및 자동화 기술 연구 IoT 및 AI 기반 농업 시설 관리 연구 스마트 팜 및 정밀 농업 기술 연구 농업 기계화 및 자동화 시스템 개발 4. 지속 가능한 농촌 지역 개발 연구 친환경 에너지 및 신재생에너지 활용 연구 기후 변화 대응 및 농업 생태계 복원 연구 농촌 지역의 주거 및 생활 환경 개선 연구 졸업 후 진로 지역건설공학과 졸업생들은 농업 기반 시설 설계 및 시공, 농업 및 환경 연구, 공공기관 및 민간기업의 농촌 지역 개발 업무 등 다양한 분야에서 활동할 수 있습니다.  1. 공공기관 및 연구소 한국농어촌공사 (KRC): 농업 기반 시설 및 수자원 관리 한국수자원공사 (K-Water): 수자원 이용 및 환경 관리 LH공사 (한국토지주택공사): 농촌 및 지역 개발 사업 국립농업과학원 및 환경연구소: 농업 환경 및 신재생에너지 연구 2. 건설 및 설계 관련 기업 농업 기반 시설 설계 및 시공 기업 스마트 팜 및 자동화 농업 관련 기업 친환경 건설 및 녹색 인프라 기업 3. 스마트 농업 및 환경 컨설팅 스마트 농업 및 AI 기반 농업 기업 환경 컨설팅 및 지속 가능한 농촌 개발 기업 기후 변화 대응 및 재생에너지 연구 기업 4. 학계 및 연구직 국내외 대학원 진학 및 연구 활동 국책 연구기관 연구원 (농업 환경 연구소, 국립환경과학원 등) 학과의 역할과 목표 지역건설공학과는 농촌 지역의 지속 가능한 발전과 환경 보전을 위해, 과학적이고 실용적인 접근을 통해 농업 기반 시설을 구축하고, 환경 친화적인 농업 기술을 연구하는 전문가를 양성하는 것을 목표로 합니다.  농업 인프라 구축 및 지속 가능한 농업 기술 개발  스마트 농업 및 정밀 농업 기술 연구 수자원 관리 및 농업 기반 시설 개발 친환경 지역 건설 및 기후 변화 대응 연구  친환경 농업 및 신재생에너지 활용 연구 기후 변화 및 환경 복원 기술 개발 산업 및 공공기관과 협력한 실무 중심 교육 제공  연구소 및 공공기관과 연계한 현장 실습 제공 국내외 농촌 개발 프로젝트 및 환경 복원 연구 참여 지역건설공학과는 농촌 지역 발전과 지속 가능한 농업을 선도할 창의적이고 실천적인 전문가를 양성하여, 미래 농업과 환경 문제 해결에 기여하는 것을 목표로 합니다."
    },
    {
        "department_id": 82,
        "학과": "철학과",
        "학과설명": "철학과는 인간, 세계, 그리고 인간의 행위에 대한 근본적이고 일반적인 철학적 주제를 탐구하는 학문입니다. 철학은 사유의 기초를 형성하고 논리적 사고와 분석력을 길러주며, 이를 통해 학생들은 비판적 사고력과 창의적인 문제 해결 능력을 배양하게 됩니다.  철학을 전공하는 학생들은 논리적 사고, 윤리적 판단, 지식과 존재에 대한 이해, 과학적 탐구, 예술적 감각 등 다양한 분야에서 철학적 반성을 수행하며, 이를 바탕으로 현대 사회의 구조와 방향을 거시적 관점에서 이해할 수 있는 능력을 갖추게 됩니다.  철학은 전통적으로 서양철학과 동양철학을 아우르며, 현대 철학의 흐름을 반영하여 윤리학, 과학철학, 심리철학, 정치철학, 예술철학 등 다양한 응용 철학 분야까지 탐구합니다. 본 학과는 철학 이론과 실천을 결합하여, 다양한 분야에서 철학적 사고를 적용할 수 있는 전문가를 양성하는 것을 목표로 합니다.  학과 목표 철학과는 다음과 같은 교육 목표를 설정하고 있습니다.  철학적 사유 및 논리적 사고 능력 배양  논리적 분석과 비판적 사고 훈련 철학적 개념과 이론에 대한 깊은 이해 합리적인 문제 해결 능력과 논증 능력 강화 전통 철학과 현대 철학의 균형 있는 학습  서양고대철학부터 현대철학까지 철학사 전반에 대한 탐구 동양철학 및 비교철학을 통한 철학적 시야 확장 현대 윤리, 과학, 사회문제에 대한 철학적 접근 능력 함양 사회적·윤리적 책임을 갖춘 철학적 리더 양성  사회 문제에 대한 철학적 분석 및 해결 방안 모색 윤리적 가치 판단 및 공공정책에 대한 철학적 조언 능력 배양 인문학적 소양을 갖춘 미래 지향적 인재 양성 철학의 실천적 활용 및 융합 연구 장려  정치학, 법학, 과학, 예술 등 다양한 분야와 철학의 융합 연구 데이터 분석, 인공지능(AI), 디지털 인문학 등 새로운 기술과의 철학적 연계 철학적 사고를 기반으로 한 창의적 문제 해결 능력 개발 연구 분야 철학과에서는 고전 철학부터 현대 철학, 응용 철학까지 폭넓은 연구를 수행하며, 주요 연구 분야는 다음과 같습니다.  1. 서양철학 연구 서양고대철학 (소크라테스, 플라톤, 아리스토텔레스) 서양중세철학 (아우구스티누스, 토마스 아퀴나스) 서양근세철학 (데카르트, 스피노자, 칸트) 현대유럽철학 (헤겔, 니체, 하이데거, 푸코) 현대영미철학 (러셀, 비트겐슈타인, 퀴네) 2. 동양철학 연구 중국고대철학 (공자, 맹자, 노자, 장자) 서양과 동양철학 비교 연구 한국철학 및 한국사상 연구 (성리학, 실학) 3. 인식론 및 논리학 연구 진리, 지식, 신념에 대한 철학적 탐구 논리학 및 논증 이론 연구 인공지능과 논리적 사고 4. 윤리학 및 정치철학 연구 도덕적 판단과 윤리적 딜레마 분석 현대 사회 윤리 문제 탐구 (환경윤리, 생명윤리, 정보윤리) 정치철학 및 사회정의 이론 연구 5. 과학철학 및 심리철학 연구 과학적 방법론과 철학적 분석 인공지능(AI) 및 기술철학 연구 인간 정신과 의식에 대한 철학적 탐구 6. 예술철학 및 역사철학 연구 예술과 미학적 경험의 철학적 의미 연구 역사 속 철학적 사조의 변화와 흐름 분석 교육과정 개요 철학과의 교육과정은 기초 철학 개념부터 심화 과정까지 체계적으로 구성되어 있습니다.  1학년 (기초 과정) 논리학 (Logic) 서양고대철학 (Ancient Western Philosophy) 중국고대철학 (Ancient Chinese Philosophy) 2학년 (심화 과정) 인식론 (Epistemology) 윤리학 (Ethics) 형이상학 (Metaphysics) 서양중세철학 (Medieval Western Philosophy) 3학년 (전공 심화 과정) 서양근세철학 (Modern Western Philosophy) 현대유럽철학 (Contemporary European Philosophy) 현대영미철학 (Contemporary Anglo-American Philosophy) 성리학 (Neo-Confucianism) 4학년 (응용 및 실무 과정) 과학철학 (Philosophy of Science) 역사철학 (Philosophy of History) 심리철학 (Philosophy of Mind) 예술철학과 사랑 (Aesthetics and Philosophy of Love) 졸업 후 진로 철학 전공자는 논리적 사고력과 비판적 분석력을 기반으로 다양한 분야에서 활동할 수 있는 융합형 인재로 성장할 수 있습니다.  학계 및 연구 분야  대학원 진학 후 연구자 및 교수직 철학 연구소 및 인문학 연구소 연구원 고전 철학 및 현대 철학 연구 교육 및 공공기관  중·고등학교 윤리 및 철학 교사 교육 관련 기관 및 철학 콘텐츠 개발 공공기관 정책 연구 및 기획 언론 및 출판 분야  출판사, 언론사 기자 및 칼럼니스트 인문학 관련 콘텐츠 기획 및 제작 인공지능(AI) 및 철학적 알고리즘 연구 기업 및 컨설팅 분야  인공지능 및 데이터 윤리 연구원 기업의 철학적 컨설팅 및 윤리 경영 전문가 빅데이터 및 AI 기반 인공지능 철학 분석 정치 및 법조계  정치 컨설턴트 및 정책 분석가 법학 대학원 진학 후 변호사 및 판사 공공기관 및 국제기구 연구원 자격증 및 취득 가능 면허 철학 교육 관련 교원 자격증 논리 및 사고력 평가 전문가 자격 출판 및 편집 관련 자격증 학과의 비전 철학과는 고전적 철학 전통을 바탕으로 현대 사회의 문제를 철학적으로 해결할 수 있는 창의적 사고력을 갖춘 인재를 양성하는 것을 목표로 합니다.  비판적 사고와 논리적 분석 능력 배양 사회문제 및 기술 발전에 대한 철학적 접근 강화 융합형 철학 교육을 통한 다학제적 사고력 강화 이를 통해 철학과 졸업생들은 학문적 깊이와 실무적 역량을 갖춘 창의적 사고의 리더로 성장할 것입니다."
    },
    {
        "department_id": 24,
        "학과": "컴퓨터인공지능학부",
        "학과설명": "컴퓨터인공지능학부는 컴퓨터과학(CS)과 인공지능(AI), 데이터 분석, 클라우드 컴퓨팅, 사이버 보안, 소프트웨어 개발, 블록체인, 네트워크 및 운영체제 등 최신 IT 기술을 연구하고 실무에 적용할 수 있는 전문가를 양성하는 학문입니다.  본 학부는 전통적인 컴퓨터과학의 핵심 원리를 기반으로 AI 및 빅데이터 시대에 맞춘 소프트웨어 개발, 데이터 처리, 정보보호 기술을 학습할 수 있도록 구성되어 있습니다. 학생들은 프로그래밍, 알고리즘, 데이터 모델링, 네트워크 및 운영체제, 클라우드 및 보안 기술을 아우르는 폭넓은 커리큘럼을 학습하며, 산학 협력 프로젝트, 캡스톤디자인, AI 기반 소프트웨어 개발 실습 등을 통해 실제 산업에서 요구하는 실무 능력을 배양합니다.  특히, AI 및 데이터 과학과 같은 최신 기술뿐만 아니라, 전통적인 컴퓨터과학 개념(컴퓨터 구조, 운영체제, 알고리즘, 데이터베이스, 컴파일러, 네트워크, 보안, 시스템 설계 등)을 함께 학습하여, 이론적 기초와 실무 역량을 겸비한 IT 전문가를 양성하는 것을 목표로 합니다.  학과 목표 및 핵심 역량 컴퓨터과학(CS) 및 소프트웨어 개발 역량 강화  Python, C++, Java, JavaScript 등 다양한 프로그래밍 언어 학습 자료구조 및 알고리즘 최적화 기술 학습 및 문제 해결 능력 배양 소프트웨어 공학 및 대규모 소프트웨어 개발 방법론 연구 운영체제 및 시스템 설계 역량 배양  운영체제(OS) 구조 및 시스템 관리 최적화 연구 파일 시스템, 멀티스레딩, 메모리 관리, 네트워크 통신 최적화 리눅스 및 윈도우 기반 시스템 개발 및 관리 기술 습득 컴퓨터 네트워크 및 보안 기술 연구  컴퓨터 네트워크 및 클라우드 환경에서의 보안 및 최적화 연구 사이버 보안, 해킹 대응, 네트워크 침입 탐지 및 암호화 기술 연구 블록체인 기반 데이터 보안 및 무결성 검증 기술 연구 데이터 처리 및 빅데이터 분석 기술 학습  SQL 및 NoSQL을 활용한 대규모 데이터베이스 설계 및 최적화 클라우드 환경에서의 빅데이터 처리 및 분산 데이터 시스템 연구 데이터마이닝 및 AI 기반 데이터 분석 기법 학습 AI 및 데이터 중심의 최신 기술 학습  머신러닝 및 딥러닝 기반 데이터 예측 및 최적화 연구 컴퓨터 비전, 자연어 처리(NLP), 시계열 분석 등의 AI 응용 연구 대규모 언어 모델(LLM) 및 생성형 AI 연구 연구 분야 및 연구실 1. 컴퓨터 시스템 및 운영체제 연구실 운영체제(OS) 커널 및 시스템 설계 연구 파일 시스템 및 멀티스레딩 최적화 연구 분산 시스템 및 고성능 컴퓨팅 연구 2. 소프트웨어 공학 및 대규모 시스템 개발 연구실 소프트웨어 개발 방법론 및 자동화 테스트 연구 대규모 소프트웨어 설계 및 유지보수 최적화 연구 프로그래밍 언어 및 컴파일러 연구 3. 컴퓨터 네트워크 및 보안 연구실 컴퓨터 네트워크 최적화 및 분산 컴퓨팅 연구 사이버 보안, 블록체인, 암호화 기술 연구 AI 기반 이상 탐지 및 네트워크 보안 연구 4. 빅데이터 및 데이터베이스 연구실 클라우드 기반 빅데이터 처리 및 분석 연구 대규모 데이터베이스 및 분산 데이터 시스템 연구 데이터마이닝 및 AI 기반 데이터 예측 모델 연구 5. 인공지능 및 대규모 언어 모델(LLM) 연구실 GPT 및 Transformer 기반 언어 모델 연구 컴퓨터 비전 및 의료 AI 응용 연구 AI 기반 추천 시스템 및 데이터 자동화 연구  1. 대규모 언어 모델(LLM) 및 생성형 AI 연구실 Transformer 기반 언어 모델 연구 및 최적화 LLM을 활용한 텍스트 생성 및 데이터 분석 응용 연구 멀티모달 AI(텍스트+이미지+음성) 모델 연구 2. 빅데이터 및 클라우드 컴퓨팅 연구실 대규모 데이터 저장 및 분산 처리 기술 연구 클라우드 컴퓨팅 환경에서의 AI 데이터 분석 최적화 연구 실시간 데이터 스트리밍 및 데이터 시각화 연구 3. 의료 AI 및 바이오 데이터 분석 연구실 AI 기반 의료영상 분석 및 암 진단 모델 연구 의료 빅데이터를 활용한 질병 예측 및 신약 개발 AI 연구 생체 신호 분석 및 개인 맞춤형 의료 AI 모델 개발 4. 자율주행 및 스마트 모빌리티 AI 연구실 AI 기반 자율주행 차량 센서 데이터 분석 및 최적화 딥러닝 기반 차량 객체 탐지 및 교통 패턴 분석 도로 예측 및 스마트 교통 시스템 최적화 5. 산업 AI 및 자동화 연구실 공장 자동화를 위한 AI 기반 생산 최적화 연구 예측 유지보수(Predictive Maintenance) 모델 연구 스마트 팩토리 및 로봇 자동화 기술 연구  1~2학년: 기초 및 핵심 CS 이론 학습 프로그래밍 기초 (Introduction to Programming): Python, C, Java 등의 기초 자료구조 (Data Structures): 데이터 분석을 위한 효율적인 데이터 구조 설계 이산수학 (Discrete Mathematics): 알고리즘 및 논리적 사고 학습 컴퓨터 구조 (Computer Architecture): 하드웨어 및 시스템 이해 운영체제 (Operating Systems): 멀티스레딩, 파일 시스템, 메모리 관리 3학년: 심화 연구 및 응용 학습 알고리즘 (Algorithms): 데이터 최적화 및 예측 모델 개발 컴퓨터 네트워크 (Computer Networks): 네트워크 프로토콜 및 최적화 연구 데이터베이스 (Database Systems): SQL 및 데이터베이스 설계 보안 및 블록체인 (Cybersecurity & Blockchain): 네트워크 보안 및 암호화 연구 소프트웨어 공학 (Software Engineering): 대규모 소프트웨어 개발 방법론 연구 4학년: 실무 프로젝트 및 연구 개발 캡스톤디자인 (Capstone Design Project): 실무 프로젝트 수행 클라우드 컴퓨팅 (Cloud Computing): 분산 데이터 시스템 최적화 AI 및 머신러닝 (AI & Machine Learning): 머신러닝 모델 연구 및 적용 대규모 언어 모델(LLM) 연구: 텍스트 생성 AI 및 자연어 처리 연구 졸업 후 진로 소프트웨어 엔지니어 및 시스템 개발자  소프트웨어 엔지니어 (Google, Amazon, Microsoft) 클라우드 시스템 엔지니어 (AWS, Google Cloud, Azure) 데이터베이스 관리자 (Database Administrator, DBA) AI 및 빅데이터 전문가  데이터 사이언티스트 (Data Scientist) 머신러닝 엔지니어 (Machine Learning Engineer) AI 기반 데이터 분석 및 최적화 연구원 컴퓨터 네트워크 및 보안 전문가  사이버 보안 전문가 (Cybersecurity Expert) 네트워크 관리자 (Network Security Analyst) 블록체인 개발자 (Blockchain Developer) 연구소 및 공공기관 IT 연구원  국책 연구소 연구원 (ETRI, KIST, NIPA) 공공기관 IT 보안 및 데이터 분석 전문가 국내외 IT 기업 및 스타트업 진출  컴퓨터과학(CS)과 AI 기술을 융합한 IT 전문가 양성  소프트웨어 개발부터 빅데이터, AI까지 포괄적인 기술 교육 제공 운영체제, 네트워크, 데이터베이스 등 CS 기초와 AI 융합 기술 학습 산업 맞춤형 IT 및 데이터 기술 교육 강화  기업과 연계한 실전 프로젝트 및 연구 수행 대규모 시스템 설계 및 최적화 기술 개발 산학 협력 및 글로벌 경쟁력 강화  국내외 IT 기업 및 연구소와 협력하여 실무 중심 교육 제공 글로벌 IT 및 AI 연구 프로젝트 참여 기회 제공 컴퓨터인공지능학부는 CS, AI, 빅데이터, 보안, 네트워크, 소프트웨어 개발 등 최신 IT 기술을 활용하여 미래를 주도할 창의적이고 실무 중심의 전문가를 양성하는 것을 목표로 합니다"
    },
    {
        "department_id": 27,
        "학과": "토목환경자원에너지공학부(환경공학)",
        "학과설명": "환경공학 전공은  수질환경, 대기환경, 폐기물 관리, 토양 및 지하수 오염 등 다양한 환경 분야에서 지속 가능한 기술 개발과 환경 보전을 위한 연구와 교육을 수행하고 있습니다.  최근 기후변화, 신재생에너지, 자원순환, 탄소중립 등의 글로벌 환경 이슈에 대응하기 위해 교육과정을 지속적으로 개편하고 있으며, 산업체 및 연구기관과의 협력을 통해 실무 중심의 교육을 강화하고 있습니다. 그 결과, 2018년 산업계 관점 대학평가에서 환경공학 분야 최우수 대학으로 선정되었으며, 2013년부터 공학교육인증제도를 도입하여 체계적인 교육과정을 운영하고 있습니다.  본 전공은 친환경 기술 개발 및 환경 보호를 위한 실용적인 해결책을 연구하며, 학생들이 환경공학 분야에서 혁신적인 전문가로 성장할 수 있도록 지원합니다.  학과 목표 환경공학 전공은 지속 가능한 환경을 조성하고, 미래 친환경 기술을 개발하며, 실무 중심의 환경공학 인재를 양성하는 것을 목표로 합니다.  환경오염 문제 해결을 위한 기술 개발  수질, 대기, 폐기물, 토양 및 지하수 오염 방지 및 복원 기술 연구 친환경 및 지속가능한 에너지 개발 기후변화 및 탄소중립 대응  탄소 저감 및 이산화탄소 포집 및 활용(CCUS) 기술 연구 신재생에너지 및 지속가능한 자원순환 시스템 연구 스마트 환경관리 및 디지털 기술 접목  인공지능(AI) 및 빅데이터를 활용한 환경 데이터 분석 스마트 환경 모니터링 시스템 개발 산학 협력 및 글로벌 환경 정책 연구  환경 산업체 및 공공기관과 협력하여 실무형 인재 양성 국내외 환경 정책 및 지속 가능한 개발 연구 연구 분야 환경공학 전공에서는 다양한 환경 이슈를 해결하기 위한 연구를 수행하고 있으며, 주요 연구 분야는 다음과 같습니다.  1. 수질환경 및 대기환경 연구 하·폐수 처리 및 정화 기술 개발 미세먼지 및 유해가스 저감 기술 연구 친환경 물 관리 및 수자원 보호 기술 2. 폐기물 관리 및 자원순환 연구 폐기물의 효율적 처리 및 자원화 기술 개발 플라스틱 재활용 및 산업 폐기물 저감 기술 연구 친환경 바이오매스 및 에너지 생산 기술 연구 3. 탄소중립 및 신재생에너지 연구 탄소 포집 및 활용(CCUS) 기술 개발 태양광, 풍력, 바이오매스 에너지 기술 연구 수소연료 및 친환경 에너지 저장 기술 연구 4. 토양 및 지하수 오염 복원 연구 오염된 토양 및 지하수 정화 기술 연구 중금속 및 유기물 오염 제거 기술 개발 환경 지질 및 지하수 모델링 연구 5. 환경 데이터 분석 및 스마트 기술 연구 환경 센서 및 모니터링 시스템 개발 AI 및 빅데이터 기반 환경 데이터 분석 연구 지속가능한 도시 및 스마트 환경 기술 연구 교육과정 개요 본 전공의 교육과정은 환경공학의 기초부터 실무 적용까지 폭넓게 다룰 수 있도록 구성되어 있습니다.  1학년 (기초 과정) 환경공학 개론 (Introduction to Environmental Engineering) 기초 화학 및 물리학 (Basic Chemistry & Physics) 수학 및 통계학 (Mathematics & Statistics for Environmental Science) 2학년 (심화 과정) 수질오염 및 정화 기술 (Water Pollution & Treatment) 대기오염 및 저감 기술 (Air Pollution Control) 자원환경공학 (Resource & Environmental Engineering) 3학년 (응용 과정) 폐기물 처리 및 재활용 기술 (Waste Management & Recycling) 신재생에너지 및 탄소저감기술 (Renewable Energy & Carbon Reduction) 환경법 및 정책 연구 (Environmental Policy & Law) 4학년 (실무 및 연구 과정) 환경 데이터 분석 및 모델링 (Environmental Data Analysis & Modeling) 스마트 환경 관리 시스템 (Smart Environmental Management) 캡스톤 디자인 프로젝트 (Capstone Design in Environmental Engineering) 환경공학 실험 및 현장 실습 (Environmental Engineering Lab & Fieldwork) 졸업 후 진로 환경공학 전공 졸업생들은 환경 공학 및 자원·에너지 관련 산업, 연구소, 공공기관 등 다양한 분야에서 전문가로 활동할 수 있습니다.  1. 환경 및 에너지 산업 분야 환경 컨설팅 및 친환경 기술 개발 기업 신재생에너지 기업 (태양광, 풍력, 바이오에너지 관련 기업) 수처리 및 대기오염 방지 기술 관련 기업 2. 공공기관 및 연구소 환경부, 국토교통부, 에너지 관련 정부 기관 한국환경공단, 한국수자원공사, 한국에너지기술연구원 국립환경과학원, 한국지질자원연구원 등 연구소 3. 국제기구 및 NGO UN환경계획(UNEP), 세계자연기금(WWF) 국제환경보호단체 및 기후변화 대응 기관 4. 대학원 및 연구 개발 분야 환경공학 및 지속가능한 에너지 연구 대학원 진학 첨단 친환경 기술 및 신재생에너지 연구소 연구원 취득 가능 자격증 졸업생들은 다양한 환경 및 에너지 관련 자격증을 취득하여 전문성을 높일 수 있습니다.  환경기사 (Water Quality Engineer, Air Pollution Engineer 등) 신재생에너지발전설비기사 대기환경기사, 수질환경기사, 폐기물처리기사 자원공학기사, 광업기사 환경영향평가사 학과의 비전 환경공학 전공은 지속 가능한 환경 보호 및 자원·에너지 개발을 위한 연구를 선도하며, 실무형 환경공학 전문가를 양성하는 것을 목표로 합니다.  탄소중립 및 친환경 에너지 연구 강화 산학 협력 및 국제 연구 프로젝트 참여 확대 4차 산업혁명 시대의 스마트 환경 기술 개발 및 적용 본 학과는 현대 사회의 환경 및 에너지 문제 해결을 위한 혁신적인 기술과 정책을 개발하며, 졸업생들이 국내외 환경 및 자원·에너지 산업에서 글로벌 경쟁력을 갖춘 전문가로 성장할 수 있도록 지원할 것입니다."
    },
    {
        "department_id": 25,
        "학과": "토목환경자원에너지공학부(자원에너지공학)",
        "학과설명": "환경공학 전공은 1981년 설립되어 현재까지 1,600명 이상의 환경공학 전문가를 배출하였으며, 수질환경, 대기환경, 폐기물 관리, 토양 및 지하수 오염 등 다양한 환경 분야에서 지속 가능한 기술 개발과 환경 보전을 위한 연구와 교육을 수행하고 있습니다.  최근 기후변화, 신재생에너지, 자원순환, 탄소중립 등의 글로벌 환경 이슈에 대응하기 위해 교육과정을 지속적으로 개편하고 있으며, 산업체 및 연구기관과의 협력을 통해 실무 중심의 교육을 강화하고 있습니다. 그 결과, 2018년 산업계 관점 대학평가에서 환경공학 분야 최우수 대학으로 선정되었으며, 2013년부터 공학교육인증제도를 도입하여 체계적인 교육과정을 운영하고 있습니다.  본 전공은 친환경 기술 개발 및 환경 보호를 위한 실용적인 해결책을 연구하며, 학생들이 환경공학 분야에서 혁신적인 전문가로 성장할 수 있도록 지원합니다.  학과 목표 환경공학 전공은 지속 가능한 환경을 조성하고, 미래 친환경 기술을 개발하며, 실무 중심의 환경공학 인재를 양성하는 것을 목표로 합니다.  환경오염 문제 해결을 위한 기술 개발  수질, 대기, 폐기물, 토양 및 지하수 오염 방지 및 복원 기술 연구 친환경 및 지속가능한 에너지 개발 기후변화 및 탄소중립 대응  탄소 저감 및 이산화탄소 포집 및 활용(CCUS) 기술 연구 신재생에너지 및 지속가능한 자원순환 시스템 연구 스마트 환경관리 및 디지털 기술 접목  인공지능(AI) 및 빅데이터를 활용한 환경 데이터 분석 스마트 환경 모니터링 시스템 개발 산학 협력 및 글로벌 환경 정책 연구  환경 산업체 및 공공기관과 협력하여 실무형 인재 양성 국내외 환경 정책 및 지속 가능한 개발 연구 연구 분야 환경공학 전공에서는 다양한 환경 이슈를 해결하기 위한 연구를 수행하고 있으며, 주요 연구 분야는 다음과 같습니다.  1. 수질환경 및 대기환경 연구 하·폐수 처리 및 정화 기술 개발 미세먼지 및 유해가스 저감 기술 연구 친환경 물 관리 및 수자원 보호 기술 2. 폐기물 관리 및 자원순환 연구 폐기물의 효율적 처리 및 자원화 기술 개발 플라스틱 재활용 및 산업 폐기물 저감 기술 연구 친환경 바이오매스 및 에너지 생산 기술 연구 3. 탄소중립 및 신재생에너지 연구 탄소 포집 및 활용(CCUS) 기술 개발 태양광, 풍력, 바이오매스 에너지 기술 연구 수소연료 및 친환경 에너지 저장 기술 연구 4. 토양 및 지하수 오염 복원 연구 오염된 토양 및 지하수 정화 기술 연구 중금속 및 유기물 오염 제거 기술 개발 환경 지질 및 지하수 모델링 연구 5. 환경 데이터 분석 및 스마트 기술 연구 환경 센서 및 모니터링 시스템 개발 AI 및 빅데이터 기반 환경 데이터 분석 연구 지속가능한 도시 및 스마트 환경 기술 연구 교육과정 개요 본 전공의 교육과정은 환경공학의 기초부터 실무 적용까지 폭넓게 다룰 수 있도록 구성되어 있습니다.  1학년 (기초 과정) 환경공학 개론 (Introduction to Environmental Engineering) 기초 화학 및 물리학 (Basic Chemistry & Physics) 수학 및 통계학 (Mathematics & Statistics for Environmental Science) 2학년 (심화 과정) 수질오염 및 정화 기술 (Water Pollution & Treatment) 대기오염 및 저감 기술 (Air Pollution Control) 자원환경공학 (Resource & Environmental Engineering) 3학년 (응용 과정) 폐기물 처리 및 재활용 기술 (Waste Management & Recycling) 신재생에너지 및 탄소저감기술 (Renewable Energy & Carbon Reduction) 환경법 및 정책 연구 (Environmental Policy & Law) 4학년 (실무 및 연구 과정) 환경 데이터 분석 및 모델링 (Environmental Data Analysis & Modeling) 스마트 환경 관리 시스템 (Smart Environmental Management) 캡스톤 디자인 프로젝트 (Capstone Design in Environmental Engineering) 환경공학 실험 및 현장 실습 (Environmental Engineering Lab & Fieldwork) 졸업 후 진로 환경공학 전공 졸업생들은 환경 공학 및 자원·에너지 관련 산업, 연구소, 공공기관 등 다양한 분야에서 전문가로 활동할 수 있습니다.  1. 환경 및 에너지 산업 분야 환경 컨설팅 및 친환경 기술 개발 기업 신재생에너지 기업 (태양광, 풍력, 바이오에너지 관련 기업) 수처리 및 대기오염 방지 기술 관련 기업 2. 공공기관 및 연구소 환경부, 국토교통부, 에너지 관련 정부 기관 한국환경공단, 한국수자원공사, 한국에너지기술연구원 국립환경과학원, 한국지질자원연구원 등 연구소 3. 국제기구 및 NGO UN환경계획(UNEP), 세계자연기금(WWF) 국제환경보호단체 및 기후변화 대응 기관 4. 대학원 및 연구 개발 분야 환경공학 및 지속가능한 에너지 연구 대학원 진학 첨단 친환경 기술 및 신재생에너지 연구소 연구원 취득 가능 자격증 졸업생들은 다양한 환경 및 에너지 관련 자격증을 취득하여 전문성을 높일 수 있습니다.  환경기사 (Water Quality Engineer, Air Pollution Engineer 등) 신재생에너지발전설비기사 대기환경기사, 수질환경기사, 폐기물처리기사 자원공학기사, 광업기사 환경영향평가사 학과의 비전 환경공학 전공은 지속 가능한 환경 보호 및 자원·에너지 개발을 위한 연구를 선도하며, 실무형 환경공학 전문가를 양성하는 것을 목표로 합니다.  탄소중립 및 친환경 에너지 연구 강화 산학 협력 및 국제 연구 프로젝트 참여 확대 4차 산업혁명 시대의 스마트 환경 기술 개발 및 적용 본 학과는 현대 사회의 환경 및 에너지 문제 해결을 위한 혁신적인 기술과 정책을 개발하며, 졸업생들이 국내외 환경 및 자원·에너지 산업에서 글로벌 경쟁력을 갖춘 전문가로 성장할 수 있도록 지원할 것입니다."
    },
    {
        "department_id": 26,
        "학과": "토목환경자원에너지공학부(토목공학)",
        "학과설명": "토목공학은 국가 및 사회의 기반이 되는 인프라(도로, 철도, 항만, 공항, 교량, 터널 등)를 계획, 설계, 건설, 유지 및 관리하는 학문으로, 지속 가능한 발전과 자연재해 대응, 스마트 인프라 기술을 연구하는 분야입니다.  토목환경자원에너지공학부(토목공학)는 사회기반시설의 안전성과 효율성을 극대화하고, 첨단 건설 기술과 환경친화적 공학을 융합하여 지속 가능한 인프라 구축을 목표로 합니다.  본 학부에서는 구조공학, 수공학, 지반공학, 교통공학, 환경공학 등 토목공학의 핵심 분야를 학습하며, 최신 공학 기술을 적용한 스마트 건설 및 친환경 인프라 개발을 연구합니다.  학과 목표 및 비전 토목공학은 경제 발전과 국민 생활 향상을 위해 필수적인 인프라를 구축하고 유지하는 학문으로, 본 학부는 다음과 같은 목표를 설정하고 있습니다.  사회기반시설의 안전한 설계 및 운영 기술 개발  교량, 터널, 철도, 항만, 공항 등의 구조물 설계 및 유지보수 기술 연구 내진공학 및 재난 대응 시스템 개발 친환경 및 지속 가능한 인프라 구축  도시 및 지역 계획을 반영한 친환경 토목기술 연구 기후 변화 대응을 위한 수자원 및 하천 관리 기술 연구 스마트 건설 및 디지털 기술 적용  BIM(Building Information Modeling) 및 디지털 트윈 기술 활용 AI 및 빅데이터 기반 건설 자동화 연구 산업체 및 연구기관과 연계한 실무 중심 교육 제공  건설사 및 연구소와 협력하여 인턴십 및 캡스톤디자인 프로젝트 운영 국내외 공공기관과 협력한 연구 및 기술 개발 참여 배우는 내용 토목공학 교육과정은 기초 공학 이론부터 응용 기술까지 체계적으로 구성되어 있으며, 실험 및 실습을 통해 실무 역량을 배양합니다.  1~2학년: 기초 및 핵심 이론 학습 공학수학 (Engineering Mathematics): 수리적 분석 및 문제 해결 능력 습득 기초역학 (Fundamentals of Mechanics): 힘과 구조물의 거동 분석 재료역학 (Mechanics of Materials): 건설 재료의 특성과 역학적 거동 연구 구조역학 (Structural Mechanics): 구조물의 안전성과 강도 해석 수리학 (Hydraulics): 유체 흐름 및 수자원 관리 기초 학습 3학년: 심화 연구 및 응용 학습 철근콘크리트설계 (Reinforced Concrete Design): 철근콘크리트 구조 설계 토질역학 (Soil Mechanics): 지반 공학 및 기초 설계 도로공학 (Highway Engineering): 도로 설계 및 유지보수 기술 연구 교량공학 (Bridge Engineering): 교량 설계 및 내진 공학 연구 수자원공학 (Water Resources Engineering): 수자원 활용 및 홍수 대응 연구 4학년: 실무 프로젝트 및 연구 개발 토목시공학 (Construction Engineering): 건설 현장 시공 기술 연구 환경영향평가 (Environmental Impact Assessment): 친환경 건설 기술 연구 스마트 건설 및 BIM (Smart Construction & BIM): 디지털 건설 기술 활용 연구 캡스톤디자인 (Capstone Design Project): 산업체 및 연구소와 협력한 실무 프로젝트 수행 연구 분야 토목공학 분야에서는 첨단 건설 기술, 지속 가능한 인프라 개발, 자연재해 대응 및 스마트 시티 구축을 위한 연구가 활발히 진행되고 있습니다.  1. 구조공학 및 내진공학 연구 내진 설계 및 구조물 안전성 평가 초고층 건물 및 대형 인프라 구조물 설계 신소재 및 친환경 건축 자재 연구 2. 지반공학 및 터널공학 연구 지반 안정성 분석 및 기초 공학 연구 터널 및 지하공간 활용 기술 개발 지반 보강 및 토양 오염 정화 연구 3. 수자원 및 환경공학 연구 수자원 관리 및 하천 복원 기술 연구 도시 홍수 예방 및 기후 변화 대응 기술 개발 지속 가능한 수자원 개발 및 해양 공학 연구 4. 스마트 건설 및 디지털 트윈 연구 BIM 및 인공지능 기반 건설 자동화 연구 빅데이터 및 IoT를 활용한 스마트 인프라 관리 3D 프린팅 및 로봇을 이용한 건설 기술 연구 졸업 후 진로 토목공학 졸업생들은 국내외 인프라 산업, 공공기관, 연구소 등 다양한 분야에서 전문가로 활동할 수 있습니다.  1. 건설 및 인프라 산업 국내외 대형 건설사 (삼성물산, 현대건설, 대림산업, GS건설 등) 스마트 시티 및 인프라 개발 관련 기업 구조물 설계 및 유지보수 기업 2. 공공기관 및 연구소 한국도로공사(KR): 도로 및 교량 설계 및 유지보수 한국수자원공사(K-Water): 수자원 관리 및 홍수 예방 연구 국토교통부, 지방자치단체: 도시 계획 및 기반시설 정책 담당 국립환경과학원, 한국건설기술연구원: 친환경 건설 및 기후 변화 대응 연구 3. 스마트 건설 및 기술 기업 BIM 및 디지털 트윈 기술 개발 회사 인공지능 기반 건설 자동화 솔루션 기업 3D 프린팅 및 로봇을 활용한 스마트 건설 기술 연구소 4. 학계 및 연구직 국내외 대학원 진학 및 연구 활동 건설 및 환경 연구소 연구원 공공기관 및 국책 연구기관 연구직 학과의 역할과 목표 토목환경자원에너지공학부(토목공학)는 첨단 토목 기술을 활용하여 지속 가능한 인프라를 구축하고, 친환경적이고 안전한 도시 및 사회기반시설을 설계하는 전문가를 양성하는 것을 목표로 합니다.  지속 가능한 인프라 및 스마트 건설 기술 개발  친환경 건설 및 탄소 저감 기술 연구 스마트 시티 및 디지털 트윈 기반 인프라 개발 재난 예방 및 기후 변화 대응 연구  자연재해 대응을 위한 내진 및 홍수 예방 기술 연구 스마트 홍수 및 수자원 관리 시스템 개발 산업 및 공공기관과 연계한 실무 중심 교육 제공  국내외 인턴십 및 연구 프로젝트 지원 공공기관 및 기업과 협력하여 연구 및 개발 프로젝트 수행 토목환경자원에너지공학부(토목공학)는 미래 사회의 지속 가능한 발전을 위한 핵심 인재를 양성하여, 국내 및 글로벌 시장에서 경쟁력을 갖춘 토목공학 전문가를 배출하는 것을 목표로 합니다."
    },
    {
        "department_id": 99,
        "학과": "통계학과",
        "학과설명": "통계학과는 데이터를 수집, 분석, 해석하며 이를 기반으로 다양한 문제를 해결하는 학문입니다. 통계학은 확률 이론과 수학적 모델을 바탕으로 데이터의 구조를 이해하고, 정량적인 분석을 통해 신뢰성 높은 결론을 도출하는 데 중점을 둡니다. 수리통계학, 확률론, 회귀분석, 실험계획법, 다변량 분석, 베이지안 통계 등 다양한 기법을 연구하며, 이를 바탕으로 과학적이고 체계적인 의사결정을 지원합니다.  주요 연구 분야  수리통계학 및 확률론 연구  확률 모델을 활용한 데이터 분석 기법 연구  확률 과정 및 통계적 추론 이론 연구  신뢰 구간 및 가설 검정 방법론 연구  회귀분석 및 실험계획법 연구  선형 및 비선형 회귀 모델 연구  최적 실험 설계를 통한 데이터 분석 기법 개발  가설 검정을 통한 통계적 의사결정 기법 연구  다변량 분석 및 시계열 연구  다변량 통계 기법을 활용한 고차원 데이터 분석  시계열 데이터 분석 및 예측 모델 연구  금융, 경제, 공학 분야의 시계열 패턴 분석  베이지안 통계 및 추론 기법 연구  베이지안 확률 모델을 활용한 통계 추론  데이터 불확실성 평가 및 최적 의사결정 연구  베이지안 네트워크를 활용한 인과 관계 분석  사회과학 및 정책 연구  사회현상의 통계적 분석 및 정책 평가 연구  인과 관계 분석을 활용한 정책 및 의료 연구  공공 데이터 분석을 통한 사회 문제 해결  데이터 과학 및 빅데이터 분석 연구  대용량 데이터 분석 및 데이터 마이닝 기법 연구  고급 통계 기법을 활용한 머신러닝 모델의 성능 분석  실시간 데이터 스트리밍 분석 및 최적화 기법 연구  의료 및 생물통계 연구  임상시험 및 생물통계 연구를 통한 신약 개발 지원  의료 데이터 분석을 통한 질병 예측 및 예방 모델 연구  공공보건 및 역학 연구를 위한 통계적 기법 개발  금융 및 리스크 분석 연구  금융 데이터 분석 및 시장 예측 모델 개발  포트폴리오 최적화 및 리스크 관리 기법 연구  보험계리 및 신용평가 모델 개발  산업 및 품질 관리 연구  제조업의 품질 관리 및 공정 최적화 연구  신뢰성 분석 및 6시그마 기법 연구  실험계획법을 활용한 제품 개발 및 성능 평가  교육 과정  1~2학년: 기초 및 핵심 이론 학습  확률론 (Probability Theory)  수리통계학 (Mathematical Statistics)  선형대수학 (Linear Algebra)  데이터과학입문 (Introduction to Data Science)  3학년: 심화 연구 및 응용 학습  실험계획법 (Design of Experiments)  회귀분석 (Regression Analysis)  다변량 분석 (Multivariate Analysis)  베이지안 통계학 (Bayesian Statistics)  4학년: 연구 및 실무 프로젝트 수행  고급 통계 모델링  시계열 분석 (Time Series Analysis)  정책 데이터 분석  캡스톤디자인 (Capstone Design Project)  졸업 후 진로  금융 및 리스크 분석 분야  금융 데이터 분석가 (은행, 증권사, 핀테크 기업)  퀀트 애널리스트 (Quantitative Analyst)  리스크 평가 전문가  의료 및 생명과학 분야  임상시험 데이터 분석 전문가 (제약회사, 병원)  공공보건 및 질병 예측 연구원  공학 및 품질 관리 분야  품질 관리 및 신뢰성 분석 전문가 (제조업, 반도체, 자동차 산업)  공정 최적화 및 실험계획법 연구원  정책 분석 및 사회과학 분야  정책 데이터 분석가 (정부, 공공기관, 연구소)  통계 기반 정책 연구원  데이터 과학 및 빅데이터 분석 분야  데이터 사이언티스트 (IT 기업, 연구소, 공공기관)  머신러닝 및 AI 모델 성능 분석 전문가  고급 통계 모델링을 통한 데이터 기반 의사결정 지원  학과의 비전  통계학과는 데이터를 정량적으로 평가하고 해석하는 전문성을 바탕으로, 다양한 산업과 연구 분야에서 신뢰성 높은 분석을 수행하는 인재를 양성합니다. 수리통계학과 확률 모델을 기반으로 데이터를 깊이 있게 해석하고, 과학적 의사결정을 지원하는 학문으로서 사회 전반에 걸쳐 중요한 역할을 수행할 것입니다."
    },
    {
        "department_id": 86,
        "학과": "프랑스·아프리카학과",
        "학과설명": "프랑스·아프리카학과는 프랑스어를 중심으로 프랑스와 아프리카 지역의 언어, 문학, 문화, 역사, 사회를 심층적으로 연구하는 학문입니다. 1978년에 설립된 본 학과는 프랑스어 구사 능력 향상과 함께 프랑스 및 프랑스어권 아프리카 지역의 정치·경제·사회·문화적 이해를 바탕으로 글로벌 전문가를 양성하는 것을 목표로 합니다.  학생들은 프랑스어의 기초부터 고급 수준까지 체계적으로 학습하며, 문법, 작문, 독해, 발음, 회화 등의 언어 능력을 전문적으로 배양합니다. 또한, 프랑스 문학과 예술을 통해 프랑스 문화 및 철학적 사고방식을 이해하고, 아프리카 연구를 통해 프랑스어권 아프리카 국가들의 사회·정치·경제적 배경을 탐구합니다.  학과 목표 및 비전 프랑스·아프리카학과는 언어적 능력뿐만 아니라, 프랑스와 아프리카의 역사·문화·사회에 대한 폭넓은 이해를 갖춘 글로벌 인재를 양성하는 것을 목표로 합니다.  프랑스어 실력 향상 및 전문적 언어 교육  기초부터 고급까지 체계적인 프랑스어 교육 프랑스어 문법, 작문, 회화, 독해, 번역·통역 실습 프랑스 및 아프리카 문화·사회 연구  프랑스 문학, 영화, 예술, 연극 등의 문화 연구 아프리카의 사회·정치·경제적 특성과 역사적 배경 분석 프랑스와 아프리카 간의 상호 관계 탐구  식민주의, 탈식민주의, 국제 협력 연구 프랑스와 아프리카 국가들의 외교 및 무역 관계 이해 다양한 국제적 진로 지원 및 실무 경험 제공  프랑스 및 아프리카 관련 국제기구, 외교·무역·문화 교류 분야로 진출 지원 해외 교환학생 및 현장 실습을 통한 실무 경험 확대 배우는 내용 프랑스·아프리카학과의 교육과정은 프랑스어 실력 배양, 프랑스 및 아프리카 문화·사회 연구, 실무 역량 강화를 위한 커리큘럼으로 구성되어 있습니다.  1~2학년: 기초 및 핵심 이론 학습 프랑스어 기초 문법 및 작문 (Basic French Grammar & Composition) 프랑스어 회화 및 발음 연습 (French Conversation & Pronunciation) 프랑스 문학 개론 (Introduction to French Literature) 아프리카 문화와 사회 (African Culture & Society) 프랑스 역사 및 정치 연구 (French History & Politics) 3학년: 심화 연구 및 응용 학습 프랑스어 문학 및 예술 연구 (French Literature & Arts) 프랑스어권 아프리카 연구 (Francophone Africa Studies) 프랑스 및 아프리카 국제 관계 (France & Africa International Relations) 프랑스-아프리카 무역과 경제 (Trade & Economy between France & Africa) 프랑스어 번역 및 통번역 실습 (French Translation & Interpretation Practice) 4학년: 실무 프로젝트 및 연구 개발 프랑스 및 아프리카 영화 연구 (French & African Cinema Studies) 식민주의와 탈식민주의 (Colonialism & Postcolonialism in Africa) 국제 무역 및 프랑스어권 국가의 경제 전략 (International Trade & Economic Strategies in Francophone Countries) 캡스톤디자인 (Capstone Design Project) 연구 분야 프랑스·아프리카학과는 언어 연구뿐만 아니라 문화·사회·정치·경제적 배경을 분석하며, 글로벌 시대에 필요한 다양한 연구를 수행합니다.  1. 프랑스어 및 번역·통역 연구 프랑스어 문법 및 언어학 연구 프랑스어-한국어 번역 및 통역 기법 연구 프랑스어 교육 방법론 연구 2. 프랑스 문학 및 문화 연구 프랑스 고전 및 현대 문학 연구 프랑스 예술, 연극, 영화 연구 프랑스 철학과 사회 사상 연구 3. 프랑스어권 아프리카 연구 프랑스어권 아프리카 국가의 문화 및 언어 연구 아프리카의 사회 구조 및 정치·경제적 특성 분석 프랑스와 아프리카 간의 외교 및 무역 관계 연구 4. 국제 관계 및 경제 연구 프랑스와 아프리카 국가 간의 무역 및 경제 협력 연구 글로벌 개발 협력 및 국제기구 연구 식민주의 및 탈식민주의, 인권 문제 연구 졸업 후 진로 프랑스·아프리카학과 졸업생들은 프랑스 및 프랑스어권 아프리카 지역과 관련된 다양한 분야에서 전문가로 활동할 수 있습니다.  1. 외교 및 국제기구 외교관 및 무역관: 외교부, 주한 프랑스 대사관, KOICA(한국국제협력단) 국제기구: 유엔(UN), 프랑스문화원, OECD, UNESCO 등 NGO 및 국제 협력 기관: 아프리카 개발 협력 및 인권 단체 2. 무역 및 비즈니스 국제 무역 전문가: 프랑스 및 아프리카 지역 무역 담당 프랑스 기업 한국 지사 및 글로벌 기업(로레알, 루이비통 등) 프랑스 및 아프리카 시장 컨설턴트 3. 문화 및 교육 분야 프랑스어 교사 및 강사: 국내외 초·중·고교, 어학원, 대학교 프랑스 및 아프리카 문화 콘텐츠 기획자 프랑스어 통·번역가: 출판사, 방송사, 기업 통·번역 전문가 4. 미디어 및 출판 분야 프랑스 및 아프리카 관련 기자 및 작가 출판 및 콘텐츠 제작: 프랑스 문학 및 문화 관련 출판 기획 방송 및 영상 제작자: 프랑스 및 아프리카 다큐멘터리 제작 5. 학계 및 연구직 프랑스 및 아프리카 연구원: 대학 및 연구소 진학 국제정치 및 경제 연구: 국제 관계 및 개발 연구 학과의 역할과 목표 프랑스·아프리카학과는 프랑스어 능력뿐만 아니라, 프랑스 및 아프리카의 역사·사회·문화적 배경을 종합적으로 이해하고 실무에 적용할 수 있는 글로벌 전문가를 양성하는 것을 목표로 합니다.  국제적 역량을 갖춘 글로벌 인재 양성  프랑스 및 아프리카 국가들과의 협력 확대 프랑스어 및 글로벌 경제·정치·문화 연구 실용적인 언어 교육 및 현장 경험 제공  해외 교환학생 및 인턴십 기회 제공 실무 중심의 번역·통역 교육 및 프로젝트 운영 다양한 분야로의 진로 개척 지원  외교, 무역, 교육, 문화 등 다양한 분야의 전문 인력 양성 프랑스·아프리카학과는 국제 사회에서 활약할 글로벌 전문가를 양성하여, 프랑스 및 아프리카 지역과의 문화·경제적 교류를 선도하는 것을 목표로 합니다."
    },
    {
        "department_id": 104,
        "학과": "한약자원학과",
        "학과설명": "한약자원학과는 인류 건강 증진과 질병 예방을 목표로 한약 및 약용식물의 연구, 개발, 생산 및 응용에 대한 전문적인 교육을 제공합니다. 본 학과는 한의학과 생명과학, 기능성 식품, 바이오 기술을 접목하여 한방 의약품 및 건강기능성 식품의 개발을 선도할 전문가를 양성하는 것을 목표로 합니다.  학생들은 한약 및 약용식물의 특성 연구, 재배 방법, 천연물 화학, 생리활성 물질 탐색, 건강기능성 식품 개발, 품질 관리 등 다양한 학문을 접하며, 한방 의약품 및 건강기능성 식품 산업에서 핵심적인 역할을 수행할 수 있도록 교육받습니다.  특히, 한약 도매업무관리자(보건복지부 인정) 양성을 위한 교육과정을 운영하여, 한약재의 감정, 생산, 저장 및 품질 관리 능력을 갖춘 전문가를 배출하고 있습니다.  학과 목표 한약자원학과는 약용식물과 한약 자원의 과학적 연구 및 활용을 통해 건강기능성 식품과 의약품 개발을 선도할 전문가를 양성하는 것을 목표로 합니다.  약용식물 및 천연물 연구를 통한 신소재 개발  한약재 및 약용식물의 유효성분 연구 및 의약품 응용 생리활성 천연물의 기능성 탐색 및 신소재 개발 건강기능성 식품 개발 및 한방의료 산업화  기능성 식의학 소재 개발 및 건강기능성 식품 연구 한방 및 대체의학을 활용한 건강 관리 시스템 연구 한약재 생산 및 품질 관리 전문성 강화  한약재 감별 및 품질 평가 기술 연구 한약 도매업무관리자 양성을 위한 실무 교육 바이오 및 생명과학 기술 융합 교육  약용식물의 조직 배양 및 생명공학적 응용 유전자 변형을 통한 고기능성 약용작물 개발 연구 분야 본 학과에서는 한방 과학과 생명과학, 바이오기술을 융합하여 다양한 연구를 수행하고 있습니다.  1. 약용식물 생산 및 재배 연구 약용작물 재배 및 생리학적 연구 약용식물의 조직배양 및 대량 증식 기술 환경 변화에 따른 약용작물의 생리활성 변화 연구 2. 천연물 의약 및 기능성 식품 연구 한방 약용식물의 생리활성 성분 탐색 기능성 천연물 개발 및 건강기능성 식품 응용 연구 항산화, 항염증, 면역 증강 물질 연구 3. 한약재 품질 관리 및 감별 연구 한약재의 표준화 및 품질 인증 연구 한약재 감별 및 저장·보관 기술 연구 유전자 분석을 통한 한약재 동정 및 품질 평가 4. 바이오 기술 및 생명공학 연구 약용식물의 생명공학적 개량 연구 유용물질의 대량 생산 및 생합성 경로 연구 미생물 발효를 활용한 생리활성 물질 개발 5. 한방 및 대체의학 연구 한방 치료제의 과학적 검증 연구 전통 한약과 현대 의학의 융합 연구 동양의학 기반 질병 예방 및 건강관리 연구 교육과정 개요 본 학과의 교육과정은 약용식물학, 천연물 화학, 생화학, 한방의료 산업화, 건강기능성 식품 연구 등 다양한 분야를 포함하여 한약자원의 생산에서 응용까지 전반적인 내용을 다루도록 구성되어 있습니다.  1학년 (기초 과정) 한약자원학 개론 (Introduction to Herbal Resources) 생물학 및 화학 기초 (Basic Biology & Chemistry) 약용식물학 개론 (Introduction to Medicinal Plants) 2학년 (심화 과정) 한방 생리학 (Traditional Medicine Physiology) 약용작물 조직배양학 (Plant Tissue Culture for Medicinal Crops) 천연물 화학 및 분석 (Natural Product Chemistry & Analysis) 3학년 (응용 과정) 건강기능성 식품 개발 (Functional Foods & Nutraceuticals) 한약재 품질관리 및 감별 (Quality Control & Identification of Herbal Medicine) 생약학 및 한방의학 실습 (Herbal Pharmacology & Traditional Medicine Practice) 4학년 (실무 및 연구 과정) 천연물 생리활성 연구 (Bioactive Natural Products) 한약제제 개발 및 응용 (Herbal Medicine Formulation & Application) 한약도매업무관리자 실무 (Herbal Wholesale Management Practice) 졸업 연구 프로젝트 (Capstone Research Project) 졸업 후 진로 한약자원학과 졸업생들은 한방의료, 천연물 연구, 건강기능성 식품 개발, 바이오 산업 등 다양한 분야에서 전문가로 활동할 수 있습니다.  1. 한약 및 천연물 연구 기관 한약 및 생약 연구소 (한국한의학연구원, 한국생명공학연구원 등) 대학 및 공공기관 연구소 (식품의약품안전처, 국립농업과학원 등) 천연물 신약 개발 기업 연구소 2. 건강기능성 식품 및 바이오 산업 건강기능식품 연구개발 및 품질관리 (CJ제일제당, 대상, 유한양행 등) 천연물 신소재 개발 및 의약품 응용 연구 기능성 화장품 및 바이오 소재 연구 기업 3. 한약재 생산 및 품질관리 분야 한약재 감별 및 품질관리 전문가 한약 도매업무 및 유통 관련 기업 전통의학 및 한방병원 관련 품질관리 분야 4. 제약 및 의약품 제조업 한방 의약품 및 천연물 의약품 개발 기업 한약제제 및 생약 기반 신약 연구소 식물성 의약품 및 건강기능성 제형 연구 5. 학계 및 교육 분야 대학원 진학 및 연구 교수직 한방의료 및 천연물 화학 교육 기관 공공기관 및 정책 연구소 취득 가능 자격증 졸업 후 다양한 국가 공인 및 산업 관련 자격증을 취득하여 전문성을 강화할 수 있습니다.  한약도매업무관리자 (보건복지부 인정) 건강기능식품 기능사 / 산업기사 / 기사 식품기사 / 식품산업기사 한약사 및 한의사 (한의대 진학 시) 화장품 제조관리사 학과의 비전 한약자원학과는 한방 및 천연물 연구를 통해 인류 건강 증진과 대체의학 산업 발전을 선도할 전문가를 양성하며, 다음과 같은 방향으로 지속적인 연구와 교육을 확대하고 있습니다.  전통 한약 및 기능성 식품 연구 강화 천연물 신약 및 바이오 의약품 개발 지원 산학 협력 및 글로벌 한약 산업 네트워크 구축 친환경 및 지속가능한 한약재 재배 기술 개발 본 학과는 21세기 웰빙 및 바이오산업의 핵심 인재를 양성하며, 학생들이 다양한 산업 분야에서 활약할 수 있도록 실무 중심의 교육과 연구 환경을 제공할 것입니다."
    },
    {
        "department_id": 50,
        "학과": "한옥학과",
        "학과설명": "한옥학과는 전통 건축인 한옥의 체계적인 연구와 교육을 통해 진정성과 정체성을 확립하고, 지속 가능한 전통 주거문화를 계승·발전시키는 것을 목표로 하는 학문 분야입니다. 한옥은 생태적·환경적 가치가 높은 친환경 건축물로서, 현대 건축의 대안으로 주목받고 있으며, 이에 따라 본 학과는 한옥 전문 교육과 기술 개발을 통해 인적·물적 인프라를 구축하고, 한옥의 현대화 및 산업화를 촉진하는 것을 핵심 목표로 삼고 있습니다.  학과 목표 및 비전 한옥학과는 전통과 현대를 융합한 실용적 교육을 통해 한옥 건축의 미래를 선도할 전문가를 양성합니다.  한옥 건축의 체계적 교육 및 연구 강화  전통 건축의 기본 원리 및 현대 건축 기법 접목 한옥의 보존, 수리, 복원 및 현대적 응용 연구 한옥 산업화 및 보급화를 위한 기술 개발  전통 한옥의 현대 주거 적용 및 신기술 연구 디지털 설계를 활용한 한옥의 효율적 시공 기술 개발 한옥 건축 전문 인재 양성  실무 중심 교육을 통한 한옥 설계 및 시공 전문가 양성 한옥 관련 법·정책 연구 및 산업과의 연계 강화 국내외 전통 건축 문화와의 연계  해외 전통 건축 연구 및 비교 연구 수행 국제 교류 및 협력을 통한 한국 전통 건축의 세계화 배우는 내용 한옥학과의 교육과정은 전통 한옥의 설계·시공·보존·복원·현대화까지 포괄적으로 다루는 융합적 커리큘럼으로 구성되어 있습니다.  1~2학년: 기초 및 핵심 이론 학습 한옥 개론 (Introduction to Hanok Architecture) 전통 건축 재료학 (Traditional Building Materials) 한옥 기초 설계 및 구조 이해 (Basic Hanok Design & Structure) 한옥의 역사와 문화 (History & Culture of Hanok) 한옥과 친환경 건축 (Hanok & Sustainable Architecture) 3학년: 한옥 설계 및 실습 과정 한옥 디지털 설계 (Digital Hanok Design) 한옥 치목 실습 (Hanok Timber Processing Practice) 한옥 부재 가공 실습 (Hanok Component Fabrication Practice) 한옥 시공 실습 (Hanok Construction Workshop) 전통 건축 보존 및 복원 기술 (Traditional Architecture Preservation & Restoration) 4학년: 심화 연구 및 실무 프로젝트 한옥 현대화 연구 및 응용 (Modernization of Hanok Architecture) 한옥 설계 프로젝트 (Hanok Design Project) 한옥 시공 및 유지관리 (Hanok Construction & Maintenance) 한옥 산업화 및 법제 연구 (Hanok Industrialization & Legal Studies) 캡스톤디자인 (Capstone Design Project in Hanok Architecture) 연구 분야 한옥학과는 한옥 건축의 전통적 가치를 보존하면서도 현대적 활용 가능성을 탐구하는 연구를 수행합니다.  1. 한옥 구조 및 설계 연구 전통 한옥 구조 분석 및 현대적 응용 한옥 설계 기법 및 시공 기술 연구 2. 전통 건축 보존 및 복원 연구 문화재 지정 한옥 및 전통 건축물 복원 연구 한옥 보존을 위한 친환경 소재 및 공법 연구 3. 한옥 산업화 및 현대화 연구 전통 건축과 현대 건축의 융합 기술 개발 한옥 모듈화 및 프리패브 공법 연구 4. 친환경 및 지속 가능 한옥 연구 한옥의 에너지 효율성 및 친환경 요소 분석 지속 가능한 전통 건축 시스템 연구 5. 전통 건축과 도시 공간 연구 한옥 마을 및 전통 공간 계획 연구 도시 속 한옥 활용 및 정체성 연구 졸업 후 진로 한옥학과 졸업생들은 전통 건축 설계, 한옥 시공 및 보존, 건축 관련 연구 및 정책 개발 등 다양한 분야에서 전문가로 활동할 수 있습니다.  1. 건축 설계 및 시공 분야 한옥 건축 설계사 (전통 건축 전문 설계 사무소, 건축 회사) 한옥 시공 및 현장 관리 전문가 2. 전통 건축 보존 및 복원 분야 문화재 보존 전문가 (국립문화재연구소, 문화재청, 전통 건축 복원 전문 기관) 전통 건축 복원 기술자 및 연구원 3. 공공기관 및 정책 연구 분야 국가 및 지자체 건축 관련 공무원 (한옥 보전 정책 개발 및 행정) 한옥 연구 및 정책 기획 전문가 4. 친환경 건축 및 도시계획 분야 친환경 한옥 건축 연구소 및 기업 한옥과 도시 공간 계획 전문가 5. 학계 및 연구직 전통 건축 및 한옥 관련 연구원 (대학 및 연구소) 해외 전통 건축 비교 연구 및 국제 프로젝트 참여 학과의 역할과 목표 한옥학과는 전통과 현대의 조화를 이루는 건축 교육을 통해, 한국 전통 건축을 계승·발전시키고, 세계적으로 경쟁력을 갖춘 전문가를 양성하는 것을 목표로 합니다.  한옥 건축의 정체성 확립 및 보존  전통 한옥의 원형 유지 및 문화유산 보존 연구 지속 가능한 전통 건축 기술 개발 한옥의 현대화 및 실용화 촉진  한옥을 현대 주거 및 공공건축으로 적용하기 위한 연구 디지털 기술 및 신소재를 활용한 한옥 설계 및 시공 기술 개발 전통 건축과 도시 환경의 융합 연구  도시 한옥 활성화 및 한옥 마을 조성 연구 한옥 기반 친환경 도시 개발 전략 연구 전통 건축 전문가 양성을 위한 실무 중심 교육 강화  현장 실습과 프로젝트 중심의 교육 제공 건축 관련 기업 및 연구소와 협력하여 실무 역량 강화 한옥학과는 한국의 전통 건축 문화를 세계에 알리고, 한옥의 가치를 현대 사회에 맞게 재해석하며, 지속 가능한 건축 발전을 선도하는 전문 인재를 양성하는 것을 목표로 합니다."
    },
    {
        "department_id": 28,
        "학과": "항공우주공학과",
        "학과설명": "항공우주드론공학과는 항공기, 우주비행체 및 드론(UAV, UAM)의 설계, 제작, 운용에 필요한 전문 지식을 교육하여 미래 항공우주산업과 드론산업을 선도할 인재를 양성하는 것을 목표로 합니다.  항공우주산업과 드론산업은 고부가가치 첨단산업의 집약체로, 이를 뒷받침할 공기역학, 비행역학, 항공기 및 드론의 추진 시스템, 항공전자 시스템, 우주 탐사 기술 등의 학문적 토대가 필수적입니다. 본 학과는 국제적으로 인증된 공학교육 프로그램(ABEEK, Washington Accord)과 연계된 체계적인 교육과정을 제공하며, 이론과 실무 경험을 병행하여 항공우주 및 드론 시스템 설계 및 제작 역량을 갖춘 창의적인 인재를 배출하고 있습니다.  학생들은 항공기 및 우주선 설계뿐만 아니라, 드론 및 무인비행체(UAV) 시스템 개발, 도심항공모빌리티(UAM), 스마트 항공 시스템, 친환경 항공기 기술 등을 심도 있게 학습하며, 국내외 항공우주 및 드론 산업체, 연구기관에서 활약할 수 있도록 준비됩니다.  교육 목표 항공우주 및 드론 시스템 설계 및 제작 역량 배양  항공기, 위성, 로켓 및 드론의 설계, 해석, 제작 및 운용 기술 습득 창의적 문제 해결을 위한 공학적 사고 능력 함양 미래 항공우주 및 드론산업 발전을 위한 첨단 기술 연구  인공지능(AI), 빅데이터, 스마트 제조 기술을 융합한 항공우주 및 드론 시스템 연구 미래 모빌리티(UAM), 친환경 항공기 및 저탄소 기술 개발 실무 중심의 공학교육 및 글로벌 경쟁력 강화  항공우주 및 드론 산업체, 연구소와의 협력 및 인턴십 기회 제공 국제 표준을 반영한 전문 공학 교육으로 글로벌 경쟁력 확보 사회적 기여 및 지속 가능한 항공기술 개발  친환경 항공기 및 지속가능한 우주 탐사 연구 국방 및 상업용 드론 및 항공우주 기술 개발을 통한 국가 발전 기여 연구 분야 본 학과에서는 항공우주공학과 드론공학의 기초 이론부터 최첨단 응용 기술까지 폭넓은 연구를 수행하고 있습니다.  1. 항공역학 및 공기역학 연구 항공기 및 드론 설계를 위한 공기역학적 해석 초음속 및 극초음속 비행체 유동 해석 풍동 실험 및 전산유체역학(CFD) 시뮬레이션 2. 항공우주 구조 및 재료 연구 항공기 및 우주선의 경량 구조 설계 신소재 및 복합재료 활용 항공우주 및 드론 시스템 연구 항공기 및 드론의 피로 및 손상 해석 3. 추진 시스템 및 비행역학 연구 가스터빈 엔진, 로켓 엔진 및 전기추진 연구 차세대 전기추진 및 플라즈마 추진 시스템 연구 무인항공기(UAV), 도심항공모빌리티(UAM), 드론의 추진 시스템 최적화 4. 위성 및 우주 탐사 연구 인공위성 설계 및 운용 기술 연구 위성 항법 시스템(GNSS) 및 통신 시스템 개발 우주 탐사선 및 달·화성 탐사 기술 연구 5. 스마트 항공우주 및 드론 시스템 연구 인공지능(AI) 및 머신러닝을 활용한 항공기 및 드론 자동화 시스템 연구 빅데이터 기반 항공기 및 드론 유지보수 및 예측 분석 연구 자율비행 및 스마트 드론 시스템 개발 6. 친환경 항공기 및 지속가능한 항공 기술 연구 차세대 수소 연료전지 항공기 및 드론 연구 친환경 항공기 및 저소음 항공기 개발 탄소 배출 저감형 항공기 및 드론 설계 및 최적화 연구 교육과정 개요 본 학과의 교육과정은 이론 학습과 실험·실습을 병행하여 항공우주 및 드론공학의 전반적인 내용을 종합적으로 다루도록 구성되어 있습니다.  1학년 (기초 과정) 항공우주 및 드론공학 개론 기초 공학 수학 및 물리학 컴퓨터 프로그래밍 및 데이터 분석 2학년 (기본 과정) 유체역학 및 항공재료 항공구조역학 및 설계 열역학 및 항공전자공학 3학년 (심화 과정) 공기역학 및 비행역학 드론 시스템 설계 및 시뮬레이션 항공기 및 드론 추진공학 4학년 (응용 및 연구 과정) 위성 시스템 및 우주 탐사 스마트 항공 및 드론 시스템 졸업 연구 프로젝트 (캡스톤 디자인) 졸업 후 진로 항공우주드론공학과 졸업생들은 항공기 및 우주산업, 드론산업, 방위산업, 연구기관, 공기업 및 공공기관 등 다양한 분야에서 활동할 수 있습니다.  1. 항공 및 우주 산업체 대한항공, 한국항공우주산업(KAI), 한국항공우주연구원(KARI) 글로벌 항공우주 기업 (Boeing, Airbus, SpaceX, NASA, Lockheed Martin) 2. 드론 및 무인항공기(UAV) 산업 드론 및 UAM(도심항공모빌리티) 개발업체 자율비행 시스템 및 AI 기반 드론 개발 기업 3. 국방 및 방위산업 분야 방위사업청, 국방과학연구소(ADD) 무인항공기(UAV) 및 군사드론 개발 업체 4. 연구기관 및 대학원 진학 KAIST, POSTECH, 서울대 등 대학원 진학 NASA, ESA, JAXA 등 해외 우주 연구 기관 5. 공기업 및 정부 기관 한국항공우주연구원(KARI) 국토교통부 항공안전기술원 한국전력공사, 한국가스공사 등 대형 공기업 6. 신기술 및 벤처 창업 스타트업 (Urban Air Mobility, 친환경 항공기, 우주 탐사 기업) 스마트 드론 및 무인항공기(UAV) 기술 관련 창업 취득 가능 자격증 항공기사 및 항공산업기사 무인항공기 조종자 자격증 항공기정비사 (Aircraft Maintenance Engineer) 학과 비전 및 전망 항공우주드론공학과는 미래 항공우주 및 드론 기술을 선도할 창의적 인재를 양성하는 것을 목표로 합니다.  친환경 항공기 및 저탄소 드론 기술 개발 인공지능 기반 스마트 드론 시스템 연구 우주 탐사 및 위성 기술 개발 도심항공모빌리티(UAM) 및 차세대 교통 시스템 연구 본 학과는 첨단 항공우주 및 드론 기술 연구를 통해 글로벌 시장을 선도할 핵심 인재를 배출할 것입니다."
    },
    {
        "department_id": 67,
        "학과": "행정학과",
        "학과설명": "행정학과는 중앙정부, 지방정부 및 공공기관의 효율적인 운영과 공공정책의 결정 및 집행을 연구하고 교육하는 학문입니다. 공공 부문의 조직관리, 정책 분석, 재무 행정, 지방 행정 등 다양한 분야를 학습하며, 국가 발전과 지역 사회에 기여할 전문 행정가를 양성하는 것을 목표로 합니다.  행정학과에서는 국가직무능력표준(NCS)에 기반하여 공공 부문에서 필요한 소통역량, 창의역량, 실무역량, 문제해결역량, 공공정책 분석 역량 등을 체계적으로 배양하며, 공공기관과 행정기관에서 요구하는 실무 중심의 교육과정을 운영하고 있습니다.  행정학과의 목표 및 비전 행정학과는 실무 중심의 교육과 연구를 통해, 공공 부문의 전문 행정가 및 정책 분석가를 양성하는 것을 목표로 합니다.  1. 행정학의 기초 및 전문 지식 습득 행정학 개론: 행정의 기본 원리 및 공공 행정의 역할 이해 조직이론 및 공공관리: 공공 조직의 운영 및 인사관리 연구 정책학 및 정책 분석: 정책 결정 과정 및 평가 기법 학습 2. 실무 행정 능력 및 문제 해결 역량 강화 정부 예산 및 재정 행정 연구 전자정부 및 디지털 행정 서비스 운영 통계분석 및 공공정책 데이터 활용 역량 배양 3. 공무원 및 공공기관 취업 준비 지원 PSAT(공직적성검사) 대비 프로그램 운영 공무원 시험 및 공공기관 채용 대비 특강 제공 공공기관 및 공기업 연계 인턴십 운영 4. 글로벌 역량 및 비교과 활동 강화 토익 930 클럽 코칭 및 외국어 역량 강화 프로그램 운영 교환학생 및 해외 탐방 프로그램 지원 공공 봉사활동 및 NGO 협력 프로젝트 참여 교육과정 1~2학년: 행정학의 기초 및 공공 행정 개론 행정학개론: 행정의 기본 개념 및 공공 조직의 역할 학습 헌법 및 행정법: 공무원 행정과 관련된 법적 기초 연구 정책학개론: 정책 형성과정 및 정책 분석 기법 학습 지방행정 및 지방자치론: 지방정부의 역할 및 운영 방식 연구 3~4학년: 실무 및 응용 과정 정부 예산 및 재무행정: 공공재정 관리 및 예산 집행 기법 연구 공기업 및 공공기관 경영: 공기업 및 준정부 기관의 역할 및 운영 연구 전자정부 및 정보행정: 디지털 기술을 활용한 공공 행정 혁신 연구 통계분석 및 공공정책 평가: 정책 분석을 위한 데이터 활용 및 평가 기법 학습 비교과 프로그램 및 실무 경험 PSAT 첨삭지도 및 공무원 시험 대비 프로그램 운영 공공기관 및 공기업 인턴십 기회 제공 컴퓨터 활용능력 및 통계분석 특강 운영 해외 탐방 및 국제 공공 행정 연구 프로그램 지원 졸업 후 진로 1. 공무원 및 공공기관 진출 행정직 공무원 (중앙 및 지방정부, 국가직·지방직 공무원) 경찰, 교육행정직, 세무직, 검찰직 공무원 국회 및 지방자치단체 정책보좌관 2. 공기업 및 공공기관 취업 한국전력공사, 한국수자원공사, 한국토지주택공사(LH) 등 공기업 국민연금공단, 건강보험관리공단 등 준정부기관 및 사회복지 관련 기관 공공정책 컨설팅 및 행정 컨설턴트 3. 연구 및 학술 분야 행정학 및 정책학 연구원 (정부 및 민간 연구소) 대학교수 및 연구직 (대학원 진학 후 학계 연구 활동) 공공정책 및 국제 행정 관련 연구소 연구원 4. 민간 기업 및 NGO 정책 기획 및 컨설팅 기업 국제기구 및 NGO (유엔, OECD, 국제개발기구 등) 기업 내 공공 관계 및 사회 공헌 담당 부서 행정학과의 역할과 목표 행정학과는 공공 행정 및 정책 연구를 통해, 국가 및 지역사회 발전을 이끌어 갈 전문 행정가를 양성하는 것을 목표로 합니다.  공공 부문의 운영 효율성을 높이기 위한 연구 및 실무 교육 강화 디지털 행정 및 전자정부 혁신 연구를 통한 미래 행정 역량 강화 정책 분석 및 공공정책 기획을 위한 데이터 기반 교육 확대 공공기관 및 공기업 취업을 위한 맞춤형 실무 교육 제공 행정학과는 공공 부문의 전문가를 양성하여, 정부 및 공공기관의 효율적인 운영을 지원하고, 국민을 위한 행정을 실현하는 실천적 학문입니다."
    },
    {
        "department_id": 29,
        "학과": "화학공학부",
        "학과설명": "화학공학부는 에너지, 나노정밀화학, 생명과학 등 다양한 화학 산업 분야에서 공정 및 제품 개발에 기여할 창의적인 엔지니어를 양성하는 것을 목표로 합니다. 물질의 변화를 다루는 공학적 원리를 바탕으로, 화학, 생명과학, 나노기술, 에너지 및 환경공학 등 다양한 첨단 기술과의 융합을 통해 21세기 미래 산업을 선도하는 인재를 양성합니다.  학생들은 기초과학과 공학적 설계를 기반으로 한 실무 능력과 문제 해결 역량을 배양하며, 산업 현장에서 필요로 하는 전문성을 갖춘 글로벌 인재로 성장하게 됩니다. 또한, 산학 협력을 통한 현장 실습과 국제 공학교육 인증을 통한 글로벌 표준 교육을 제공하여, 졸업 후 국내외에서 공인된 화학공학 엔지니어로 활동할 수 있도록 교육하고 있습니다.  학과 목표 및 비전 화학공학부는 화학 산업과 관련된 다양한 첨단 기술을 연구하고, 지속 가능한 산업 발전과 인류 복지에 기여할 창의적이고 혁신적인 화학공학 인재를 양성하는 것을 목표로 합니다.  혁신적 화학공학 연구 및 응용 능력 배양  물질의 화학적 변화와 공정 최적화 기술 습득 신소재, 정밀화학, 나노기술 등의 연구를 통한 첨단 기술 개발 산업 현장 중심의 실무 교육 강화  기업 연계 산학 협력 및 현장 실습 기회 제공 공학 설계 및 창의적 문제 해결 프로젝트 수행 지속 가능한 친환경 화학공정 개발  친환경 화학공정 및 에너지 효율화 연구 환경오염 저감 기술 및 재생에너지 응용 연구 국제적 경쟁력을 갖춘 글로벌 인재 양성  공학교육인증(ABEEK) 기반의 국제 표준 교육과정 운영 해외 연구소 및 대학과의 교류를 통한 글로벌 연구 협력 배우는 내용 (교육과정) 화학공학부의 교육과정은 화학적 원리, 공정 설계 및 제어, 나노기술 및 바이오공학, 환경 및 에너지 공학 등 다양한 분야를 아우르며, 기초부터 심화까지 체계적으로 학습할 수 있도록 구성되어 있습니다.  1~2학년: 기초 및 핵심 이론 학습 일반화학 및 실험 (General Chemistry & Lab) 유기화학 (Organic Chemistry) 물리화학 (Physical Chemistry) 화학공학개론 (Introduction to Chemical Engineering) 공업수학 (Engineering Mathematics) 유체역학 (Fluid Mechanics) 3학년: 심화 과정 및 응용 연구 반응공학 (Chemical Reaction Engineering) 열역학 (Chemical Engineering Thermodynamics) 화학공정설계 (Process Design in Chemical Engineering) 고분자공학 (Polymer Engineering) 나노소재 및 공정 (Nanomaterials & Processing) 바이오화학공학 (Biochemical Engineering) 4학년: 실무 적용 및 연구 프로젝트 수행 화학공정제어 (Chemical Process Control) 환경화학공학 (Environmental Chemical Engineering) 신재생에너지공학 (Renewable Energy Engineering) 캡스톤디자인 (Capstone Design in Chemical Engineering) 공정안전 및 관리 (Process Safety & Management) 산업연계 연구 프로젝트 (Industry-linked Research Projects) 연구 분야 화학공학부는 미래 산업을 선도할 다양한 첨단 연구를 수행하며, 친환경 및 지속가능한 화학공정 개발, 나노소재 및 생명공학 응용 연구, 차세대 에너지 공정 연구 등을 중점적으로 다룹니다.  1. 나노 및 정밀화학 연구 반도체 및 디스플레이용 나노소재 개발 고분자 소재 및 스마트 나노소재 연구 정밀화학 및 촉매공학 연구 2. 친환경 화학공정 및 에너지 연구 탄소 저감 및 친환경 공정 연구 신재생에너지 및 수소연료전지 연구 폐기물 자원화 및 지속 가능한 화학공정 연구 3. 생명공학 및 바이오화학공학 연구 바이오 연료 및 바이오 플라스틱 개발 의약품 및 생체재료 연구 합성 생물학 및 단백질 공학 연구 4. 화학공정 최적화 및 안전 연구 공정 시뮬레이션 및 최적화 연구 위험물 관리 및 공정 안전 연구 AI 및 데이터 기반 스마트 화학공정 연구 졸업 후 진로 화학공학부 졸업생들은 화학, 석유, 에너지, 환경, 바이오, 나노기술 등 다양한 산업 분야에서 핵심 인력으로 활동할 수 있습니다.  1. 화학 및 정밀화학 산업 석유화학, 정밀화학 및 신소재 연구개발 엔지니어 정밀 화학제품 및 촉매 제조 기업 연구원 반도체 및 전자소재 관련 기업 2. 환경 및 에너지 산업 수소연료전지 및 신재생에너지 기업 탄소 저감 및 친환경 기술 관련 기업 폐기물 및 화학 공정 안전 관련 공기업 3. 바이오 및 제약 산업 바이오소재 및 의약품 개발 연구소 생명공학 및 바이오화학공학 연구 기관 바이오 플라스틱 및 친환경 소재 기업 4. 공공기관 및 연구소 한국화학연구원, 한국에너지기술연구원 등 국책 연구소 환경부, 산업통상자원부 등 정부 기관 화학 및 환경 관련 공공기관 및 비영리단체 5. 대학원 및 학술 연구 분야 국내외 대학원 진학 후 연구 및 교수 활동 화학공학, 나노소재, 바이오공학 관련 연구소 연구원 AI 및 데이터 분석을 활용한 스마트 공정 연구 학과의 역할과 목표 화학공학부는 지속 가능한 미래 산업을 주도할 핵심 기술을 연구하고, 글로벌 경쟁력을 갖춘 창의적이고 혁신적인 엔지니어를 양성하는 것을 목표로 합니다.  기초과학 및 공학적 문제 해결 역량 강화  화학공학의 기본 원리를 바탕으로 창의적인 문제 해결 능력 배양 친환경 및 지속 가능한 공정 기술 개발  탄소 중립, 신재생에너지 및 환경 친화적 공정 연구 산업 현장 중심의 실무 교육 및 산학 협력  기업 및 연구소와 협력하여 실용적인 연구 및 인턴십 제공 국제 경쟁력을 갖춘 글로벌 인재 양성  국제 공학교육 인증(ABEEK) 기반의 표준 교육과정 운영 해외 연구 기관 및 기업과의 협력을 통한 글로벌 경험 제공 화학공학부는 첨단 기술과 융합된 창의적 공학 교육을 바탕으로, 산업과 사회에 기여하는 공학자로 성장할 수 있도록 지원하며, 미래 화학산업을 주도할 핵심 인재를 양성하는 데 최선을 다하고 있습니다."
    },
    {
        "department_id": 100,
        "학과": "화학과",
        "학과설명": "화학과는 1952년 설립되어 학사, 석사, 박사 과정을 운영하며, 물질의 구조와 성질을 연구하고 이를 활용하여 새로운 물질을 창조하는 기초과학 분야를 다룹니다. 화학은 의약품, 신소재, 에너지, 환경, 나노기술 등 다양한 산업 분야에서 중요한 역할을 하며, 인류 복지와 기술 발전에 필수적인 학문입니다.  본 학과에서는 물리화학, 유기화학, 무기화학, 분석화학 등의 기본 분야를 포함하여 나노화학, 생화학, 의약화학, 환경화학 등 첨단 응용 분야까지 연구하며, 학생들이 창의적이고 독립적인 연구를 수행할 수 있도록 지도하고 있습니다. 또한, 실험 중심의 교육과 연구 프로젝트를 통해 학생들은 다양한 화학적 문제 해결 능력을 기르고, 실무 경험을 쌓을 수 있습니다.  졸업생들은 대학원 진학 후 교수 및 연구직, 국내외 연구소 및 기업 연구개발(R&D) 부서, 정부기관 및 공공 연구소, 제약, 화장품, 섬유, 에너지, 소재, 환경 분야 산업체 등 다양한 분야로 진출하고 있으며, 중등 교사, 공무원, 벤처기업 창업 등 사회 전반에서 활약하고 있습니다.  교육 목표 화학의 기초 및 응용 능력 배양  물리화학, 유기화학, 무기화학, 분석화학 등 기초 화학 교육 제공 첨단 화학 기술과 실험을 통한 응용 능력 강화 실험 중심의 연구 교육 제공  창의적이고 자주적인 연구 수행 능력 배양 실험실습과 연구 프로젝트를 통한 실무 경험 축적 다학제적 융합 교육 및 연구 수행  생명과학, 의약, 환경, 신소재 등 다양한 분야와 융합 연구 첨단 화학기술 및 분석기법 활용 능력 함양 산업 및 연구기관과 협력 강화  기업 및 연구기관과의 협력을 통한 실무 연계 교육 제공 국내외 대학 및 연구소와의 협업을 통한 글로벌 연구 역량 강화 연구 분야 1. 기초 화학 연구 물리화학: 분자의 구조 및 반응 동역학 연구 유기화학: 새로운 유기 합성 방법 개발 및 의약 화학 연구 무기화학: 나노소재, 촉매 화학 및 금속 화합물 연구 분석화학: 화학적 분석 방법 및 센서 기술 개발 2. 응용 및 첨단 화학 연구 나노화학: 나노소재 및 나노입자 합성과 응용 의약화학 및 생화학: 신약 개발 및 생체분자 상호작용 연구 에너지 화학: 태양전지, 연료전지 및 에너지 저장소재 연구 환경화학: 친환경 화학 및 환경오염 정화 기술 연구 3. 화학과 융합 연구 신소재 및 기능성 화학: 전자소재, 고분자 화학 및 복합소재 연구 바이오화학 및 의약소재 개발: 질병 치료제 및 진단기술 연구 촉매 및 그린 케미스트리: 친환경 촉매 및 화학공정 개발 고분자 화학: 고기능성 폴리머 및 바이오 플라스틱 연구 교육과정 개요 1학년 (기초 화학 과정) 일반화학 Ⅰ,Ⅱ (General Chemistry I, II) 화학실험 Ⅰ,Ⅱ (Chemistry Laboratory I, II) 기초수학 및 물리학 2학년 (전공 기본 과정) 물리화학 Ⅰ,Ⅱ (Physical Chemistry I, II) 유기화학 Ⅰ,Ⅱ (Organic Chemistry I, II) 무기화학 Ⅰ,Ⅱ (Inorganic Chemistry I, II) 분석화학 (Analytical Chemistry) 화학실험 및 기기분석 3학년 (전공 심화 과정) 고급 유기화학 (Advanced Organic Chemistry) 나노화학 및 신소재 화학 (Nanochemistry & Advanced Materials) 생화학 및 의약화학 (Biochemistry & Medicinal Chemistry) 환경화학 및 에너지 화학 (Environmental & Energy Chemistry) 연구실습 및 인턴십 프로그램 4학년 (응용 및 연구 과정) 응용화학 및 산업화학 (Applied & Industrial Chemistry) 화학공학 개론 (Introduction to Chemical Engineering) 캡스톤디자인 및 졸업연구 프로젝트 대학원 연구 및 논문 작성 실습 졸업 후 진로 화학과 졸업생들은 다양한 산업 및 연구 분야에서 활동할 수 있습니다.  1. 연구 및 학술 분야 국내외 대학원 진학 (화학, 의약화학, 나노소재, 환경화학 등) 정부 및 공공 연구소 (KIST, KRISS, ETRI, KAERI, 환경연구원 등) 국립보건연구원, 한국화학연구원 등 생명과학 및 의약 연구소 2. 산업 분야 제약 및 바이오 산업: 신약 개발, 생명과학 연구 (삼성바이오로직스, 한미약품, 셀트리온 등) 화장품 및 생활화학 산업: 기능성 화장품 및 생활용품 개발 (LG생활건강, 아모레퍼시픽 등) 에너지 및 환경 산업: 배터리, 태양광, 연료전지 개발 (LG에너지솔루션, SK이노베이션, 현대자동차 등) 신소재 및 전자화학 산업: 반도체 및 디스플레이 소재 개발 (삼성전자, SK하이닉스, LG디스플레이 등) 3. 공공 및 교육 분야 중·고등학교 화학교사 (교직 이수 후 임용) 정부 및 공공기관 연구직 (환경부, 산업부, 국가연구소 등) 화학안전 및 품질관리 전문가 (식품의약품안전처, 한국표준과학연구원 등) 4. 창업 및 벤처기업 진출 신소재 개발 스타트업 친환경 화학 제품 개발 및 제조업 기능성 화장품 및 건강기능식품 관련 창업 학과 비전 및 전망 화학과는 21세기 첨단 과학과 융합하여 의약, 신소재, 에너지, 환경 등 미래 사회를 위한 다양한 기술을 연구하며, 창의적이고 혁신적인 연구자 및 전문 인력을 양성하는 것을 목표로 합니다.  친환경 화학 및 지속가능한 에너지 연구 강화 바이오화학 및 의약소재 연구 확대 AI 및 빅데이터를 활용한 스마트 화학 연구 도입 신소재 및 나노화학 연구를 통한 첨단 산업 기여 화학과는 기초과학을 기반으로 한 창의적인 연구와 실무 중심의 교육을 통해 글로벌 화학 산업을 선도할 핵심 인재를 배출할 것입니다."
    },
    {
        "department_id": 5,
        "학과": "회계학과",
        "학과설명": "회계학과는 회계 및 세무 분야에서 전문성을 갖춘 인재를 양성하기 위해 체계적이고 실무 중심적인 교육과정을 운영합니다. 현대 기업 및 공공기관에서는 재무제표 분석, 세무 전략, 내부 감사, 기업 경영 관리 등의 역량을 갖춘 회계 전문가를 필요로 하며, 본 학과는 기업의 재무 건전성을 평가하고 전략적 재무 의사결정을 내릴 수 있는 능력을 배양하는 것을 목표로 합니다.  학생들은 회계원리, 원가회계, 중급회계, 세무회계, 재무관리 등의 핵심 과목을 통해 회계의 이론적 기초와 실무적 기술을 학습하며, 회계사·세무사 자격증 취득 및 공기업·금융기관 진출을 위한 전문 교육을 제공합니다. 또한, 국민연금공단과의 협업, 실무 특강, 산업체 인턴십 등을 통해 실무 경험과 네트워킹 기회를 갖출 수 있도록 지원하고 있습니다.  교육 목표 재무 및 세무 회계 전문가 양성 회계원리, 재무회계, 원가회계, 세무회계를 중심으로 한 회계 실무 능력 배양 기업과 공공기관의 재무 분석 및 세무 전략 수립 역량 함양 실무 중심의 교육 및 자격증 대비 과정 운영 공인회계사(CPA), 세무사, 공무원 회계직 대비 심화 교육 국민연금공단 및 세무공무원(7·9급) 대비 특화 과정 제공 공공 및 민간 부문 진출을 위한 맞춤형 진로 설계 공기업·금융기관·세무 공무원·기업 재무관리자 진출 지원 산업체와 연계한 실습 및 인턴십 제공 AI 및 데이터 분석을 활용한 회계 혁신 연구 최신 회계 및 재무관리 소프트웨어 학습 빅데이터와 AI 기반의 회계·재무 의사결정 기법 습득 연구 분야 회계학과는 전통적인 회계 이론과 최신 회계 기술을 연구하며, 기업 회계, 세무 회계, 관리 회계, 회계 정보 시스템 등 다양한 연구 분야를 포함하고 있습니다.  1. 재무회계 및 감사 기업 회계 및 국제회계기준(IFRS) 연구 재무제표 분석 및 가치평가 기법 연구 내부 감사 및 외부 감사 프로세스 연구 2. 세무회계 및 조세 전략 법인세, 소득세, 부가가치세 연구 및 절세 전략 분석 조세 정책 및 공공 재정 연구 세무 감사 및 조세 회피 방지 연구 3. 관리회계 및 경영 의사결정 원가 회계 및 원가 절감 전략 연구 기업 예산 관리 및 의사결정 회계 연구 성과 평가 및 경영 컨설팅 기법 연구 4. 회계정보시스템 및 AI 기반 회계 분석 ERP(전사적 자원 관리) 및 회계 정보 시스템 연구 AI 및 빅데이터 기반 회계 및 재무 분석 블록체인 기술을 활용한 회계 투명성 강화 연구 교육과정 개요 본 학과의 교육과정은 기초 회계 지식부터 고급 실무 회계 및 세무 전략까지 종합적으로 다루도록 구성되어 있습니다.  1학년 (기초 과정) 회계원리 (Principles of Accounting) 경제학 개론 (Principles of Economics) 경영통계학 (Business Statistics) 컴퓨터 활용 회계 (Computer-based Accounting) 2학년 (기본 과정) 중급회계 I, II (Intermediate Accounting I, II) 원가회계 (Cost Accounting) 세무회계 I (Tax Accounting I) 재무관리 (Financial Management) 3학년 (심화 과정) 고급회계 (Advanced Accounting) 세무회계 II (Tax Accounting II) 회계감사 (Auditing) 경영분석 및 가치평가 (Business Analysis & Valuation) 4학년 (응용 및 연구 과정) 정부회계 및 공공기관 회계 (Government & Public Accounting) AI 및 빅데이터 기반 회계 분석 (AI & Big Data in Accounting) 공인회계사 및 세무사 특강 (CPA & Taxation Certification) 졸업 연구 프로젝트 (Capstone Project) 졸업 후 진로 회계학과 졸업생들은 공인회계사, 세무사, 공기업 및 일반 기업의 회계·재무 전문가로 진출할 수 있습니다.  1. 공인회계사(CPA) 및 세무사(CTA) 회계법인 (삼일, 삼정, 안진, 한영 등 Big4) 세무법인 및 개인 세무사 개업 국제 회계 컨설팅 및 감사 업무 2. 공공기관 및 공무원 국민연금공단, 건강보험공단, 금융감독원, 한국은행, 국세청 세무 공무원 (7급 및 9급) 공기업 및 정부 산하기관 재무관리 직군 3. 일반 기업 및 금융기관 대기업 및 중견기업의 회계·재무팀 (삼성, 현대, LG, SK 등) 은행, 증권사, 보험사 등 금융기관의 리스크 관리 및 투자 분석 스타트업 및 벤처기업의 회계·재무 전략 담당 4. 회계 정보 시스템 및 AI 기반 회계 분석 전문가 ERP 및 금융 소프트웨어 개발사 (SAP, Oracle, QuickBooks) AI 기반 회계 자동화 및 데이터 분석 회사 핀테크 및 블록체인 기반 회계 기술 연구소 취득 가능 자격증 공인회계사(CPA) 세무사(CTA) 전산세무회계 (AT, FAT) ERP 정보관리사 국제재무분석사(CFA) 공공기관 회계 관리사 학과 비전 및 전망 회계학과는 4차 산업혁명 시대의 회계·재무 환경 변화에 대응할 수 있는 전문 인재 양성을 목표로 합니다.  AI 및 빅데이터를 활용한 회계 분석 역량 강화 블록체인 기반 회계 정보 시스템 연구 ESG(환경·사회·지배구조) 회계 및 지속가능 회계 연구 기업 및 공공기관의 재무 건전성 평가 및 위험 관리 역량 배양 본 학과는 체계적인 교육과 실무 중심의 프로그램을 통해 국내·외 회계·재무 전문가를 양성하며, 학생들이 공인회계사, 세무사, 공기업·공공기관 및 일반 기업의 재무 관리자로 성장할 수 있도록 적극적으로 지원하고 있습니다.  회계학과는 미래의 글로벌 회계 전문가를 꿈꾸는 여러분을 환영합니다"
    }
]